{
    "talks": [
        {
            "id": 4560,
            "eventid": 25,
            "title": "Docker Inside\/Out: the ‘real’ real-world of stacking containers in production",
            "description": "So you’ve already containerized the shit out of your code, broken down monoliths, microserviced the hell out of your app and have run some awesome workloads in your local, dev and test environments. It’s all looking good, but now what? Running Docker commands is one thing, but maintaining containers in production is a whole other ballgame. So during this talk I’ll show you the REAL wild world of Docker in production. With the added benefit of talking to and observing how over 900 of our customers have been using Docker in production.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-16",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 4569,
            "eventid": 25,
            "title": "Security Testing with OWASP ZAP in CI\/CD",
            "description": "The OWASP Zed Attack Proxy (ZAP) is one of the world’s most popular and best maintained free and open source security tools. This talk by the ZAP project lead will focus on embedding ZAP in continuous integration \/ delivery pipelines in order to automate security tests. Simon will cover the range of integration options available and explain how ZAP is being integrated into the Mozilla Cloud Services CD pipeline. He will also explain and demonstrate how to drive the ZAP API, which gives complete control over the ZAP daemon.",
            "type": "talk",
            "language": "English",
            "topic": "Security",
            "level": "Beginner",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-16",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4587,
            "eventid": 25,
            "title": "Clouds & Containers: Hit the High Points and Give it to Me Straight, What's the Difference & Why Should I Care?",
            "description": "Numerous examples of containers (Docker, CoreOS), orchestration tools (Swarm, Kubernetes, Mesos), and cloud services (Cloud Foundry, Amazon, Azure, GCP) vie for our attention and implementations. The presenter discusses these technologies, compares them, and _deploys real applications to them LIVE_ to demonstrate subtle differences & tradeoffs each choice imposes upon developers. Seeing is believing; lively follow-on discussions are guaranteed!",
            "type": "talk",
            "language": "English",
            "topic": "DevOps",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-17",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 4592,
            "eventid": 25,
            "title": "Fast Cars, Big Data - How Streaming Can Help Formula 1",
            "description": "Modern race cars produce lot of data, and all this in real time. In this presentation I will show you how data could be generated and used by various applications in the car, on the track or team head quarter.\r\n\r\nThe demonstration will show how to move data using messaging systems like Apache Kafka, process the data using Apache Spark and use various storage technics: Distributed File System, NoSQL Database.\r\n\r\nThis presentation is a great opportunity to see how to build a \" near real time big data application\".\r\n\r\nThe code from this talk will be made available as open source.",
            "type": "talk",
            "language": "English",
            "topic": "Big Data",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-17",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 4607,
            "eventid": 25,
            "title": "Machine Learning Exposed",
            "description": "The term \"machine learning\" is increasingly bandied about in corporate settings and cocktail parties, but what is it, really?  In this session we'll answer that question, providing an approachable overview of machine learning concepts, technologies, and use cases.  We'll then take a deeper dive into machine learning topics such as supervised learning, unsupervised learning, and deep learning.  We'll also survey various machine learning APIs and platforms.  You'll be the hit of your next party when you're able to express the near-magical inner-workings of artificial neural networks!",
            "type": "talk",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Beginner",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-17",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4676,
            "eventid": 25,
            "title": "JWT, WTF?",
            "description": "We live in a world of rich client side applications and we need a secure way to authenticate our users. Session IDs are the traditional solution, but how well do they work for modern applications? You can't leave your credentials in the client, there's always someone malicious just waiting to steal them.\r\n\r\nEnter the JWT. These fancy little tokens can authenticate our users and our transactions because they know what they're allowed to do. We'll take a look at what JWTs can be used for, why to choose JWTs, how to generate them, and most importantly how to keep them.",
            "type": "talk",
            "language": "English",
            "topic": "Security",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-16",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 4751,
            "eventid": 25,
            "title": "Hacking Culture with Javascript",
            "description": "Most every remote-enabled team uses real-time-communication software of one sort or another, but usually it's a chat room. Lately, even co-located teams are signing up for this. So now that a bunch of our togetherness is in a chat room, we can gently introduce robots to do some of our scut work for us. Let's take a look at what happens when the robot becomes not just a tool, but a part of the team.",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-17",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4774,
            "eventid": 25,
            "title": "Beyond Fault Tolerance: achieve Resilience with Actor programming",
            "description": "The Actor model has been around for a while, but only the Reactive revolution is bringing it to trend. Find out how your application can benefit from Actors to achieve Resilience - the ability to spring back into shape from a failure state. Akka is a toolkit that brings Actors to the JVM - think Java or Scala - and that leverages on them to help you build concurrent, distributed and resilient applications.",
            "type": "talk",
            "language": "English",
            "topic": "Reactive Programming",
            "level": "Beginner",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-16",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 4775,
            "eventid": 25,
            "title": "MicroMonolith - Top anti-patterns of adopting distributed system",
            "description": "The age of monoliths is gone. Cloud is not going away, it is here to stay. Distributed computing is on the rise. The time is now to catch up with the trend.\u000b\u000b\r\n\r\nJoin me in this talk and be part of a journey from monolithic system to microservices based distributed application.  This won't be an easy road. Such a fundamental change in how we do software is riddled with anti-patterns and sub-optimal choices. \u000b\u000bMy team has done it! And we want to share our path so that yours will be much more simpler. All you need to do is come and listen.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-17",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4797,
            "eventid": 25,
            "title": "The road to continuous deployment: a case study",
            "description": "It's a situation many of us are familiar with: a large legacy application, limited or no tests, slow & manual release process, low velocity, no confidence.... Oh, and management wants new features, fast.\r\n\r\nUsing examples and lessons learned from a real-world case, I'll show you how to strangle a legacy application with a modern service architecture and build a continuous integration and deployment pipeline to deliver value from the first sprint. On the way, we’ll take a look at the process, automated testing, monitoring, master\/trunk based development and various tips and best practices.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-16",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 4833,
            "eventid": 25,
            "title": "Templating - you're doing it wrong",
            "description": "Templating separates logic from presentation in different files, but we still need to glue them together somehow so we use a specialized mark-up language. And nobody minds yet another language or the burden when testing the templates.\r\n\r\nBut there already is a widely used and proven mark-up language in every HTML document: HTML itself. In this talk, I'm proposing an new approach to writing templates for web applications, called Template Animation, that leverages the capabilities of HTML to create highly maintainable templates, requiring no tools besides the browser for development and testing.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-17",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 4859,
            "eventid": 25,
            "title": "Functional programming is not just lambdas!",
            "description": "Functional programming is a trending topic, especially in web development. People often try to explain its essence with too theoretical concepts (monads) or too superficial points of view (it's just lambda functions). I will help you understand and feel what it really is and why it matters in the real world.\r\n\r\nWe will see fundamental functional programming concepts, and apply them with JavaScript to get better code. Writing good code means spending less time to fix bugs or add features!",
            "type": "talk",
            "language": "English",
            "topic": "Languages",
            "level": "Beginner",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-16",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 4865,
            "eventid": 25,
            "title": "Relevant search results (with elasticsearch)",
            "description": "You want to give your site visitors the best user experience. To accomplish this, your visitors can search as well as browse your content. Search is only relevant when results are meaningful to the visitor. In this talk, Jettro will introduce you to the concepts like precision, recall and relevancy. Jettro uses Examples to show concepts in the context of search, autocomplete, suggestions and grouping of results. Used technologies are: Angular, Java and elasticsearch. After the presentation you'll have a good idea about the steps you need to take te present your visitors relevant results.",
            "type": "talk",
            "language": "English",
            "topic": "Big Data",
            "level": "Beginner",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-17",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4871,
            "eventid": 25,
            "title": "Bad People, Bad Computers",
            "description": "Earlier this year, NPR did a story answering the question, can computers be racist? (Yes.) Not soon after, Microsoft launched an AI chatbot experiment, called Tay, which shut down when the software began spewing hateful speech on Twitter. One of the knowns fears of AI and machine learning is the notion of algorithmic bias, which can create or indirectly allow machines to learn prejudiced behavior. In this talk, we will explore what it really means to “teach” a computer to have prejudices, and what this can mean for the future of computing.",
            "type": "keynote",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-17",
            "starttime": "09:30:00",
            "endtime": "10:10:00"
        },
        {
            "id": 4887,
            "eventid": 25,
            "title": "How to write maintainable code",
            "description": "The problem that new technology doesn’t fix is unmaintainable code. Clean code with good tests is essential, but not enough. This talk introduces techniques like getting better at naming, explaining code with tests, the few code comments you actually need, README-driven development and writing Minimum Viable Documentation. After the excitement of adopting new technology and software craftsmanship comes the horror of your next software maintenance project. As Jean-Paul Sartre said*, ‘Hell is other people’s code’. Whatever your level, your future happiness depends on maintainable code.",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-16",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 4895,
            "eventid": 25,
            "title": "Urban Legends: What You Code Makes You Who You Are",
            "description": "If you were a carpenter, would your skills at building be more important than the tools you use to build? Skills, right?  Tools are just a means to an end.  So why do developers think the language they use defines the problems they solve?\r\n\r\nThis talk will take a look at misconceptions across the board, some experiences, both positive and negative, people have had crossing barriers to new languages, and show some of the benefits thinking of one's self as a coder and not a \"Ruby coder\" or a \"PHP dev\" can have on being a better problem solver.",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-16",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5036,
            "eventid": 25,
            "title": "Building a theming system with React",
            "description": "In my career I've created several component libraries, and always found it challenging and rewarding at the same time. The engine we developed at WorkWave is the result of such attempts: it offers a great tradeoff between flexibility and ease of use. Styling with inline styles greatly simplifies the developer's work while the use of Aphrodite to output real classes enables the full spectrum of css features. I'll show you the choices we made, what problems have arisen while developing the components and how we solved them, hopefully helping you make better choices for your own libraries.",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-17",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 5077,
            "eventid": 25,
            "title": "Programmer Bedtime Stories",
            "description": "Algorithms as Allegory… Hear the cautionary tale of \"The Recursed Army,\" the mathematical mystery of how 16 cows become 14.9 in \"the F.arm(er) and the GigaCow,\" the observer pattern helps a king navigate palace intrigue and royal succession in \"King Floyd and the 17 Princes,\" and variable scope creates the locked room mystery \"A gun, a dame, and a scope.\"",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-16",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5080,
            "eventid": 25,
            "title": "Tell a Robot to Shake Its Booty",
            "description": "Robots and voice control go together like pancakes and syrup. And both robotics and voice control are being opened up to larger and larger audiences via free and\/or open source toolkits. This presentation will demonstrate ways to add voice control to a web site through both local and remote APIs, then pass recognized commands to a robot, requiring no more special equipment than a $100 consumer-market robot and a bluetooth equipped laptop.",
            "type": "talk",
            "language": "English",
            "topic": "IoT\/Maker",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-17",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5084,
            "eventid": 25,
            "title": "A recommendation engine for your applications",
            "description": "Nowadays a lot of websites try to guess what we could like:\r\n\"Recommendation for you in books\"\r\n\"People you may like\"\r\nSounds familiar, isn't it? Wouldn't be cool if you could do the same in your application? Well, this session is for you! In the first part of this talk recommendation systems will be introduced, focusing on collaborative filtering algorithms (CR). After that we'll dive in Prediction.io, an open source machine learning server for software developers to create predictive features, such as personalization, recommendation and content discovery.",
            "type": "talk",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-17",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5095,
            "eventid": 25,
            "title": "How remote work redefines productivity",
            "description": "When it comes to remote work, our current industry state has strange productivity metrics. The quantity of the office spent hours seems to matter more than the quality of the work done, even though it can lead to a toxic, over-competitive environment or even burnout. Building a healthy work culture without physical proximity is ultimately a trust exercise and here’s something to be said about productivity when you shift focus onto variables like discipline, proactivity, creativity, handling distractions and working without guidance.",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-16",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5130,
            "eventid": 25,
            "title": "Microservices: 5 things I wish I'd known",
            "description": "Microservices are hot! A lot of companies are experimenting with this architectural pattern that greatly benefits the software development process. When adopting new patterns we always encounter that moment where we think 'if only I knew this three months ago'. This talk will be a sneak peak into the world of microservices at Atlassian and reveal what we've learned about microservices: how to arrange, configure and build your code efficiently; deployment and testing; and how to operate effectively in this environment. In this talk you will learn how to immediately apply five simple strategies.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-16",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5132,
            "eventid": 25,
            "title": "Going fullstack React(ive)",
            "description": "What if someone told you that you could use the full capacity of your server? That you could have the same performance on the backend as your react frontend? Don't you believe it? That you could choose the best language\/tool for the task and you were not limited by what you already know?\r\n\r\nIn this talk, I'll show you that you can use the full power of React on the frontend and Vert.x on the backend. You will see a fast full stack development workflow with Rollup\/Webpack + Babel + React. How you can mix JavaScript with any other language. Build microservice applications in minutes.",
            "type": "talk",
            "language": "English",
            "topic": "Reactive Programming",
            "level": "Beginner",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-16",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5133,
            "eventid": 25,
            "title": "From Doctor to Coder: A Whole New World?",
            "description": "Everyone who calls themselves a \"coder\" had to start somewhere. For some of us, that start was in an unrelated field. This talk brings you along on a young doctor's joyous journey from the wondrous world of medical academia into the terrifying territory of tech. We'll reflect on differences and similarities between the medical and technical worlds and the learning process after a career switch. We'll discuss practical insights in what makes tech learning unique and what might make it better, and \"behind the scenes of tech\" glimpses that left this newbie coder wishing for blissful ignorance.",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-17",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 5162,
            "eventid": 25,
            "title": "WebAssembly for the rest of us",
            "description": "Did you ever want to port that cool game you built to the browser? Or have your 3D design app work there as well? It's already possible now, but it will get even better in the future! We have asm.js as a subset of JavaScript, optimized for use cases like games, compression or image editing. Now WebAssembly promises to take this one step further by reducing storage size and decoding time, while providing the same safe sandboxed environment with near-native performance. It takes your native code, no matter if C or Rust, and turns that into something that runs blazingly fast in your browser.",
            "type": "talk",
            "language": "English",
            "topic": "Languages",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-16",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5167,
            "eventid": 25,
            "title": "Microservices Without Servers",
            "description": "Servers kill your productivity. Rather than building software, you end up maintaining computers. Wasn't the \"cloud\" supposed to fix this? It sounded so promising until we realised it was just renting VMs in a remote datacenter. We couldn't escape \"servers\". Until now!\r\n\r\nIn this session, we'll learn how to build microservices without servers, using modern serverless platforms. We’ll look at common challenges (and solutions) to building applications using serverless stacks. Exploring serverless design patterns will give developers the knowledge to build architectures using these new platforms.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-17",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5234,
            "eventid": 25,
            "title": "Introduction to gRPC: A general RPC framework that puts mobile and HTTP\/2 first",
            "description": "gRPC is a high performance, language-neutral, general RPC framework developed and open sourced by Google. Built on the HTTP\/2 standard, gRPC brings many benefits such as bidirectional streaming, flow control, header compression, multiplexing and more. In this session, you will learn about gRPC and how you can use it in your applications.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Beginner",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-16",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5294,
            "eventid": 25,
            "title": "Machine learning from a software engineer's perspective",
            "description": "Lot's of software engineers seem to avoid the field of machine learning because it seems hard. In this talk I want to give developers an intuition of what machine learning is using visual examples and without using mathematical formulas. I want to show that machine learning will make things possible that cannot be achieved using traditional procedural programming. I will identify high level components of a supervised machine learning algorithm: vectors, feature spaces, neural networks and labels.",
            "type": "talk",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-16",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5299,
            "eventid": 25,
            "title": "Building multi lingual and empatic bots",
            "description": "We are entering an era where interactions with computers will drastically chance. Standard I\/O will be replaced by solutions that interact with natural language either spoken or written. The signs of this change are the numerous bots that appear everywhere.\r\nThe most popular are chatbots. This session focusses on bots, to access them with any client and to create meaningful dialogs respecting the language and emotion of the user. \r\nOf course this session contains code and I demonstrate bots node.js, php, c#, running an platforms like Amazon, Google & Azure.",
            "type": "talk",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-17",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 5317,
            "eventid": 25,
            "title": "A real-world Relay application in production",
            "description": "This is the tale of how we, at Balsamiq, rolled out our new web-app, from greenfield to production. A real-world application with real-time collaboration, built using Relay, Redux, React-rendered html emails, node.js, Redis, etc., running on AWS using Convox. Even at small\/medium scale, if you're serious about building a good product you will eventually have to build a complex stack. I will share the details of the services we use, how we make them fit together and what we learned in the process.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-16",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 5321,
            "eventid": 25,
            "title": "ClojureScript - Making Front-End development Fun again",
            "description": "Front-end development has an amazing assortment of libraries and tools, yet it can seem very complex and doest seem much fun.  \r\n\r\nSo we'll live code a ClojureScript application (with a bit of help from Git) and show how development doesn't have to be complex or slow.  Through live evaluation, we can build a reactive, functional application.\r\n\r\nWhy not take a look at a well designed language that uses modern functional & reactive concepts for building Front-End apps.  You are going to have to trans-pile anyway, so why not use a language, libraries and tooling that is bursting with fun to use.",
            "type": "talk",
            "language": "English",
            "topic": "Languages",
            "level": "Beginner",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-16",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 5322,
            "eventid": 25,
            "title": "Data Pipeline Evolution",
            "description": "How do you build a big data pipeline when the size of your data starts to get out of hand? How do you improve on the initial model when people are demanding more data, and faster?\r\nThis talk covers the evolution of a data pipeline in Python, from daily full load to up-to-the-minute event stream, based on our experience at FanDuel. Technologies covered include Amazon EMR, Redshift, Hadoop, Luigi, Spark and Kinesis. We also look at the challenges and trade-offs, and building a big data engineering team.",
            "type": "talk",
            "language": "English",
            "topic": "Big Data",
            "level": "Beginner",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-16",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5327,
            "eventid": 25,
            "title": "Data Science Apps: Beyond Notebooks",
            "description": "Jupyter notebooks are transforming the way we look at computing, coding and problem solving. But is this the only “data scientist experience” that this technology can provide?\r\n\r\nIn this talk, Natalino will sketch how you could use Jupyter to create interactive and compelling data science web applications and provide new ways of data exploration and analysis. In the background, these apps are still powered by well understood and documented Jupyter notebooks.",
            "type": "talk",
            "language": "English",
            "topic": "Big Data",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-17",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5331,
            "eventid": 25,
            "title": "DevOps in the era of serverless computing",
            "description": "Computing is moving fast towards an API-only model where canonical infrastructure (containers, VM's and servers) are rendered obsolete and replaced by an undefined, \"serverless\" Function-as-a-service (FaaS) model. If this is the lay of the land, what roles are left to the army of \"DevOps engineers\" that are now filling the ranks of uncountable enterprises and startups? As any transformational change, fear and anxiety for job security might lead some to close down and reject the unstoppable trend upon us; however, I'll argue that this could be the beginning of a DevOps 3.0 revolution.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-17",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5334,
            "eventid": 25,
            "title": "Developing and maintaining a Java GraphQL back-end: The less obvious",
            "description": "With a slew of benefits, GraphQL also introduces its own set of hurdles. With best practices yet to be discovered for many use-cases, careful consideration upfront is imperative.\nThis talk aims to highlight issues less obvious at the beginning of a GraphQL-enabled project, with special focus on dealing with development and maintenance of a GraphQL schema. An approach leveraging dynamic schema generation is proposed in attempt to lower the effort needed to expose new or existing Java services while keeping the schema at all times in sync with the changes.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Beginner",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-17",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5350,
            "eventid": 25,
            "title": "Build it and they will not come: being a programmer in the 21st century",
            "description": "In a world of open source, open ideas, and open collaboration, incredible opportunity exists for programmers that know how to grasp it. Participating in open source and the worldwide discussion of ideas can be a powerful way to boost your career, improve your skills, and lead a more fulfilling programming life. Succeeding in this world can be a struggle – the well known phrase \"build it and they will come\" could not be more false. Success requires you to grow in many new ways. For those willing to push their boundaries, the rewards are worth the effort a hundred times over.",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-16",
            "starttime": "17:00:00",
            "endtime": "17:40:00"
        },
        {
            "id": 5358,
            "eventid": 25,
            "title": "The Hitchhiker's Guide to the Webpack",
            "description": "We all know how amazing Webpack is, we have all heard it somewhere that we should start using it right now the problem usually is how to start. The configuration is not really self-explanatory and can sometimes get really confusing so in this talk I will walk us through getting Webpack set up as we can all make sense of the configuration and what little part does and be ready to start our own projects.",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Beginner",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-16",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5429,
            "eventid": 25,
            "title": "Explain It!",
            "description": "Have you ever thought about how much of software engineering involves explaining things? We stick comments in our program to explain why we added X to Y, we write README files to explain the program, and we spend the afternoon explaining the whole thing to the new person. A decent explanation can be the difference between success and obscurity.\r\n\r\nIn this talk Russ Olsen will run through the things that you can do to craft explanations that are clear, engaging and perhaps even a bit funny. Russ will do his best to be clear, engaging and perhaps a bit funny.",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-17",
            "starttime": "17:00:00",
            "endtime": "17:40:00"
        },
        {
            "id": 5433,
            "eventid": 25,
            "title": "The Most Important Thing",
            "description": "Steve Jobs used to always talk about the \"most important thing,\" what he sometimes called the \"high-order bit,\" the thing we should be working on, and thinking about, to the exclusion of others.\r\n\r\nWhat does it mean? How do we recognize it? Why is it important? What is our \"most important thing,\" and what is the most important \"most important thing\"?\r\n\r\nThis might sound trivial, but it’s not. This talk will be inspiring, but it will also be upsetting. Often the most important thing is not what we wish it was, and finding it can be like Armageddon, as your entire future is destroyed.",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-16",
            "starttime": "09:30:00",
            "endtime": "10:10:00"
        },
        {
            "id": 5451,
            "eventid": 25,
            "title": "Designing for cross channel user experience",
            "description": "Users often don't complete an activity in one sitting or through a single channel. Sometimes users are interrupted, sometimes it is more appropriate to switch device, or they move from the digital world to the physical world (and vice versa) by choice or necessity. For these reasons, it's important to offer a seamless experience as users move from channel to channel to complete activities. This experience report will give practical advice for cross device design for users and the importance mobile technology plays in the role of seamless experiences.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Beginner",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-16",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5471,
            "eventid": 25,
            "title": "Developing apps for sensors and connected devices",
            "description": "With connected devices on the rise, app development is going well beyond creating a few screens. How does external hardware behave and what is its impact on app development? \r\n\r\nIn this talk we go in depth on what it means for an app developer to communicate with devices like lightbulbs, hearing aids and iBeacons. We’ll see that an app developer has massive impact on a hardware related project and you’ll walk away with learnings from real life projects.",
            "type": "talk",
            "language": "English",
            "topic": "Mobile",
            "level": "Advanced",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-17",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5541,
            "eventid": 25,
            "title": "Containers Change Everything",
            "description": "Why all the fuss about containers? In this talk I'll cover the evolution of production from physical servers through VMs to containers, what we gained and lost at each stage and what the future holds for containerised production environments.\r\n\r\nKnowledge requirements: a beginners grasp of GOT terminology",
            "type": "talk",
            "language": "English",
            "topic": "DevOps",
            "level": "Beginner",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-16",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5617,
            "eventid": 25,
            "title": "Now you can trust the browser.",
            "description": "Developers are taught to 'never trust the browser' to execute their client-side JavaScript. The inability for a developer to trust a browser has far reaching implications from not trusting client-side validation, to never being really sure the TLS connection doesn't have a man-in-the-middle. Software security such as white-box cryptography & obfuscation have been used in native environments for many years, but these techniques are hard in JS. We'll explain how these techniques can now be applied to JS code running in a web browser to secure it from MITM attacks.",
            "type": "talk",
            "language": "English",
            "topic": "Security",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-16",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5667,
            "eventid": 25,
            "title": "Applying “web scale” patterns in the bol.com back office",
            "description": "In this session we show you how we use “web scale” patterns to achieve scalability and flexibility in our back office software. We will guide you through how we apply patterns like CQRS, event sourcing, polyglot persistence and micro services to solve puzzles in our back office services. Interesting is that in our experience we don’t needs these just to solve technical problem. It helps us to solve some of our business problems!",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Beginner",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-17",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5703,
            "eventid": 25,
            "title": "Angular is On Fire(base)!",
            "description": "Firebase is a great platform that gives a suite of tools with which you can easily create and manage your app’s backend, and concentrate on developing a marvelous frontend. This is where Angular steps in: it helps you build your app in component-based architecture, and provides solutions for various client-side aspects. The combination of the two gives a powerful connection between the application and the database. In this lecture I’ll show how to implement common use-cases of users and data management by leveraging Firebase’s and Angular’s strengths: realtime synchronization, OAuth and more.",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-16",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 5720,
            "eventid": 25,
            "title": "Real life cross-platform application development using Xamarin Forms.",
            "description": "Now Xamarin has been bought by Microsoft there is even more talk about it. In this session I will walk you through the development process of a real life Xamarin Forms application.\r\nThe session will include a quick overview about difference between normal Xamarin development and Xamarin Forms. After that we will do a deep dive into the development tools and design patterns used to develop the application.\r\nIt will show how you can create native apps with 90% code sharing among Android, iOS and Windows.",
            "type": "talk",
            "language": "English",
            "topic": "Mobile",
            "level": "Beginner",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-16",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 5723,
            "eventid": 25,
            "title": "The shape of the games industry seen from a developer's viewpoint",
            "description": "The games industry is a sprawling business with over $100bn turnover per year, but its audience spans genders, generations, and communities. How can we make sense of the diverse results of video game development?\r\n\r\nIn this talk, Dr. Mata Haggis presents a model that allows both outsiders and developers to gain an overall understanding of the commonalities and differences in the areas of games development. Taking a view from the perspective of the developers themselves, this model creates a coherent picture of this exciting and innovative medium.",
            "type": "talk",
            "language": "English",
            "topic": "Game Dev",
            "level": "Beginner",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-16",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5728,
            "eventid": 25,
            "title": "A million decisions: Looking back at Action Henk",
            "description": "Three years ago we started the development of our debut game 'Action Henk'. After a crazy rollercoaster ride, we now have a game out there on Steam and consoles. Now that the dust has settled a bit, we can take a look back at the vast amount of decisions made during the development. We will dive into both the awesome and awful choices we made on things such as tech, design, business and marketing.",
            "type": "talk",
            "language": "English",
            "topic": "Game Dev",
            "level": "Beginner",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-16",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 5757,
            "eventid": 25,
            "title": "Creating Art with a Raspberry Pi",
            "description": "Coding has opened up a channel for self-expression and experimentation that I never imagined possible. Inspired by a visit to an art museum, I created an interactive LED art project. This project started out as challenge to become better at writing javascript, but I found a new passion working with hardware despite a severe lack of technical knowledge. I’ll share my story of building with hardware for the first time and how I found ways to overcome my lack of skills and confidence, so that you’ll want to tackle your hardware project and won’t give up on it before you ever get started either.",
            "type": "talk",
            "language": "English",
            "topic": "IoT\/Maker",
            "level": "Beginner",
            "room_order": 1,
            "room": "Small container",
            "date": "2017-05-17",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 5760,
            "eventid": 25,
            "title": "Building Platforms for Developers",
            "description": "Join this session for a retrospective on how Uber built and launched the Uber Developer Platform. Find out how Uber designed, implemented, and adapted its API to be successful for third-party developers to integrate with the Uber experience. We will dive into what went amazing, what we would have done differently, and how we moved at Uber speed to let builders build.",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-17",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 5764,
            "eventid": 25,
            "title": "Developing apps for developing countries",
            "description": "App development for developing countries introduces a slew of new challenges: smartphones function as a user's main point of connection, local demand for use of mobile apps and web is different and the infrastructure places strict limits on users' internet data volume.\r\n\r\nIn this talk we'll discuss how the mobile world looks like in developing countries: what apps are like, what are the common devices, what are the current initiatives to increase internet connectivity and how is all this related to financial inclusion.\r\n\r\nWe'll then discuss further potential solutions to those challenges.",
            "type": "talk",
            "language": "English",
            "topic": "Mobile",
            "level": "Beginner",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-16",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5774,
            "eventid": 25,
            "title": "Mesoservices: Architecture for optimal trade-off between engineering and operations efficiency",
            "description": "Microservice based architectures are the de-facto standard for newly written software. At Picnic, we developed a large number of services ranging from frontend shopping services to backend supply chain services. All services are tightly integrated, scalable, and highly adaptable. However, this leads also to less clean APIs, unwanted dependencies, extra development time, and instability. \r\n\r\nIn this talk we explain how we deviated from a dogmatic approach to microservices towards mesoservices with less service granularity for faster development and shorter time-to-market.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-16",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 5779,
            "eventid": 25,
            "title": "Faster deep learning solutions from training to inference",
            "description": "Intel Deep Learning SDK enables using of optimized open source deep-learning frameworks, including Caffe and TensorFlow through a step-by-step wizard or iPython interactive notebooks.\r\n\r\nIt includes easy and fast installation of all depended libraries and advanced tools for easy data pre-processing and model training, optimization and deployment, providing an end-to-end solution to the problem.\r\n\r\nIn addition, it supports scale-out on multiple computers for training, as well as using compression methods for deployment of the models on various platforms, addressing memory and speed constraints.",
            "type": "talk",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Beginner",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-16",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5792,
            "eventid": 25,
            "title": "The power of the dark side - Dark patterns and Mobile UX Design",
            "description": "Dark UX design patterns are stratagems that by choice introduce an element of confusion in order to guide, often with malice, the user in a desired direction. In this talk we will explore some of the most used and abused dark patterns, with particular attention to mobile apps. Let's find out how much seductive is the power of the dark side.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Beginner",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-16",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5795,
            "eventid": 25,
            "title": "Debug, Analyze and Optimize Games with Intel Tools",
            "description": "Use the full potential of your favorite platform while improving a videogame's frame rate and performance with GPA (Graphic Performance Analyzer), a free tool powered by Intel. Featuring a convenient panel overlay, you can quickly identify problem areas and experiment with improvements without having to recompile the source code. System Analyzing to isolate common bottlenecks that affect your game's performance in real time. Analyze performance on a single frame down to the draw call level. Identify where you can evenly distribute workloads across the CPU and GPU.",
            "type": "talk",
            "language": "English",
            "topic": "Game Dev",
            "level": "Beginner",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-17",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5797,
            "eventid": 25,
            "title": "CSS Houdini - from CSS variables to JavaScript and back",
            "description": "CSS Custom Properties are added to all the major browsers and provide the ability to use the CSS native variables power which is a huge step to the future of CSS.\r\nNow is time to do the next one- to have an ability to register the new CSS Custom properties from JavaScript, which should be performant as the native CSS properties, animatable and aligned CSSOM.\r\nCSS Houdini spec allows to do it, set the valid property values and many other things.\r\nThis brings CSS to the next level and is one of the important steps to the bright CSS future.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-17",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 5802,
            "eventid": 25,
            "title": "Death by a thousand paper cuts — User Experience and complexity",
            "description": "All non-trivial software inevitably grows in complexity over time. Regardless of best intentions, with continuous releases of new functionality, design debt threatens to cripple our applications: they become confusing and increasingly hard to understand and use.\r\n\r\nAlexandra will share lessons learnt and make suggestions on how to avoid overcomplicating our UIs as our applications grow.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-17",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 5803,
            "eventid": 25,
            "title": "Pentesting ChatOps",
            "description": "ChatOps, a concept originating from Github, is chatroom-driven DevOps for distributed teams, using chatbots (like Hubot) to execute custom scripts and plugins. We have applied the concept of ChatOps to the penetration testing workflow, and found that it fits outstandingly – for everything from routine scanning to spearphishing to pentest gamification. This talk discusses the tools that we use (RocketChat, Hubot, Gitlab, pentesting tools), and provides battle stories of using Pentesting ChatOps in practice.",
            "type": "talk",
            "language": "English",
            "topic": "Security",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-17",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5806,
            "eventid": 25,
            "title": "Mobile Library Development - stuck between a pod and a jar file",
            "description": "Isaac Newton, the father of modern software engineering, called it “Standing on the shoulders of giants”. \r\nModern development is exciting as it gets easier and easier, partly because of the wealth of resources available at our fingertips. One category of these resources are libraries, SDKs, and frameworks.\r\n\r\nThis talk will be a guide into the considerations that go into building a library for both iOS\/Swift and Java\/Android. We will be taking cues from both my personal experience, as well as from studying how the leaders in the field do it.",
            "type": "talk",
            "language": "English",
            "topic": "Mobile",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-16",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5821,
            "eventid": 25,
            "title": "\"We're Agile, we don't do documentation\"",
            "description": "In Agile, we value “working software over comprehensive documentation” - there is value in documentation, but we value working software more. This helps us get things done and avoid waste. However, extremes are very common: teams who avoid documentation altogether (“our code is self-documenting”), or teams who create way too much documentation. This talk will cover how to leverage documentation to improve team documentation, align everybody to a common vision, as well as underutilised forms of documentation that go beyond drawing the current system state.",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-16",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 5824,
            "eventid": 25,
            "title": "From Kitchen Table to Publisher Advance in 3 Years",
            "description": "I will share a story about our road from actual kitchen table ideas to securing a publisher advance of half a million within 3 years as an indie.\r\n\r\nTopics in there will include \"Funding mixes (Crowdfunding, Angel Investor), Strategic Choices, Growing company, Publisher negotiations.",
            "type": "talk",
            "language": "English",
            "topic": "Game Dev",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-17",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 5834,
            "eventid": 25,
            "title": "HTTP\/2 in action",
            "description": "We've all heard about HTTP\/2, but what's in it for us? Is it really that much better? How can we start using it?\r\n\r\nDuring this talk, we will explore HTTP\/2's new features while creating our own web server, demonstrating new features like server push, multiplexing and header compression. At then end, we can proof how HTTP\/2 benefits not only the end user, but developers and operations as well!",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-17",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5838,
            "eventid": 25,
            "title": "From IoT to Human Interactions: Voice and Messages to the rescue",
            "description": "What if your surveillance drones could text you in the middle of the night ?\r\nWhat if your Home Wifi could send an SMS as your kids get home ?\r\nWhat if a Voice Machine could speak Code Motion Amsterdam upcoming sessions ?\r\nJoin this session to learn how to turn your data into engaging Phone Interactions.\r\n\r\nWe'll guide through the code of the CodeMotion Amsterdam Voice Machine,\r\nand show how the Tropo Serverless platform makes it possible in a few lines of Javascript.\r\n \r\nWant to try it by yourself ? Pass by the Cisco labs where we'll take you from zero to your first Voice Machine in minutes.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Beginner",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-16",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5839,
            "eventid": 25,
            "title": "Building advanced ChatBots",
            "description": "If it takes minutes to code a bot, building professional bots represents quite a challenge. \r\nSoon you realize you need serious programming and API architecture experience but also “Bot” specific skills.\r\n\r\nIn this session, we'll first show the basics to build a ChatBot.\r\nThen we'll explore the challenges faced when creating advanced Bots (Context storage, NLP approaches, Bot Metadata, OAuth scopes), and discuss interesting opportunities from latest industry trends (Bot platforms, Serverless, Microservices).\r\n\r\nThis talk is about showing the code and sharing lessons learnt.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-16",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5840,
            "eventid": 25,
            "title": "Next generation human character control",
            "description": "Human character control has always been a challenging task in game development, but this has been changing in recent years. New technology enables making animations that are more realistic on a budget. In this talk we will discuss the latest advances in interactive human character animation and control including budget body tracking, artificial behaviour and physics interaction. This is an important development for virtual reality, but can be used for any environment with human characters.",
            "type": "talk",
            "language": "English",
            "topic": "Game Dev",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-17",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5847,
            "eventid": 25,
            "title": "Without Vision, you'd be blind",
            "description": "In game design, we trust our senses. Is this mechanic fun? Is this Environment beautiful? Is this story emotional? Is the game GOOD?\r\n\r\nHowever, as time passes and our project evolves, so do we. We are not the same person we were a minute ago, a month ago, a year ago. \r\n\r\nHow can we maintain a steady vision if we ourselves are a constantly changing, complex interlacing of feelings and ideals? \r\n\r\nA practical look at how to establish a strong identity for a project: the beacon which will lead future decisions in design, art and production.",
            "type": "talk",
            "language": "English",
            "topic": "Game Dev",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Breakout Zuid",
            "date": "2017-05-17",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5849,
            "eventid": 25,
            "title": "You don't need permission to do that",
            "description": "Overcoming the fear of operations when everyone is better at it than you.  Personal journeys and stories from developers joining an managed service provider.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps",
            "level": "Beginner",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-16",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 5855,
            "eventid": 25,
            "title": "The power of Connections",
            "description": "You live in an exponential era. It’s time to look with “new eyes” to the world around you and the empowerment you have to change and innovate our economy & society by rethinking and reprogramming legacy processes using the new building blocks the Internet-of-Everything will offer. The Internet must be made ready to handle trillions of new interactions between people, processes, data and things, whilst being intelligent, secure, open and programmable. You have the opportunity (or obligation?) to be involved. The world around screams for an update and needs developers to lead.",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Big Container",
            "date": "2017-05-16",
            "starttime": "09:00:00",
            "endtime": "09:20:00"
        },
        {
            "id": 5856,
            "eventid": 25,
            "title": "AAA on a Shoestring …  in Your Spare Time",
            "description": "Lead Designer, David Wessman (X-Wing, TIE Fighter, Saints Row, etc.) discusses Starfighter Inc, a hard science fiction based multiplayer space combat simulator currently in development at Impeller Studios, a virtual studio composed of part-time and (mostly) unpaid developers who span the globe from the US to the EU, as well as Lebanon, South America and Australia! This talk covers the many challenges encountered in creating a AAA-quality game when everyone has a day job and lives in a different time zone.",
            "type": "talk",
            "language": "English",
            "topic": "Game Dev",
            "level": "Beginner",
            "room_order": 2,
            "room": "Studio 1",
            "date": "2017-05-17",
            "starttime": "14:00:00",
            "endtime": "14:40:00"
        },
        {
            "id": 5872,
            "eventid": 25,
            "title": "Microservices and containers networking: Contiv, an industry leading open source solution from Cisco",
            "description": "Contiv provides a higher level of networking abstraction for microservices: it provides built-in service discovery and service routing for scale out services, working with schedulers like Docker Swarm, Kubernetes, Mesos and Nomad. \r\nWe will see some code examples, basic use cases and an easy tutorial on the web.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps",
            "level": "Beginner",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-17",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5884,
            "eventid": 25,
            "title": "Security\/Privacy in the IoT generation",
            "description": "The growth of Internet of Things (IoT) in our daily life creates immense opportunities and benefits for our society.\r\nHowever, IoT security has not kept up with the same rapid pace of innovation and development. This situation creates substantial security flaws and putting our privacy at risk. This talk will present the new challenges we are facing with the new revolution of IoT, including concrete demonstrations. In addition, we will present possible solutions how to deal with those challenges. Finally, we will do some fun coding by a POC on one of these solutions.",
            "type": "talk",
            "language": "English",
            "topic": "Security",
            "level": "Beginner",
            "room_order": 4,
            "room": "Breakout Noord",
            "date": "2017-05-17",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5918,
            "eventid": 25,
            "title": "Life of a startup: From the Monolithic MVP to Scalable Reactive Microservices",
            "description": "Building a minimum viable product in 3 months is easy. Scaling it towards a reactive system that can handle thousands of requests per second and deploying new versions without causing a denial of service is another challenge.\r\n\r\nFind out how at Crobox we scaled from a single machine (and point of failures) towards the high-available server cluster we are now running. On this journey you can also learn how we solved challenges with monitoring, logging and deployments.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Architectures",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-17",
            "starttime": "15:00:00",
            "endtime": "15:40:00"
        },
        {
            "id": 5919,
            "eventid": 25,
            "title": "Let's save the internet: How to make browsers compatible with the web",
            "description": "Is it possible for a site written today to continue to work in 10 years? Likewise, could existing code complicate adding language features or fixing mistakes in web APIs?\r\n\r\nIn this talk I'll discuss the issues that arise when browsers attempt to clean up the web platform, either by adding new language features and DOM APIs or removing old ones — while attempting to remain backwards compatible. I'll even talk about some controversial moves made by browsers to support non-standard (cough webkit prefixes) CSS and JS.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Studio 2",
            "date": "2017-05-17",
            "starttime": "16:00:00",
            "endtime": "16:40:00"
        },
        {
            "id": 250000,
            "eventid": 25,
            "title": "Learn to build Bots and add Video, SMS, Voice to your apps by using Cisco Spark and Tropo and win and Apple Watch!",
            "description": "In this lab you will definitely get in touch with the new Cisco capabilities provided by Spark and Tropo services.\r\nIf you are working on an app and you wish to boost the communication capabilities, don’t miss these labs!\r\nMeet Cisco specialists who will help you in discovering all the functionalities of Cisco Spark and Tropo and actually help you to integrate them in your app easily.\r\nCome and say hello at any time. The entrance is free and you can choose among any of the following sessions, long 20 minutes each:\r\nChatBots\r\nChatOps in practice\r\nVideo and Mobile applications\r\nSMS\r\nVoice",
            "type": "lab",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Intermediate",
            "room_order": 6,
            "room": "Lab",
            "date": "2017-05-16",
            "starttime": "10:30:00",
            "endtime": "17:00:00"
        }
    ],
    "speakers": [
        {
            "id": 159,
            "name": "Michele",
            "surname": "Orselli",
            "biography": "Software engineer, working with PHP since 2005 and now CTO at Ideato.\r\nI have broad interests in several aspects of software development like automation, quality and testing.\r\nI'm co-author of \"PHP Best Practices\", published by FAG in 2012. Serial speaker @phpday, you can find some of my talks on https:\/\/joind.in\/user\/view\/188",
            "role": "CTO",
            "company": "Ideato",
            "community": "PHP, Javascript",
            "website": "",
            "github": "",
            "twitter": "@_orso_",
            "facebook": ""
        },
        {
            "id": 226,
            "name": "Nikolas",
            "surname": "Martens",
            "biography": "Nikolas Martens is a full-hearted freelancing software engineer and trainer in Berlin. He has been coding on various platforms including desktop applications, embedded systems and robots, but is most experienced in web development. His interests are software architecture, automated testing, web applications, distributed system, lean methods, and specification by example. In his spare time he develops experimental frameworks or simply enjoys Berlin's city life. You can find Nikolas on rtens.org.",
            "role": "Software Engineer",
            "company": "Freelancer",
            "community": "PHP Berlin, Agile Developers Berlin",
            "website": "http:\/\/rtens.org",
            "github": "http:\/\/github.com\/rtens",
            "twitter": "@rtens_",
            "facebook": ""
        },
        {
            "id": 359,
            "name": "Matteo",
            "surname": "Valoriani",
            "biography": "Matteo Valoriani worked for two years at Microsoft Italy, but in 2012 he decided to follow his passion for technology and innovation and started a PhD in Computer Science focused on new unconventional technologies and paradigms of interaction. Matteo is recognized as Microsoft Most Valuable Professional for Windows Dev\/ Emerging Experiences and he is awarded as Intel Software Innovator for Game Dev and RealSense skills. Since 2014 he founded and lead FifthIngenium, a high-tech company that develops and distributes solution based on Mobile, Cloud and Emerging Experiences.",
            "role": "CEO",
            "company": "FifthIngeniunm",
            "community": "DotNetLombardia, MVP, MSP",
            "website": "http:\/\/www.fifthingenium.com\/",
            "github": "https:\/\/github.com\/mvaloriani",
            "twitter": "@MatteoValoriani",
            "facebook": ""
        },
        {
            "id": 769,
            "name": "Dustin",
            "surname": "Whittle",
            "biography": "Dustin Whittle is a Developer Advocate at Uber where he spends his days helping developers build moving experiences using the Uber developer platform. Find out more at dustinwhittle.com or follow him @dustinwhittle.",
            "role": "Developer Advocate",
            "company": "Uber",
            "community": "",
            "website": "http:\/\/dustinwhittle.com\/",
            "github": "https:\/\/github.com\/dustinwhittle",
            "twitter": "@dustinwhittle",
            "facebook": "https:\/\/www.facebook.com\/dustinwhittle"
        },
        {
            "id": 1054,
            "name": "Sara",
            "surname": "Vieira",
            "biography": "Sara is a Front-End Developer for Mindera in Portugal. Sheâ€™s one of those few people in the world who love what they do and believe that the internet is something we are building and making better on a daily basis may that be through education websites or simply by creating useful one page applications. She is also a blogger on the weekend and has her work featured on Developer Drive and Webdesigner Depot. When she isnâ€™t on the internet sheâ€™s a total TV Show addict and video game lover.",
            "role": "Front-End Developer",
            "company": "Mindera",
            "community": "",
            "website": "http:\/\/iamsaravieira.com",
            "github": "https:\/\/github.com\/SaraVieira",
            "twitter": "@NikkitaFTW",
            "facebook": ""
        },
        {
            "id": 1066,
            "name": "Phil",
            "surname": "Nash",
            "biography": "Phil is a developer evangelist for Twilio serving developer communities in London and all over Europe. He is a lover of all things front end, a Ruby and JavaScript developer and, more recently, an amateur brewer. APIs old and new, browsers and REST, fuel his passion for development. You should have seen how delighted he was the first time he played with the WebAudio API!\r\n\r\nPhil loves test coverage, great beer, hackathons, and libraries with puns in their names. Get all four together for maximum points.",
            "role": "Developer Evangelist",
            "company": "Twilio",
            "community": "",
            "website": "http:\/\/philna.sh",
            "github": "https:\/\/github.com\/philnash",
            "twitter": "@philnash",
            "facebook": "https:\/\/facebook.com\/philnash"
        },
        {
            "id": 1163,
            "name": "Emilia",
            "surname": "Ciardi",
            "biography": "Emilia is a software engineer with a focus on mobile gaming technologies and a long time experience leading cross functional teams. Working on a wide range of projects, from aerospacial software to e-learning and multimedia applications, she specialized in user experience design, graphical user interface and usability. She has a passion for videogames and over the years has developed several mobile casual games, using almost any tool at hand.\r\nEmilia currently lives in Lugano and works at GTECH,  gathering an in-deep knowledge on math models for the design of gambling and casino games.",
            "role": "Head of Native Games",
            "company": "IGT",
            "community": "",
            "website": "http:\/\/www.sparklinglabs.com\/",
            "github": "",
            "twitter": "@sparklinglabs",
            "facebook": ""
        },
        {
            "id": 1263,
            "name": "John",
            "surname": "Stevenson",
            "biography": "Speaker, author, conference organiser & community obsessed developer - loves Clojure, Emacs, Cats, Cycling & Agile development. @Heroku @SalesforceDevs",
            "role": "Developer Evangelist",
            "company": "Salesforce",
            "community": "London Clojurians, London Java Community, London Salesforce Developers, Graduate Developer Community",
            "website": "http:\/\/jr0cket.co.uk",
            "github": "https:\/\/github.com\/jr0cket",
            "twitter": "@jr0cket",
            "facebook": "https:\/\/www.facebook.com\/JohnStevenson247"
        },
        {
            "id": 1336,
            "name": "Zan",
            "surname": "Markan",
            "biography": "I work on all things mobile at Pusher in London, helping developers to build highly connected apps.\r\nMy favourite topics are software architecture and testing, and also the current developments in the world of EU\/US policy, things that affect the lives of developers (and users) in different ways",
            "role": "Lead Mobile Engineer",
            "company": "Pusher",
            "community": "London software craftsmanship community, London android meetup, London Java community, \/Policy, Androidchat.co",
            "website": "http:\/\/www.spacecowboyrocketcompany.com\/",
            "github": "https:\/\/github.com\/zmarkan",
            "twitter": "@zmarkan",
            "facebook": ""
        },
        {
            "id": 1390,
            "name": "Tugdual",
            "surname": "Grall",
            "biography": "Tugdual Grall is a Technical Evangelist at MapR, an open source advocate and a passionate developer. He currently works with the European developer communities to ease MapR, Hadoop and NoSQL adoption.\r\n\r\nBefore joining MapR, Tug was Technical Evangelist at MongoDB and Couchbase.  Tug has also worked as CTO at eXo Plaform and JavaEE product manager, and software engineer at Oracle.\r\n\r\nTugdual is Co-Founder of the Nantes JUG (Java User Group) that holds since 2008 monthly meeting about Java ecosystem. Tugdual also writes a blog available at http:\/\/tgrall.github.io",
            "role": "Technical Evangelist",
            "company": "MapR Technologies",
            "community": "co-founder of NantesJUG",
            "website": "http:\/\/tgrall.github.io",
            "github": "http:\/\/github.com\/tgrall\/",
            "twitter": "@tgrall",
            "facebook": "https:\/\/www.facebook.com\/tgrall"
        },
        {
            "id": 1476,
            "name": "Ben",
            "surname": "Straub",
            "biography": "Ben Straub is a lifelong developer, and enthusiast of the craft of making great software. He's worked on Windows device drivers, an embeddable implementation of Git, interfaces in MVVM and WPF, Mongo-backed Ember applications in the cloud, and he helped write Pro Git. He enjoys reading, taking his kids on bike rides, chocolate, dogs, those little notebooks you carry around with you, photography, a good weekend hack, traveling, writing, food, craftsmanship, a great pen, Markdown, music, movies, and talking to amazing people.",
            "role": "Developer",
            "company": "Zendesk",
            "community": "",
            "website": "http:\/\/ben.straub.cc\/",
            "github": "https:\/\/github.com\/ben",
            "twitter": "@benstraub",
            "facebook": ""
        },
        {
            "id": 1600,
            "name": "Birgitta",
            "surname": "Boeckeler",
            "biography": "I am a software developer and consultant with ThoughtWorks in Germany. I have been building software across all layers for almost 15 years now, mainly in the space of large custom-developed websites. Since I first discovered how to talk to computers, I have not been able to stop. I thrive on juggling the complexities of building software and finding the simplicity in it, and I love that it never gets old.",
            "role": "Lead Developer",
            "company": "ThoughtWorks",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@birgitta410",
            "facebook": ""
        },
        {
            "id": 1842,
            "name": "Mark",
            "surname": "Heckler",
            "biography": "Mark Heckler is a Pivotal Principal Technologist & Developer Advocate, conference speaker, & published author focusing upon software development for the IoT & the Cloud. He has worked with key players in the manufacturing, retail, medical, scientific, telecom, & financial industries & various public entities to develop & deliver critical capabilities on time & on budget. Mark is an OSS contributor & author\/curator of a developer-focused blog (http:\/\/www.thehecklers.org) & an occasionally interesting Twitter account (@MkHeck).\r\n\r\nMark lives with his very understanding wife in St. Louis, MO USA.",
            "role": "Developer Advocate",
            "company": "Pivotal Software, Inc.",
            "community": "Java, JavaFX, Spring",
            "website": "http:\/\/www.thehecklers.org",
            "github": "https:\/\/github.com\/mkheck",
            "twitter": "@MkHeck",
            "facebook": ""
        },
        {
            "id": 1844,
            "name": "Shmuela",
            "surname": "Jacobs",
            "biography": "Shmuela Jacobs is a front-end developer, consultant, speaker, and community activist. She is the founder of ngGirls and Angular Nights meetup group. During her academic studies (M.Sc. in Information Management Engineering and B.Sc. in Physics) Shmuela had combined her passions of coding and teaching as a software developer, teaching assistant, science museum guide, and researcher. Today she continues to enjoy these activities developing web applications using state-of-the-art technologies and frameworks, and sharing her knowledge and experience in meetups and conferences.",
            "role": "Front-end developer and consultant",
            "company": "ngGirls",
            "community": "AngularJS-IL, Javascript Israel, GDG",
            "website": "",
            "github": "https:\/\/github.com\/shmool",
            "twitter": "@ShmuelaJ",
            "facebook": ""
        },
        {
            "id": 1849,
            "name": "James",
            "surname": "Weaver",
            "biography": "James Weaver is a Java developer, author, and speaker with a passion for helping Java to be increasingly leveraged in rich-client and and cloud-native applications.  James has written books including Inside Java, Beginning J2EE, the Pro JavaFX series, and Java with Raspberry Pi.  As an Pivotal Evangelist, James speaks internationally at software technology conferences about Java and Cloud Native development.  James tweets as @JavaFXpert, blogs at http:\/\/JavaFXpert.com and http:\/\/CulturedEar.com and may be reached at jweaver @ pivotal.io\r\n\r\nCodemotion https:\/\/www.youtube.com\/watch?v=Ueky6x7jH2U_____",
            "role": "Developer Advocate",
            "company": "Pivotal Software",
            "community": "Java Champions",
            "website": "JavaFXpert.com",
            "github": "http:\/\/Github.com\/JavaFXpert",
            "twitter": "@JavaFXpert",
            "facebook": "https:\/\/www.linkedin.com\/in\/javafxpert"
        },
        {
            "id": 1867,
            "name": "Jettro",
            "surname": "Coenradie",
            "biography": "I am a Software Developer \/ Architect with a lot of hands on experience in Java, AngularJS, Elasticsearch and lots of others tools. I like to use these technologies to help customers with the business challenges. On top of that I like to gather and share knowledge related to data analytics. I have experience with importing and transforming data as well as presenting and visualising the data. Currently I am working with tools like elasticsearch, logstash and Kibana but also D3 and C3 for graphics and other presentations.",
            "role": "Fellow",
            "company": "Luminis",
            "community": "elasticsearch, 010dev, 070dev, java, nljug",
            "website": "http:\/\/amsterdam.luminis.eu",
            "github": "https:\/\/github.com\/jettro",
            "twitter": "@jettroCoenradie",
            "facebook": ""
        },
        {
            "id": 1969,
            "name": "Fabio",
            "surname": "Tiriticco",
            "biography": "Reactive Developer & Architect in Amsterdam but originally spawned in Italy. Organiser of the Reactive Amsterdam meetup. I'm interested in anything reactive and I try to blend solutions from different domains.",
            "role": "Owner",
            "company": "Fabway",
            "community": "Reactive Amsterdam, Amsterdam Scala",
            "website": "http:\/\/ticofab.io",
            "github": "https:\/\/github.com\/ticofab",
            "twitter": "@ticofab",
            "facebook": ""
        },
        {
            "id": 2013,
            "name": "Matteo",
            "surname": "Ronchi",
            "biography": "Matteo is passionate to all about web technologies. Developing interactive user interfaces for web and desktop since 2001 before using the Flash Platform and then using Javascript. Matteo loves the whole Javascript ecosystem and is involved in several projects both open source and not, he has mainly worked on Enterprise level projects as developer and software architect and last years has committed itself to teaching web technologies and to help the Italian front-end community to grow. Recently joined Workwave as senior engineer and team leader to work on the development of new products.",
            "role": "Senior Software Engineer",
            "company": "Workwave",
            "community": "angularjs italia (facebook and g+), react italia (facebook and g+), fevr verona",
            "website": "www.workwave.com",
            "github": "https:\/\/github.com\/cef62",
            "twitter": "@cef62",
            "facebook": ""
        },
        {
            "id": 2030,
            "name": "Mattia",
            "surname": "Traverso",
            "biography": "I started off as a freelance flash developer six years ago - highlights including \"One and One Story\", IGF finalist, and \"Secret of the Wings\", advergame for Disney's homonym movie.\r\n\r\nAfter thirty-something game jams and a specialisation in game design, I moved to the Netherlands to focus on bigger projects, founding the company Through Games for the game Fru, an upcoming experimental game for Xbox One.\r\n\r\nI just moved back to Italy to takea lead position for a new unannounced project, which I can't wait to share!",
            "role": "Designer & Producer",
            "company": "Through Games",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@MattiaNotFound",
            "facebook": "https:\/\/www.facebook.com\/traversomat"
        },
        {
            "id": 2103,
            "name": "Daniël",
            "surname": "van Gils",
            "biography": "Daniël van Gils is a polyglot developer advocate at Cloud 66. He helps other polyglot developers craft ruby (on rails) web applications and container based microservice architectures with ♥. An accomplished creative technologist, Daniel has vast and varied experience in application development, agile workflows and building container technologies at scale, gained working in the web development, creative technologies and gaming industries. In his spare time he experiments with strawberries in his backyard, likes to surf and practices improvisation theater.",
            "role": "Developer Advocate",
            "company": "Cloud 66",
            "community": "ruby and docker communities in holland",
            "website": "http:\/\/www.cloud66.com",
            "github": "http:\/\/github.com\/cloud66",
            "twitter": "@foldingbeauty",
            "facebook": ""
        },
        {
            "id": 2120,
            "name": "PJ",
            "surname": "Hagerty",
            "biography": "Developer, writer, speaker, musician, and  and Developer Advocate at Logz.io, PJ is known to travel the world speaking about programming and the way people think and interact.  He is also known for wearing hats.",
            "role": "Developer Advocate",
            "company": "Logz.io",
            "community": "Ruby Community, PHP Community, Mental Health in Tech Community",
            "website": "http:\/\/iampj.xyz",
            "github": "https:\/\/github.com\/aspleenic",
            "twitter": "@aspleenic",
            "facebook": ""
        },
        {
            "id": 2136,
            "name": "Paulo",
            "surname": "Lopes",
            "biography": "I'm Paulo and I've used my 10+ years of software development experience writing, rewriting, banging my head against the\r\nwall, editing and re-editing high-performance web application to make Vert.x an even more awesome framework. I am also\r\nthe author of \"yoke\" and other small open source projects. I jump out of bed with a big smile on my face each morning\r\nbecause I know reactive microservices are real and will finally put monoliths and big balls of mud to an end.\r\n\r\nThis is more than a job; I'm on a mission to build fast and faster applications!",
            "role": "Principal Software Engineer",
            "company": "RedHat",
            "community": "vertx, reactive amsterdam, mongo amsterdam",
            "website": "",
            "github": "https:\/\/github.com\/pmlopes\/",
            "twitter": "@jetdrone",
            "facebook": ""
        },
        {
            "id": 2249,
            "name": "Peter",
            "surname": "Hilton",
            "biography": "Peter Hilton is a software developer, writer, speaker, trainer, and musician. His professional interests are business process management, web application development, functional design, agile software development and documentation. Peter currently works as a programmer and technical writer for Signavio, working remotely from Rotterdam, and delivers the occasional lecture and training course. He prefers to code in Scala, but also uses Java and JavaScript. Peter has presented at many European conferences, co-authored ‘Play for Scala’ (Manning) and has taught ‘Fast Track to Play with Scala’.",
            "role": "freelancer",
            "company": "-",
            "community": "",
            "website": "http:\/\/hilton.org.uk\/",
            "github": "https:\/\/github.com\/hilton",
            "twitter": "@PeterHilton",
            "facebook": ""
        },
        {
            "id": 2272,
            "name": "James",
            "surname": "Thomas",
            "biography": "James Thomas is a “Developer Advocate” for IBM Bluemix, helping developers build scalable applications on IBM's cloud platform. Working in the “Emerging Technologies” division, James has been able to work on everything from the largest retail banking site in Europe, been a leading open-source developer for a JavaScript toolkit before working on the first commercial system for IBM Watson as the UI Technical Lead.",
            "role": "Developer Advocate",
            "company": "IBM",
            "community": "",
            "website": "http:\/\/jamesthom.as",
            "github": "https:\/\/github.com\/jthomas",
            "twitter": "@thomasj",
            "facebook": ""
        },
        {
            "id": 2347,
            "name": "Alexandra",
            "surname": "Marin",
            "biography": "Alexandra has developed software for Fortune 500 companies in the pharmaceutical, logistics, gaming, video on demand, health, fitness and agricultural industries. Her focus is mobile and crossplatform development with Xamarin, but she's also fluent in C#, .NET and Unity. She blogs at crossplatform.io and loves attending as many user groups, code retreats and conferences as she can find.",
            "role": "Software developer",
            "company": "crossplatform.io",
            "community": "",
            "website": "http:\/\/crossplatform.io",
            "github": "https:\/\/github.com\/alexandra-marin",
            "twitter": "@xmonodev",
            "facebook": ""
        },
        {
            "id": 2378,
            "name": "Natalie",
            "surname": "Pistunovich",
            "biography": "Natalie is a Backend Developer at adjust. Prior to that she was at the Silicon Integration team in Intel, and graduated B.Sc. in Software and Computer Engineering from the Technion. In her free time she is a Golang Berlin meetups co-organizer, Women Techmakers Berlin lead and a good music appreciator.",
            "role": "Backend Engineer",
            "company": "adjust",
            "community": "Women Techmakers, GDG Golang",
            "website": "",
            "github": "",
            "twitter": "nataliepis",
            "facebook": ""
        },
        {
            "id": 2393,
            "name": "Michal",
            "surname": "Franc",
            "biography": "Pragmatic Engineer @ Just Eat. Expert in .NET, interested in functional programming and distributed systems. VIM user, micro-services fan. Blog author www.mfranc.com, speaker. Found on twitter @francmichal and github michal-franc.",
            "role": "Engineer",
            "company": "Just Eat",
            "community": "",
            "website": "www.mfranc.com",
            "github": "https:\/\/github.com\/michal-franc\/",
            "twitter": "@francmichal",
            "facebook": "https:\/\/www.facebook.com\/michal.franc.9"
        },
        {
            "id": 2488,
            "name": "Mete",
            "surname": "Atamel",
            "biography": "I'm a Developer Advocate at Google, currently focused on helping developers with Google Cloud Platform. As a long-time Java and a recent C# developer, I like to compare the two ecosystems. Prior to Google, I worked at Microsoft, Skype, Adobe, EMC, and Nokia building apps and services on various web, mobile and cloud platforms. Originally from Cyprus, I currently live in Greenwich, not too far away from the prime meridian.",
            "role": "Developer Advocate",
            "company": "Google",
            "community": "",
            "website": "meteatamel.wordpress.com",
            "github": "https:\/\/github.com\/meteatamel",
            "twitter": "@meteatamel",
            "facebook": ""
        },
        {
            "id": 2525,
            "name": "Michiel",
            "surname": "Rook",
            "biography": "Michiel Rook is a Java\/PHP\/Scala consultant from the Netherlands. He loves coaching teams to develop better software and implement continuous deployment. He is a co-founder of Make.io and a member of the Dutch Web Alliance. When he’s not thinking about continuous deployment, devops or event sourcing he enjoys music, cars, sports and movies.",
            "role": "Continuous deployment advocate",
            "company": "make.io",
            "community": "PHP, Dutch Web Alliance",
            "website": "https:\/\/www.touchdownconsulting.nl",
            "github": "https:\/\/github.com\/mrook",
            "twitter": "@michieltcs",
            "facebook": ""
        },
        {
            "id": 2544,
            "name": "David",
            "surname": "Sferruzza",
            "biography": "Young generalist engineer graduate from Icam de Nantes, I am fond of new technologies, IT, and software development. I am currently in charge of R&D at Startup Palace and preparing a PhD in software engineering. These days, I enjoy spending some time learning functional programming and developing professional and personal projects in Scala, Haskell and Nix. I would like to keep meeting nice people around those subjects, and discover new sources of blossoming!",
            "role": "Head of Research and Development",
            "company": "Startup Palace",
            "community": "",
            "website": "https:\/\/david.sferruzza.fr\/",
            "github": "https:\/\/github.com\/dsferruzza",
            "twitter": "@d_sferruzza",
            "facebook": ""
        },
        {
            "id": 2570,
            "name": "Jan-Erik",
            "surname": "Rediger",
            "biography": "Jan-Erik is a student of Computer Science, living in Aachen, Germany.\r\nWhen he's not studying, he's using his time to bring native asm.js and WebAssembly support to the Rust compiler.",
            "role": "Software Engineer",
            "company": "Mozilla",
            "community": "Rust, Redis, Ruby",
            "website": "https:\/\/fnordig.de\/",
            "github": "https:\/\/github.com\/badboy",
            "twitter": "@badboy_",
            "facebook": ""
        },
        {
            "id": 2580,
            "name": "Simon",
            "surname": "Bennetts",
            "biography": "Simon Bennetts has been developing web applications since 1997, and strongly believes that you cannot build secure web applications without knowing how to attack them.\r\nHe is the OWASP Zed Attack Proxy Project Leader and works for Mozilla as part of the Cloud Services Security Team.",
            "role": "Security Automation Engineer",
            "company": "Mozilla",
            "community": "OWASP",
            "website": "https:\/\/www.owasp.org\/index.php\/ZAP",
            "github": "https:\/\/github.com\/psiinon",
            "twitter": "@psiinon",
            "facebook": ""
        },
        {
            "id": 2585,
            "name": "Luca",
            "surname": "Relandini",
            "biography": "I’m a Solution Architect at Cisco, in a European team focused on Data Center, Automation and Cloud Computing. I work at IT and cloud projects using both Cisco's software\/hardware products, open source (Openstack, Docker) and 3rd party products.\r\n\r\nAfter a career as Enterprise Architect in the IT industry at large enterprises, system integrators and software vendors I learned that the human factor (i.e. organization and governance, as well as alignment between Business and IT Strategies, and a sound architectural design that never hurts) is more important than technology as a success factor",
            "role": "Solution Architect",
            "company": "Cisco Systems",
            "community": "Openstack User Group Italy, Cisco DevNet",
            "website": "http:\/\/lucarelandini.blogspot.com\/",
            "github": "",
            "twitter": "@lucarelandini",
            "facebook": ""
        },
        {
            "id": 2588,
            "name": "Stève",
            "surname": "Sfartz",
            "biography": "DevNet is Cisco's Developer Program.\r\nPart of my evangelism activity is to help Developers and ITPros differentiate and accelerate their business by leveraging CISCO APIs.\r\nYou're a startup, an enterprise or an ISV ? Feel free to ping me to discuss innovation and how to integrate CISCO APIs into your software. As a strong supporter of Web APIs, I have committed myself to teach dev communities WW how to consume and build APIs with various languages.\r\nREST APIs, Collaboration (Tropo, Cisco Spark), Cloud Services, golang\r\nFrance mostly and all around Europe.",
            "role": "API Evangelist",
            "company": "CISCO",
            "community": "devnet, REST, opensource, golang, javascript, nodejs",
            "website": "https:\/\/developer.cisco.com\/",
            "github": "",
            "twitter": "@SteveSfartz",
            "facebook": ""
        },
        {
            "id": 2660,
            "name": "Mike",
            "surname": "Lee",
            "biography": "Mike Lee is an American engineer living in Amsterdam. Like many people, he dreamed of finding a better life in technology. Mike was at the birth of mobile, and has worked on many interesting projects, even at Steve Jobs' Apple. Mike continues to code full-time while contributing to community projects such as AltConf and Appsterdam. You can find him on Twitter @bmf.",
            "role": "Mayor",
            "company": "Appsterdam",
            "community": "Appsterdam",
            "website": "http:\/\/appsterdam.rs",
            "github": "",
            "twitter": "@bmf",
            "facebook": ""
        },
        {
            "id": 2664,
            "name": "Russ",
            "surname": "Olsen",
            "biography": "Russ started his career doing that other kind of engineering, the sort that involves motors, gears and getting dirty. Pretty rapidly the wonder of computer programming lured him away, which probably explains why most of his fingers are still intact. Since turning to coding, Russ has worked on everything from 3D design and image processing software to database query engines and workflow systems. Russ is the author of two programming books and a frequent conference speaker.",
            "role": "Vice President",
            "company": "Cognitect",
            "community": "",
            "website": "http:\/\/russolsen.com",
            "github": "https:\/\/github.com\/russolsen",
            "twitter": "@russolsen",
            "facebook": ""
        },
        {
            "id": 2665,
            "name": "Serg",
            "surname": "Hospodarets",
            "biography": "Serg is a Lead Front-End Developer \/ Engineering Manager, lives in Dublin (Ireland).\r\nHe loves the Web and shares his knowledge in his blog https:\/\/blog.hospodarets.com\/ .\r\nBeing a good in Front-End related technologies, Serg is still a big fan of moving CSS further and participates specifications debates and discusses new features with the community.\r\n\r\nYou can find highlights of the latest Web technologies and browser additions in his twitter timeline https:\/\/twitter.com\/malyw",
            "role": "Lead Front-End Developer \/ Engineering Manager",
            "company": "Guidewire",
            "community": "",
            "website": "https:\/\/blog.hospodarets.com\/",
            "github": "https:\/\/github.com\/malyw",
            "twitter": "@malyw",
            "facebook": ""
        },
        {
            "id": 2668,
            "name": "Chrissy",
            "surname": "Welsh",
            "biography": "Chrissy Welsh is the Creative Lead & Director for Philips, based in Amsterdam. She is interested in the potential of ‘bleeding edge’ technologies in user experience design to make products easy and pleasurable to use. She has over 10 years design experience and has worked with a variety of industries including software development, healthcare and education. Before Philips, Chrissy was the Lead & Principle UX for Backbase where she designed user experiences & apps for the financial sector.",
            "role": "Creative Lead & Director",
            "company": "Philips",
            "community": "",
            "website": "www.christinewelsh.com",
            "github": "",
            "twitter": "@chrissywelsh",
            "facebook": ""
        },
        {
            "id": 2670,
            "name": "Terri",
            "surname": "Burns",
            "biography": "Terri Burns is a developer and technologist based in San Francisco. She's an editorial contributor at Forbes, where she offers business and leadership advice in the form of data visualizations. In addition to making visualizations, Terri's cohosted the Forbes podcast Well, Technically, a podcast about startups and technology.  She's the former-President and current Chair of Tech@NYU, the largest student technology organization in New York City. She regularly writes about technology, diversity, and inclusion, and her work has been featured in Forbes, Scientific American, and Model View Culture.",
            "role": "Associate Product Manager",
            "company": "Twitter",
            "community": "",
            "website": "http:\/\/tcburning.com",
            "github": "http:\/\/github.com\/terriburns",
            "twitter": "@tcburning",
            "facebook": ""
        },
        {
            "id": 2716,
            "name": "Greg",
            "surname": "Bulmash",
            "biography": "Greg Bulmash is a former IMDb Senior Editor, urban legend (really), and developer. In 2005, he dusted off his 1980s BASIC skills and taught himself the technologies that power the web. He's developed professionally on LAMP, WISP, and LASP stacks, and recently started with node and Python. \r\n\r\nHe currently works as a Technical Evangelist for Login with Amazon, and for the past 3 years he has been the founder and lead organizer for Seattle CoderDojo, a volunteer group that teaches kids to code on Saturday mornings.\r\n\r\nHe's spoken at OSCON, DevNexus, CascadiaJS, and other conferences and meetups.",
            "role": "Technical Evangelist",
            "company": "Amazon.com",
            "community": "",
            "website": "http:\/\/Yiddish.Ninja",
            "github": "https:\/\/github.com\/YiddishNinja",
            "twitter": "YiddishNinja",
            "facebook": ""
        },
        {
            "id": 2726,
            "name": "Marijn",
            "surname": "van Zelst",
            "biography": "An innovative Software Engineer who is always looking to apply novel techniques into practical and creative solutions. Tries to spot business opportunities that can be made possible by applying new and innovative techniques. Successful in applying machine learning, natural language processing and linear optimization algorithms in companies. Result driven, focuses on making proof of concepts of ideas instead of just focusing on theoretical solutions. Has a broad background in Software Development, Distributed Systems.",
            "role": "Innovative Software Developer",
            "company": "Luminis",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@marijnvanzelst",
            "facebook": ""
        },
        {
            "id": 2736,
            "name": "Vincent",
            "surname": "Kok",
            "biography": "Vincent is Development Manager for Confluence Cloud at Atlassian, looking after performance, deployment and cloud architecture. Before that, he led the team which was responsible for moving Atlassian's identity systems towards a microservice architecture. When not thinking about software, Vincent likes a good game of lunchtime soccer in the park with fellow Atlassians.",
            "role": "Development Manager",
            "company": "Atlassian",
            "community": "",
            "website": "http:\/\/www.vincentkok.nl",
            "github": "",
            "twitter": "@vincentkok",
            "facebook": ""
        },
        {
            "id": 2742,
            "name": "Aisha",
            "surname": "Sie",
            "biography": "Having built her career as an MD\/PhD in clinical genetics, Aisha has since been focusing further on bridging the gap between the medical and technical worlds. She works as an information analyst at Nictiz, the Dutch expertise center for healthcare and IT, applying her passion to make healthcare better through innovation in IT. Aisha is a board member and co-organizer of DomCode, a cross-language user group that aims to bring web developers from all backgrounds together to learn. She's also a musician, gamer and cross-stitcher.",
            "role": "MD\/PhD, Information Analyst",
            "company": "Nictiz",
            "community": "DomCode (board member), AmsterdamPHP (games event host)",
            "website": "http:\/\/aishasie.nl",
            "github": "https:\/\/github.com\/aishasie",
            "twitter": "@Aisha",
            "facebook": ""
        },
        {
            "id": 2794,
            "name": "Stefano",
            "surname": "Masini",
            "biography": "I've been developing software professionally since the last century, and I moved between Italy, USA and the Netherlands. Always running my own company, I was never a generalist. I like to serve customers and hone my own product. Proudly serving Balsamiq, helping to rid the world of bad software!",
            "role": "Full stack developer",
            "company": "Balsamiq",
            "community": "",
            "website": "balsamiq.com",
            "github": "",
            "twitter": "@stefanomasini",
            "facebook": ""
        },
        {
            "id": 2802,
            "name": "Alessandro",
            "surname": "Vozza",
            "biography": "Alessandro has been around Open Source for as long as he can remember, and he started cultivating the DevOps community in Amsterdam when it was not an hype. After many transitions, he now settled as Technical Evangelist for Microsoft, pushing for adoption of state of the art DevOps practises and culture across different industries and communities.",
            "role": "Technical Evangelist",
            "company": "Microsoft",
            "community": "DevOps Amsterdam Meetup, Openstack Amsterdam Meetup and more",
            "website": "",
            "github": "https:\/\/github.com\/ams0",
            "twitter": "@bongo",
            "facebook": ""
        },
        {
            "id": 2821,
            "name": "Sander",
            "surname": "van den Hoven",
            "biography": "Sander van den Hoven is working for ages in IT. He graduated at UvA in Technical Information Systems on Speech Recognition. After that he work in consultancy at all the large companies working on large projects as developer & architect. Currently Sander is Principal Technical Evangelist at Microsoft DX. He focuses on Solution Development on Azure, building highly scalable applications, Artificial Intelligence and Intelligence Augmentation and Chat Bots. Sander loves coding and you can always expect to see code in his presentations.",
            "role": "Principal Technical Evangelist",
            "company": "Microsoft",
            "community": "amsterdam.ai, IOT Tech Community Holland, NoSQL Netherlands, API NL, Serverless Amsterdam, Dutch Azure Meetup, Chatbot Meetup",
            "website": "www.microsoft.com",
            "github": "https:\/\/github.com\/svandenhoven",
            "twitter": "@svandenhoven",
            "facebook": "facebook.com\/svandenhoven"
        },
        {
            "id": 2827,
            "name": "Ali",
            "surname": "King",
            "biography": "I’m a data engineer working at FanDuel, one of Scotland‘s two ‘unicorn’ companies, working with Big Data technologies mostly in Python.  My previous experience covers the public and private sectors, contracting, startups, and open source.  I’ve also taught adults to code and given talks at international programming conferences.",
            "role": "Software Engineer",
            "company": "FanDuel",
            "community": "",
            "website": "koshatnik.com",
            "github": "",
            "twitter": "@ali_king",
            "facebook": ""
        },
        {
            "id": 2828,
            "name": "Natalino",
            "surname": "Busa",
            "biography": "Natalino leads the definition, design and implementation of big\/fast data solutions for data-driven applications such as predictive analytics, personalized marketing, and security event monitoring.\r\n\r\nO'Reilly author and advocate of Open Source, and Apache Software Foundation. Passionate about Spark, Flink, Cassandra, Kafka, Akka, Hadoop. Proficient in R, Python and Scala and Predictive Big\/Fast Data Technologies.",
            "role": "Head of Data Science",
            "company": "Teradata",
            "community": "O'Reilly",
            "website": "http:\/\/natalinobusa.com",
            "github": "https:\/\/github.com\/natbusa",
            "twitter": "@natbusa",
            "facebook": ""
        },
        {
            "id": 2829,
            "name": "Bojan",
            "surname": "Tomic",
            "biography": "Bojan Tomic is an experienced Java developer with a healthy interest in modern approaches to old problems, be it in the form of programming paradigms (like functional-reactive), or innovative methods for creating APIs (like GraphQL). Finds immense pleasure in sampling craft beers, playing RPGs, both computer and table-top, and spending all his money on traveling (often off the beaten path).",
            "role": "Full-stack developer",
            "company": "ServiceNow",
            "community": "",
            "website": "http:\/\/thatjavathing.blogspot.nl",
            "github": "https:\/\/github.com\/leangen",
            "twitter": "@kaqqao",
            "facebook": ""
        },
        {
            "id": 2843,
            "name": "Nathan",
            "surname": "Marz",
            "biography": "Nathan pioneered modern stream processing by creating the Apache Storm project, which is used as core infrastructure by companies such as Yahoo!, Spotify, Groupon, Alibaba, Yelp, WebMD, and many more. In 2015 he published the book \"Big Data: principles and best practices of scalable realtime data systems\" which established the theory of the Lambda Architecture, a now standard term in the industry. Prior to his current startup, he started and built one of Twitter's core infrastructure teams. Additionally, he advises companies in areas such as virtual reality, education, and health.",
            "role": "Founder",
            "company": "Red Planet Labs",
            "community": "",
            "website": "http:\/\/nathanmarz.com\/",
            "github": "https:\/\/github.com\/nathanmarz",
            "twitter": "@nathanmarz",
            "facebook": ""
        },
        {
            "id": 2976,
            "name": "Daniel",
            "surname": "Gebler",
            "biography": "Daniel Gebler is CTO of Picnic, the world’s fastest growing online supermarket that makes grocery shopping simple, fun, and affordable for everyone. Previously, he was Director R&D of Fredhopper, responsible for the product and technology roadmap, and led engineering teams located in Amsterdam and Sofia. Daniel holds a PhD in Computer Science and an MBA. He is also a dad of two young kids, used be a passionate skater and nowadays an enthusiastic climber!",
            "role": "CTO",
            "company": "Picnic",
            "community": "",
            "website": "www.picnic.nl",
            "github": "",
            "twitter": "@daniel_gebler",
            "facebook": ""
        },
        {
            "id": 2984,
            "name": "Mathijs",
            "surname": "Kadijk",
            "biography": "Mathijs Kadijk creates apps at Q42 and is involved in the development of indoor positioning for Tate Modern, a connected hearing aids project and building sensor support into the Philips Hue app. He also connected the Q42 office door so you can unlock it with your public transport card and is the creator of the open source tool R.swift.",
            "role": "Software Engineer",
            "company": "Q42",
            "community": "CocoaHeadsNL",
            "website": "http:\/\/mathijskadijk.nl",
            "github": "https:\/\/github.com\/mac-cain13",
            "twitter": "@mac_cain13",
            "facebook": ""
        },
        {
            "id": 3020,
            "name": "Ben",
            "surname": "Gidley",
            "biography": "Ben is an expert in applying technology to business problems and works incubating new technology from Irdeto. He is currently working on a number of initiatives to secure the web browsing experience in banking, media and other industries with Irdeto’s Cloaked.JS technology. Ben’s expertise is in secure and scalable web and mobile solutions and is an industry expert on Multiscreen video experiences. His experience is rooted in online services. Prior to Irdeto he worked for Ioko leading the ‘Project Kangaroo’ initiative for BBC, ITV, C4, SeeSaw and Anite on a number of security focused projects.",
            "role": "Director Technology",
            "company": "Irdeto",
            "community": "",
            "website": "www.irdeto.com",
            "github": "https:\/\/github.com\/bgidley",
            "twitter": "@bgidley",
            "facebook": ""
        },
        {
            "id": 3021,
            "name": "Anne",
            "surname": "Currie",
            "biography": "Anne has been in the tech sector for over 20 years, on C server products for folk like Microsoft in the 90's through to lingerie ecomm platforms in the '00s to containers, orchestration and the future of Ops in the '10s. All Anne's views are her own, but it is her primary goal in life to make them yours ;-)",
            "role": "Co-founder",
            "company": "Microscaling Systems",
            "community": "coedcode",
            "website": "http:\/\/www.microbadger.com",
            "github": "",
            "twitter": "anne_e_currie",
            "facebook": ""
        },
        {
            "id": 3057,
            "name": "Tim",
            "surname": "Charman",
            "biography": "Tim Charman is a Solution Architect at Irdeto. He has worked for 20 years integrating systems and processing data for government, Xerox’ supply chain, California state healthcare, a variety of video on demand systems, and payments. Tim enjoys learning how disparate systems function, and designing a means of effective, performant, and secure communication. Tim is currently focused on how Irdeto Cloakware is used to protect sensitive data in the browser, on mobile devices, and on transmission.",
            "role": "Solution Architect",
            "company": "Irdeto",
            "community": "",
            "website": "www.irdeto.com",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3106,
            "name": "Peter Paul",
            "surname": "van de Beek",
            "biography": "Peter Paul van de Beek is working as architect at bol.com together with several business and scrum teams. His functional focus is on Logistics, Inventory Management, Purchasing, and Order to Cash for Media Services. Before joining bol.com he has been consulting organizations in technology shifts.\r\nPeter Paul performed in roles like software developer, team lead, process engineer, coach and architect. He has an agile mind set. Main focus as architect has been on service orientation and integration projects. In all roles he stayed dedicated to delivering business value.",
            "role": "IT architect",
            "company": "Bol.com",
            "community": "",
            "website": "https:\/\/www.bol.com",
            "github": "",
            "twitter": "@deltalounge",
            "facebook": ""
        },
        {
            "id": 3143,
            "name": "Mata",
            "surname": "Haggis",
            "biography": "Dr. Mata Haggis has over 15 years of experience in both video game design and writing for a broad range of entertainment media. He is an award winning game developer, writer, and acclaimed public speaker, as well as an academic researcher into game and narrative design.\r\n\r\nHe creates games, consults\/trains in narrative design as founder of Copper Stone Sea, and works as the Professor Of Creative And Entertainment Games at NHTV University in the Netherlands.\r\n\r\nHe is a full member of the Writers' Guild of Great Britain and a member of their video game committee.",
            "role": "Founder - narrative and game design consultancy and training",
            "company": "Copper Stone Sea",
            "community": "Writers' Guild of Great Britain",
            "website": "http:\/\/www.copperstonesea.com",
            "github": "",
            "twitter": "@MataHaggis",
            "facebook": ""
        },
        {
            "id": 3144,
            "name": "Frank",
            "surname": "Folsche",
            "biography": "I'm a fullstack .NET developer that is always looking for new opportunities. For the last view year my focus has shifted from static web-development to progressive web-apps with Angular. Recently my focus is main on Xamarin to build great native apps with a shared code base.\r\n\r\nFor the last few years I've started to do more and more presentations to share my excitement about different technologies.",
            "role": "Software Developer",
            "company": "Luminis",
            "community": "",
            "website": "http:\/\/frankfolsche.com",
            "github": "https:\/\/github.com\/Frankfolsche",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3145,
            "name": "Roel",
            "surname": "Ezendam",
            "biography": "Roel is a game coder and designer at RageSquid, a young game studio from The Netherlands. Being a programmer by nature, Roel is always looking into how a technical approach can assist game design.",
            "role": "Co-Founder & Game Coder",
            "company": "RageSquid",
            "community": "Game dev",
            "website": "http:\/\/www.roelezendam.com",
            "github": "",
            "twitter": "@roelezendam",
            "facebook": ""
        },
        {
            "id": 3150,
            "name": "Ola",
            "surname": "Gasidlo",
            "biography": "Ola is a web compatibility engineer at Mozilla living in Berlin, who is very passionate about Open Source, the Offline First concept and empowering people. She loves making the web accessible for everyone, riding the trails, and daughter-driven development.",
            "role": "Web Compatibility Engineer",
            "company": "Mozilla",
            "community": "",
            "website": "https:\/\/webcompat.com",
            "github": "",
            "twitter": "misprintedtype",
            "facebook": ""
        },
        {
            "id": 3170,
            "name": "Koen",
            "surname": "Deetman",
            "biography": "“Ambitious, highly driven, and people-oriented game director”\r\nAt the age of thirteen Koen started a 'team' within the online gaming community of Soldier of Fortune 2, a first person shooter game. His goal was to achieve the first place in the international ranking of 500 + clans, which succeeded him after four years. To this day, he leads his teams to success with the same passion, both in his work as a game producer and in his own company 'KeokeN Interactive'.\r\nHe is building a strong international network with peers and stimulates new insights and ideas.",
            "role": "Founder, CEO",
            "company": "KeokeN Interactive",
            "community": "",
            "website": "www.deliverusthemoon.com",
            "github": "",
            "twitter": "@keoken",
            "facebook": "https:\/\/www.facebook.com\/koen.deetman"
        },
        {
            "id": 3186,
            "name": "Stephanie",
            "surname": "Nemeth",
            "biography": "Stephanie is a frontend developer in Amsterdam. She is currently building cool stuff with JavaScript at SpronQ. She was a pharmaceutical chemist in a previous life, but now can’t imagine life not as a developer. She enjoys experimenting with hardware and LEDs to make beautiful, useless things.",
            "role": "Frontend Developer",
            "company": "SpronQ",
            "community": "NodeSchool Amsterdam, BeerJS Amsterdam",
            "website": "https:\/\/stephanie.lol",
            "github": "https:\/\/www.github.com\/traumverloren",
            "twitter": "@stephaniecodes",
            "facebook": ""
        },
        {
            "id": 3210,
            "name": "Alexandra",
            "surname": "Leisse",
            "biography": "Alexandra spent 10 years living big drama on opera stages before making her way into KDE and launching her tech career as community manager for Qt in Oslo. She is the founder and co-organiser of the Rails Girls chapter in Oslo, and a proud Web Rebel.\r\n\r\nShe is currently responsible for product and design at Ardoq, a  SaaS-solution for enterprise architecture and structured documentation.",
            "role": "Head of User Experience and Design",
            "company": "Ardoq",
            "community": "Rails Girls, Web Rebels",
            "website": "http:\/\/ardoq.com",
            "github": "",
            "twitter": "@troubalex",
            "facebook": ""
        },
        {
            "id": 3211,
            "name": "Melanie",
            "surname": "Rieback",
            "biography": "Dr. Melanie Rieback is the CEO\/Co-founder of Radically Open Security, the world’s first non-profit computer security consultancy company. She is also a former Assistant Professor of Computer Science at VU who performed RFID security research (RFID Virus and RFID Guardian). For fun, she co-founded the Dutch Girl Geek Dinner in 2008. Melanie was named 2010 ICT Professional of the Year (Finalist) by WomeninIT, one of the 400 most successful women in the Netherlands by Viva Magazine (Viva400) in 2010, and one of the fifty most inspiring women in tech (Inspiring Fifty Netherlands) in 2016.",
            "role": "CEO\/Co-founder",
            "company": "Radically Open Security",
            "community": "",
            "website": "https:\/\/radicallyopensecurity.com",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3221,
            "name": "Pascal",
            "surname": "Serrarens",
            "biography": "Studied Computer Science and Artificial Intelligence at the University of Amsterdam and hold a Ph.D Computer Science from the Radboud University Nijmegen. After working 15 years as a consultant for mission critical systems, he found out that it was finally possible to create his childhood dream: virtual humans. His software solutions enable developers of 3D environments to use interactive full body avatars. The combination of techniques from animation, robotics, artificial intelligence and psychology results in avatars with unprecedented abilities.",
            "role": "CEO",
            "company": "Passer VR",
            "community": "VR 010\/020 Meetup, VR Lab Nijmegen",
            "website": "http:\/\/www.passervr.com",
            "github": "",
            "twitter": "@passervr",
            "facebook": "https:\/\/www.facebook.com\/passervr\/"
        },
        {
            "id": 3228,
            "name": "Piet",
            "surname": "van Dongen",
            "biography": "I am an experienced and passionate full stack developer, always aiming to improve myself and those around me.\r\n\r\nI believe that the key to success in the software business lies in the sharing of knowledge, sources and solutions — we are all standing on the shoulders of giants. That's why I love to dive deep into new technologies and share my findings with an audience. The more we connect, the better we get.",
            "role": "Senior Software Engineer",
            "company": "Luminis",
            "community": "NLJUG (Dutch Java User Group), Virtual JUG (Virtual Java User Group)",
            "website": "http:\/\/www.pietvandongen.com",
            "github": "https:\/\/github.com\/pietvandongen",
            "twitter": "pietvandongen",
            "facebook": ""
        },
        {
            "id": 3231,
            "name": "Guy",
            "surname": "Rombaut",
            "biography": "Guy is a tech-geek, entrepreneur & software engineer. 50% Israeli, 50% Dutch. Originally from Silicon Wadi, the high-tech area on the beautiful coastal plain of Israel. He was working as a Software Engineer for the last 8 years. He started his path as a young web developer, moved to CRM and finance software engineering. He is active in Cordova & Ionic communities for mobile apps development. In addition, he worked on few innovative projects in the spectrum of IoT & security. Nowadays, he advises companies in such areas, as an engineer\/consultant in Blue Harvest.",
            "role": "Senior Consultant",
            "company": "Blue Harvest",
            "community": "",
            "website": "http:\/\/gsrweb.net",
            "github": "https:\/\/github.com\/guyromb",
            "twitter": "",
            "facebook": "https:\/\/facebook.com\/guyromb"
        },
        {
            "id": 3233,
            "name": "David",
            "surname": "Wessman",
            "biography": "David Wessman is a veteran game developer whose career began in 1991 as a tester at Lucasarts Games. He’s been a game designer, writer, audio designer and producer on hit games such as the X-Wing series, Blood Wake, The Chronicles of Riddick: Escape from Butcher Bay, Saints Row and Death Jr. 2: Root of Evil. He’s also been a university lecturer in game design and production since 2008, and currently teaches in the Creative Media & Game Technology program at NHTV Breda University of Applied Sciences. Since 2013 he has been the lead designer of Starfighter Inc. at Impeller Studios.",
            "role": "Lead Designer",
            "company": "Impeller Studios",
            "community": "",
            "website": "https:\/\/impellerstudios.com\/",
            "github": "",
            "twitter": "@wessmaniac",
            "facebook": "https:\/\/www.facebook.com\/Wessmaniac"
        },
        {
            "id": 3236,
            "name": "Dirk-Jan",
            "surname": "Uittenbogaard",
            "biography": "Dirk-Jan is a Consulting Systems Engineer in the EMEAR Digital Acceleration team with a focus on Cisco Spark, Cisco Spark API platforms and our Cloud Collaboration offering. \r\nHe is passionate about user interfaces, innovative ideas, sharing knowledge, new technologies and presenting. As a presenter he has received the Distinguished Speaker award for presentations at Cisco Live. \r\nDirk-Jan is married and has a 7-year-old son and has automated everything in his home. Using a Cisco Spark Bot he can fully control & monitor his home.",
            "role": "Consulting Systems Engineer",
            "company": "Cisco Systems",
            "community": "Cisco Spark Ambassador",
            "website": "",
            "github": "",
            "twitter": "@DJ_F3",
            "facebook": ""
        },
        {
            "id": 3240,
            "name": "Hendrik",
            "surname": "Blokhuis",
            "biography": "From 1970, educated as programmer living my passion thru organisations like:\r\nCisco (www.cisco.com), STT (www.stt.nl) , Compassion (www.compassion.com\/ldp) , ZOA (www.zoa.nl ) , Stichting Present (http:\/\/www.stichtingpresent.nl\/zeewolde\/ )\r\n\r\nFascinated by the power of connections between people, things, processes and data en the opportunity to give the world a serious update!\r\n\r\nZX Spectrum Rules!",
            "role": "CTO",
            "company": "Cisco",
            "community": "",
            "website": "www.cisco.nl\/dvn",
            "github": "",
            "twitter": "@hblokhuis",
            "facebook": ""
        },
        {
            "id": 3247,
            "name": "Sarah",
            "surname": "Gruneisen",
            "biography": "A passionate Senior Software Engineer born in the US.  Started in IT during the 2000 boom, moved to Switzerland, and in 2010 started her own successful company while working on integrated payment systems long before it was hip.  Currently settled in the Netherlands and still adjusting to the locale climate. \r\nWorked on a wide variety of projects\/industries, languages, and development frameworks. Current focus is DevOps  \/Java in the back-end and integration layers in the financial industry.  Addicted to board games, continues personal development, and spending time with family (+dog).",
            "role": "Mission Critical Software Engineer",
            "company": "Schuberg Philis",
            "community": "",
            "website": "http:\/\/www.sedeman.com",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3248,
            "name": "Raymond",
            "surname": "de Wit",
            "biography": "Raymond works as a Mission Critical Engineer at Schuberg Philis. Started working six years ago as a frontend developer straight out of school and over time transformed into a fullstack devops guy. In his free time likes working on his motorcycle, play around with domotica and can regularly be found on the circuit.",
            "role": "Mission Critical Engineer",
            "company": "Schuberg Philis",
            "community": "",
            "website": "",
            "github": "github.com\/rthewhite",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3264,
            "name": "Michele",
            "surname": "Tameni",
            "biography": "An unconventional software engineer, interested in research and development of innovative apps, experimenting on emerging technology and interaction methods. A contributor to some open source projects, some for work, mostly for passion. When not at a keyboard Michele is usually travelling around the world, taking photographs or writing about adventures.",
            "role": "CEO",
            "company": "mupp.it",
            "community": "",
            "website": "http:\/\/michele.tameni.it",
            "github": "",
            "twitter": "@netvandal",
            "facebook": ""
        },
        {
            "id": 3274,
            "name": "Rens",
            "surname": "van Leeuwen",
            "biography": "Trying to get it right ..",
            "role": "Mission Critical Software Engineer",
            "company": "Schuberg Philis",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3281,
            "name": "Sjoerd",
            "surname": "Mulder",
            "biography": "Sjoerd is an all-round technology expert with strong focus on engineering and scalability. He is current CTO at Crobox that combines consumer psychology and machine learning to increase revenue. \r\nAs CTO he is responsible for developing the Crobox Platform that is build with event streaming, online machine learning, generating real-time insights and capable of handling any load that the customers of Crobox are sending it.",
            "role": "Co-founder & CTO",
            "company": "Crobox",
            "community": "Various Tech Meetups around Amsterdam",
            "website": "https:\/\/crobox.com",
            "github": "",
            "twitter": "@frontendless",
            "facebook": ""
        }
    ],
    "speakerstotalks": [
        {
            "speakerid": 159,
            "talkid": 5084,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 226,
            "talkid": 4833,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 359,
            "talkid": 5795,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 769,
            "talkid": 5760,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1054,
            "talkid": 5358,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1066,
            "talkid": 4676,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1163,
            "talkid": 5792,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1263,
            "talkid": 5321,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1336,
            "talkid": 5806,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1390,
            "talkid": 4592,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1476,
            "talkid": 4751,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1600,
            "talkid": 5821,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1842,
            "talkid": 4587,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1844,
            "talkid": 5703,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1849,
            "talkid": 4607,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1867,
            "talkid": 4865,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 1969,
            "talkid": 4774,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2013,
            "talkid": 5036,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2030,
            "talkid": 5847,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2103,
            "talkid": 4560,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2120,
            "talkid": 4895,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2136,
            "talkid": 5132,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2249,
            "talkid": 4887,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2272,
            "talkid": 5167,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2347,
            "talkid": 5095,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2378,
            "talkid": 5764,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2393,
            "talkid": 4775,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2488,
            "talkid": 5234,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2525,
            "talkid": 4797,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2544,
            "talkid": 4859,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2570,
            "talkid": 5162,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2580,
            "talkid": 4569,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2585,
            "talkid": 5872,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2588,
            "talkid": 5838,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2588,
            "talkid": 5839,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2588,
            "talkid": 250000,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2660,
            "talkid": 5433,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2664,
            "talkid": 5429,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2665,
            "talkid": 5797,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2668,
            "talkid": 5451,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2670,
            "talkid": 4871,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2716,
            "talkid": 5077,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2716,
            "talkid": 5080,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2726,
            "talkid": 5294,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2736,
            "talkid": 5130,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2742,
            "talkid": 5133,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2794,
            "talkid": 5317,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2802,
            "talkid": 5331,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2821,
            "talkid": 5299,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2827,
            "talkid": 5322,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2828,
            "talkid": 5327,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2829,
            "talkid": 5334,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2843,
            "talkid": 5350,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2976,
            "talkid": 5774,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 2984,
            "talkid": 5471,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3020,
            "talkid": 5617,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3021,
            "talkid": 5541,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3057,
            "talkid": 5617,
            "eventid": 25,
            "role": "cospeaker"
        },
        {
            "speakerid": 3106,
            "talkid": 5667,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3143,
            "talkid": 5723,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3144,
            "talkid": 5720,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3145,
            "talkid": 5728,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3150,
            "talkid": 5919,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3170,
            "talkid": 5824,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3186,
            "talkid": 5757,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3210,
            "talkid": 5802,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3211,
            "talkid": 5803,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3221,
            "talkid": 5840,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3228,
            "talkid": 5834,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3231,
            "talkid": 5884,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3233,
            "talkid": 5856,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3236,
            "talkid": 5838,
            "eventid": 25,
            "role": "cospeaker"
        },
        {
            "speakerid": 3236,
            "talkid": 5839,
            "eventid": 25,
            "role": "cospeaker"
        },
        {
            "speakerid": 3240,
            "talkid": 5855,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3247,
            "talkid": 5849,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3248,
            "talkid": 5849,
            "eventid": 25,
            "role": "cospeaker"
        },
        {
            "speakerid": 3264,
            "talkid": 5779,
            "eventid": 25,
            "role": "speaker"
        },
        {
            "speakerid": 3274,
            "talkid": 5849,
            "eventid": 25,
            "role": "cospeaker"
        },
        {
            "speakerid": 3281,
            "talkid": 5918,
            "eventid": 25,
            "role": "speaker"
        }
    ],
    "updated_at": "2017-05-09 11:53:05"
}