{
    "talks": [
        {
            "id": 3965,
            "eventid": 24,
            "title": "The busy developer guide to Docker",
            "description": "Docker is all the rage these days and you are told all the time you need to use Docker to host your applications. But what is Docker and why has it become such a hot topic? Why is Microsoft updating Windows 2016 so be a Docker container host? What does using Docker mean for your application architecture or can you just take any application and host it using Docker? In this session Maurice de Beijer will explain the history of Docker as well as explain how you could use it with your applications. He will also explain what else, besides Docker, you will need to add to your architecture.",
            "type": "talk",
            "language": "English",
            "topic": "Containers",
            "level": "Intermediate",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-25",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 3969,
            "eventid": 24,
            "title": "Event-Sourcing your React-Redux applications",
            "description": "Most React-Redux applications store the work in progress as is in a database. It is fine to treat objects like this in a small application. But this is not optimal when applications are complex. Prefer the CQRS design pattern for more complex applications. Combining this with Event-Sourcing is an even more powerful solution. Event-Sourcing ensures that every action is stored as a separate domain event. These domain events are the CQRS write model. These events also project into a secondary database. This projection builds the CQRS read model for the application.",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-24",
            "starttime": "16:10:00",
            "endtime": "16:50:00"
        },
        {
            "id": 4015,
            "eventid": 24,
            "title": "Getting started with Go",
            "description": "This talk focuses on people which are interested the Go programming language and want to learn it.\r\nIn it I will present the various resources new gophers have to learn Go, what are the usual pitfalls and how to get help when they are stuck.",
            "type": "talk",
            "language": "English",
            "topic": "Languages",
            "level": "Beginner",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-24",
            "starttime": "16:10:00",
            "endtime": "16:50:00"
        },
        {
            "id": 4048,
            "eventid": 24,
            "title": "Regex-Fu",
            "description": "Regular expression, you either hate them or you love them, but do you really know how to harness their power ? Based on the PCRE implementation, this talk will show you how to get the most out of your \/^regex(es)?$\/, how switches affect your results, how to be less greedy, how to assert your power and let's not forget: when *not* to use regex.",
            "type": "talk",
            "language": "English",
            "topic": "Languages",
            "level": "Advanced",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4097,
            "eventid": 24,
            "title": "How to Leverage Machine Learning (R, Hadoop, Spark, H2O) for Real Time Processing",
            "description": "Big Data is key for innovation in many industries today. Large amounts of historical data are stored and analyzed in Hadoop, Spark or other clusters to find patterns, e.g. for predictive maintenance or cross-selling. However: How do you increase revenue or reduce risks in new transactions proactively?\r\n\r\nStream processing is the solution to embed patterns into future actions in real-time. This session discusses and demos how machine learning and analytic models with R, Spark MLlib, H2O, etc. can be build and integrated into real-time event processing frameworks. The session focuses on live demos",
            "type": "talk",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Beginner",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 4354,
            "eventid": 24,
            "title": "S3, Cassandra or Outer Space? Dumping Time Series Data using Spark",
            "description": "Vast volume of our processed data is Time Series data and once you start working with distributed systems, you start tackling many scale and performance problems: How to handle missing data?Should I handle both serving and backed process or separating them out? Best Performance for Money? In the talk we will tell the tale of all of the transformations we’ve made to our data model@Windward, some of the problems we’ve handled, review the multiple data persistency layers like: S3, MongoDB, Apache Cassandra, MySQL. And I’ll try my best NOT to answer the question “Which one of them is the Best?\"",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Bigdata",
            "level": "Intermediate",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-25",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 4357,
            "eventid": 24,
            "title": "Monitoring Big Data Systems Done \"The Simple Way\"",
            "description": "Once you start working with Big Data systems, you discover a whole bunch of problems you won’t find in monolithic systems. Monitoring all of the components becomes a big data problem itself.\r\nIn the talk we’ll mention all of the aspects that you should take in consideration when monitoring a distributed system using tools like: \r\nWeb Services,Spark,Cassandra,MongoDB,AWS. \r\nNot only the tools, what should you monitor about the actual data that flows in the system?\r\nWe’ll cover the simplest solution with your day to day open source tools, the surprising thing, that it comes not from an Ops Guy.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-24",
            "starttime": "16:10:00",
            "endtime": "16:50:00"
        },
        {
            "id": 4431,
            "eventid": 24,
            "title": "Fast Cars, Big Data - How Streaming Can Help Formula 1",
            "description": "Modern race cars produce lot of data, and all this in real time. In this presentation I will show you how data could be generated and used by various applications in the car, on the track or team head quarter.\r\n\r\nThe demonstration will show how to move data using messaging systems like Apache Kafka, process the data using Apache Spark and use various storage technics: Distributed File System, NoSQL Database.\r\n\r\nThis presentation is a great opportunity to see how to build a \" near real time big data application\".\r\n\r\nThe code from this talk will be made available as open source.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Bigdata",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-25",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 4482,
            "eventid": 24,
            "title": "Golang and Domain Specific Languages",
            "description": "The world is full of Domain specific langauges, and they are here for a reason.\r\nDo you need to interact with a relational database? SQL!\r\nDo you need to exchange data in a human readable format? JSON!\r\nAny level of interaction between humans and computers needs a DSL and If you are writing a program\r\nyou may need to implement a DSL at some point. \r\nIs that program is written in Go? This is the talk you where looking for!\r\nWe are going to see how Golang enables you to write your own lexer and parser\r\nin order to craft a programming language or a DSL to deal with your particular needs.",
            "type": "talk",
            "language": "English",
            "topic": "Languages",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-24",
            "starttime": "17:10:00",
            "endtime": "17:50:00"
        },
        {
            "id": 4503,
            "eventid": 24,
            "title": "Briefly Rust",
            "description": "Rust is a emerging system language with the speed of C\/C++, the ergonomics of a functional language and the safety of a modern dynamic language. \r\n\r\nIn this presentation I’ll expose the main feature of the language which make it distinctive and a good choice for fats and reliable software",
            "type": "talk",
            "language": "English",
            "topic": "Languages",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-24",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 4507,
            "eventid": 24,
            "title": "Make your animations perform well.",
            "description": "CSS animations have been around the web for some time already and have been helping us in many ways: they give the users feedback on their actions, lead them through a page, cheer them. Badly implemented animations on the other hand can be deadly to the website's performance and the user's delight. Let's learn together what are the best techniques to get our animations smooth.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-24",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 4512,
            "eventid": 24,
            "title": "Full-Text Search Explained",
            "description": "Today’s applications are expected to provide powerful full-text search. But how does that work in general and how do I implement it on my site or in my application?\r\n\r\nActually, this is not as hard as it sounds at first. This talk covers:\r\n* How full-text search works in general and what the differences to databases are.\r\n* How the score or quality of a search result is calculated.\r\n* How to implement this with Elasticsearch.\r\n\r\nAttendees will learn how to add common search patterns to their applications without breaking a sweat.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Bigdata",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-24",
            "starttime": "17:10:00",
            "endtime": "17:50:00"
        },
        {
            "id": 4529,
            "eventid": 24,
            "title": "Barbarians at the Gate(way)",
            "description": "This talk will examine the tools, methods and data behind the DDoS attacks that are prevalent in the news headlines. Using information collected, I will demonstrate what the attackers are using to cause their mischief and mayhem and examine the timeline and progression of attackers as they move from the historical page defacers to the motivated DDoS attacker. I will look at the motivations and rationale that they have and try to share some sort of understanding as to what patterns to be aware of for their own protection.",
            "type": "talk",
            "language": "English",
            "topic": "Security",
            "level": "Beginner",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4547,
            "eventid": 24,
            "title": "Learn how to embrace conflict - conflict resolution in daily work life",
            "description": "Conflicts are destructive. They destroy relationships & teams. They are the cause of up to 20% of every companies spendings and result in lost jobs, lost reputations and lost credibility. Everyone most likely has a negative image of being in a conflict. The seemingly easiest way out is to avoid conflict - and end up in a lose-lose situation.     \r\n\r\nIn this talk we will look at conflict's triggers and mechanisms to understand how they emerge and how they are resolved. We change perspectives to take a closer look at the positive aspects of conflicts and how to use them to make them work for us.",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-25",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 4548,
            "eventid": 24,
            "title": "Unreal Engine 4 Blueprints: Odio e amore",
            "description": "Una delle caratteristiche salienti di Unreal Engine 4 e' la possibilita' di essere programmato attraverso un linguaggio visuale a nodi denominato 'Blueprint'. Per molti programmatori si tratta di una vera e propria eresia, secondo Epic e' un ottimo modo per permettere agli artisti e i designer di iniziare a prototipizzare le loro creazioni. E' davvero cosi' ? Si puo' costruire un gioco utilizzando solo le Blueprint senza aver bisogno di un monitor da 2000 pollici ? Le Blueprint possono davvero essere usate da un artista senza basi di programmazione ?",
            "type": "talk",
            "language": "Italian",
            "topic": "GameDev\/VR",
            "level": "Beginner",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-24",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 4561,
            "eventid": 24,
            "title": "Docker Inside\/Out: the ‘real’ real-world of stacking containers in production",
            "description": "So you’ve already containerized the shit out of your code, broken down monoliths, microserviced the hell out of your app and have run some awesome workloads in your local, dev and test environments. It’s all looking good, but now what? Running Docker commands is one thing, but maintaining containers in production is a whole other ballgame. So during this talk I’ll show you the REAL wild world of Docker in production. With the added benefit of talking to and observing how over 900 of our customers have been using Docker in production.",
            "type": "talk",
            "language": "English",
            "topic": "Containers",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-24",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 4593,
            "eventid": 24,
            "title": "Create cross-platform apps that interact with Microsoft Graph and Office 365",
            "description": "Microsoft Graph is the access point to many Microsoft APIs (Office 365, Outlook.com, Excel Online, SharePoint, OneDrive, Skype, etc...) and unlocks many scenarios like editing Office documents stored in OneDrive from an app, accessing user and organization data, interact with mail, calendar and presence, receiving a call when something change on a file, directory, calendar item, and so on.\r\nIn this session we'll see how to interact with Microsoft Graph from many cross-platform technologies, both client side (i.e. Xamarin) and server side.",
            "type": "talk",
            "language": "Italian",
            "topic": "Mobile",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-24",
            "starttime": "16:10:00",
            "endtime": "16:50:00"
        },
        {
            "id": 4625,
            "eventid": 24,
            "title": "How to build distributed applications with Erlang.",
            "description": "Erlang è un linguaggio usato per applicazioni concorrenti, ad alta affidabilità e scalabili. La clusterizzazione è sicuramente  uno dei punti di forza di Erlang. Nel talk partiremo dai concetti base fino creare una applicazione distribuita attraverso le OTP libraries. Vedremo inoltre come scalare un cluster aggiungendo e\/o rimuovendo nodi e come controllare in modo passivo lo stato di uno o piu nodi. Alla fine del talk penserete \"ma come ho fatto a vivere senza\"!!",
            "type": "talk",
            "language": "Italian",
            "topic": "Languages",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-25",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 4626,
            "eventid": 24,
            "title": "Galateo semi-serio dell'Open Source",
            "description": "Anche per te \"Open Source\" = \"qualcuno ha già fatto il lavoro al posto mio, e per di più gratis\"?\r\nOttimo, allora sei nel posto giusto e con l'approccio giusto! \r\nIn questo talk, attraverso tanti episodi di vita vissuta come utente, contributor e maintainer, discuteremo di come trarre una serie di altri vantaggi da questo magico mondo, di come approcciarsi alle community e, perché no, anche delle gioie e dei dolori che ti aspettano se decidi di saltare la staccionata e di rendere (veramente) open il tuo codice.",
            "type": "talk",
            "language": "Italian",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-25",
            "starttime": "16:20:00",
            "endtime": "17:00:00"
        },
        {
            "id": 4634,
            "eventid": 24,
            "title": "Introduction to gRPC: A general RPC framework that puts mobile and HTTP\/2 first",
            "description": "gRPC is a high performance, language-neutral, general RPC framework developed and open sourced by Google. Built on the HTTP\/2 standard, gRPC brings many benefits such as bidirectional streaming, flow control, header compression, multiplexing and more. In this session, you will learn about gRPC and how you can use it in your applications.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Beginner",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-24",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 4636,
            "eventid": 24,
            "title": "The building blocks of the next web, from Customer Journey to UI Components.",
            "description": "Designing for the web changed from an artisan template design to a more modern LEGO builder approach. Creating a personalized library of UI&UX bricks with intelligent behaviors helps an organization to build a real product. Reusable components can be combined in more complex structures, widgets and templates thus providing higher fidelity to design and decreasing the time to market. \r\nThrough real project examples, this talk will introduce the design methodology and process to translate a UX model into a set of components, and the recommended development practices to implement.",
            "type": "talk",
            "language": "Italian",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-25",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 4652,
            "eventid": 24,
            "title": "I just hacked your app!",
            "description": "Android security is nowhere near where it should be. I have been able to hack and get sensitive information from a few different apps and I’m just an amateur hacker at best. It’s easy to forget mobile devices aren’t as safe as we think they are.\r\n\r\nIn this session we will explore a number of ways an Android app can be exploited and methods we can use to avoid these attacks.\r\n\r\nWe will finish by looking at common techniques that will help you protect sensitive information within your application by adding tampering detection and making sure every external communication request is made securely.",
            "type": "talk",
            "language": "English",
            "topic": "Security",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-25",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 4697,
            "eventid": 24,
            "title": "I have a stream - Insights in Reactive Programming",
            "description": "Reactive Programming is described as the next big thing of a programming paradigm. When you take a look around in social networks like Twitter or discussion platforms like Stackoverflow you will find lots of people talking about it. They even ask the question what Reactive Programming is all about. \r\nYet people still get confused by the question what Reactive Programming or even Functional Reactive Programming is. Starting off at this point of confusion we want to take a closer look at Reactive Programming and the concepts behind this paradigm.",
            "type": "talk",
            "language": "English",
            "topic": "Reactive Programming",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-24",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 4700,
            "eventid": 24,
            "title": "Taming the Asynchronous Beast with CSP Channels in JavaScript",
            "description": "Every piece of software deals with complex control flow mechanisms like callbacks, promises, events, and streams. Some require simple asynchronous coordination, others processing of event or stream-based data, and many deal with both. Your solution to this has a deep impact on your code.\r\n\r\nThose problems can be simplified using a single abstraction since the underlying problem to all of this is the same. I'd like to show you CSP and the concept of channels, as well diving into some real examples through solid javascript implementations.",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-25",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 4715,
            "eventid": 24,
            "title": "Component-Based UI Architectures for the Web",
            "description": "Today UI frameworks for the web are embracing the concept of “components”.  But what does a component-focused architecture really mean?  In this talk we’ll dive into the theory behind component-based UIs and what it means for the future of user interfaces on the web.\r\n\r\nAt the conclusion of this talk, attendees will have an understanding of what makes component-based architectures distinct, and why such an approach might be the ideal solution for building web-based UIs.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-24",
            "starttime": "16:10:00",
            "endtime": "16:50:00"
        },
        {
            "id": 4716,
            "eventid": 24,
            "title": "My 10 favorite Haxe language features",
            "description": "The Haxe Programming Language was designed to be simple and powerful. \r\nIts toolkit provides an incredibly fast cross-compiler (JS, PHP, C++, Java, C#, Python…). \r\nIn this lightning talk, Francis will introduce the grammar, and will list the features that he likes the most. As you can imagine, the goal of this presentation is not to showcase a non-exhaustive list of features.This will be more a quick and deep introduction about this open-source platform, to share with everyone love and power, and maybe, who knows. This will make you want to get started.",
            "type": "talk",
            "language": "English",
            "topic": "Languages",
            "level": "Beginner",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-25",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 4728,
            "eventid": 24,
            "title": "Rust: ovvero un moderno linguaggio sicuro, pratico e multithread.",
            "description": "Il giovanissimo linguaggio di programmazione ideato da Mozilla è in grado di fondere la sintassi espressiva e la flessibilità dei linguaggi ad alto livello con il controllo e le prestazioni dei linguaggi di basso livello. In questo talk scopriremo le fondamenta di Rust e analizzeremo alcune sue implementazioni pratiche. Tornerete a casa e avrete voglia solo di iniziare a scrivere codice installando i suoi strumenti nativi, parola di Mozillian!",
            "type": "talk",
            "language": "Italian",
            "topic": "Languages",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-24",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 4731,
            "eventid": 24,
            "title": "Community in a nutshell for developers",
            "description": "Creare una community di sviluppatori ed utilizzatori intorno al proprio prodotto è diventato ormai fondamentale. Persone appassionate che forniscono feedback, documentazione e casi d'uso, trovano bug, suggeriscono feature e contribuiscono allo sviluppo. Tutto questo crea innovazione, attira contributor ed allarga la base di utenti a dismisura.\r\nVi spiegherò come rendere il proprio prodotto una bomba creandogli una intera community intorno, come gestire discussioni aperte e coinvolgere le persone. Consigli pronti per l'uso, cosa funziona e cosa no",
            "type": "talk",
            "language": "Italian",
            "topic": "Inspirational",
            "level": "Intermediate",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-24",
            "starttime": "17:10:00",
            "endtime": "17:50:00"
        },
        {
            "id": 4752,
            "eventid": 24,
            "title": "Universal JavaScript Web Applications with React",
            "description": "Since we started to see JS on the server side, the dream of developers has been to reduce the gap and the cost of switch between frontend\/backend. Today with Node.js, React and a whole ecosystem of tools, this dream is becoming true! In this talk I am going to discuss about Universal (a.k.a. Isomorphic) JS and present some practical example regarding the major patterns related to routing, data retrieval and rendering. I will use Node, React, Webpack, Babel and React Router and give you a series of example to get you started easily with this new technology trend.",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4867,
            "eventid": 24,
            "title": "Sviluppare applicazioni nell'era dei \"Big Data\" con Scala e Spark",
            "description": "Scala è un linguaggio di programmazione general purpose multi-paradigma pensato per realizzare applicazioni ad alte prestazioni che girano all'interno della Java Virtual Machine. Spark è il framework \"Big Data\", basato su Scala, più flessibile e performante disponibile oggi sul mercato. Durante il talk verrà introdotto il linguaggio Scala e verranno mostrate le potenzialità legate al suo utilizzo nell'ambito dello sviluppo di applicazioni web di ultima generazione compresa la possibilità di processamento parallelo di grandi quantità di dati attraverso l'utilizzo del framework Spark.",
            "type": "talk",
            "language": "Italian",
            "topic": "Cloud\/Bigdata",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-25",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 4877,
            "eventid": 24,
            "title": "ASP.NET Core Services e Linux per il Mobile",
            "description": "ASP.NET Core è il nuovo framework open-source e cross-platform per la creazione di applicazioni Cloud, Web, IoT e Backend per applicazioni mobili composto da elementi modulari che permettono di avere la massima flessibilità e il minimo overhead. Come sfruttare tutti questi pregi, per creare un servizio web da pubblicare nel Cloud e consumabile da un'applicazione Android ? Lo scopriremo insieme durante la sessione.",
            "type": "talk",
            "language": "Italian",
            "topic": "Mobile",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4894,
            "eventid": 24,
            "title": "Urban Legends: What You Code Makes You Who You Are",
            "description": "If you were a carpenter, would your skills at building be more important than the tools you use to build? Skills, right?  Tools are just a means to an end.  So why do developers think the language they use defines the problems they solve?\r\n\r\nThis talk will take a look at misconceptions across the board, some experiences, both positive and negative, people have had crossing barriers to new languages, and show some of the benefits thinking of one's self as a coder and not a \"Ruby coder\" or a \"PHP dev\" can have on being a better problem solver.",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 4904,
            "eventid": 24,
            "title": "Web Based Virtual Reality",
            "description": "There has been a surge in the development of virtual reality applications with the production of easily accessible and sophisticated VR devices such as Oculus Rift, HTC Vive and Samsung Gear. Frameworks like A-Frame developed by the MozVR team combined with cheap alternatives such as Google Cardboard allows the developers to leverage the power of the web. The attendees of this talk would learn about the WebVR API, using A-Frame to build virtual worlds, creating virtual worlds for modern content display (such as reddit posts, news feeds, Instagram photos) as well as game development.",
            "type": "talk",
            "language": "English",
            "topic": "GameDev\/VR",
            "level": "Beginner",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 4921,
            "eventid": 24,
            "title": "RESTFUL SERVICES MADE EASY: THE EVE REST API FRAMEWORK",
            "description": "Powered by Python, MongoDB and good intentions the Eve REST API framework allows to effortlessly build and deploy highly customizable, fully featured RESTful Web Services. It is written in Python and it is powered by MongoDB, although SQL backends are supported via community extensions. In this talk I will show the framework features, explain its philosophy, and live-demo it so that you can better understand if Eve can become a valuable asset to your current and future projects.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-25",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 4935,
            "eventid": 24,
            "title": "Microservices in GO",
            "description": "In this talk we'll see how to write a cloud native microservice with Go language,\r\nthe microservices will be: \r\nCloud native\r\nA twelve factor app\r\nScalable with the GO built in concurrency\r\nMonitored with a distributed tracing system to check the latency \r\nTestable with a load test during the development\r\nCommunications with different protocols",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Advanced",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-25",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 4950,
            "eventid": 24,
            "title": "Microservice Plumbing",
            "description": "If you implement a microservice architecture correctly, you will end up with a proliferation of different microservices; with multiple instances of each one for redundancy. Find out how you to get microservices to automatically discover each other, share a configuration with real-time updates. See how to eliminate server management altogether with \"serverless\" microservice frameworks.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-24",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 4957,
            "eventid": 24,
            "title": "Con te non ci lavoro",
            "description": "Ogni azienda ha una serie di criteri, più o meno condivisibili, per la scelta dei collaboratori esterni con cui portare avanti progetti. Nel nostro caso questi criteri sono un risultato delle nostre passate esperienze lavorative, dei valori che abbiamo abbracciato e dell’approccio che ci aspettiamo di trovare nel suddetto collaboratore. Questo talk presenta una sorta di vademecum operativo utile a tutti i knowledge workers ed alle aziende che vogliono collaborare con loro.",
            "type": "talk",
            "language": "Italian",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 4963,
            "eventid": 24,
            "title": "Asynchronous IO in Rust",
            "description": "Rust is a system programming language focused on safety, speed, and concurrency. It's standard library provides API for dealing with I\/O, but for now in a synchronous way. In this talk we'll dive into the ecosystem of asynchronous libraries published so far on crates.io and how to use them in order to build robust, scalable, and production ready network clients and servers.",
            "type": "talk",
            "language": "Italian",
            "topic": "Languages",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-24",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 4969,
            "eventid": 24,
            "title": "Web is the New Mobile:  Building Progressive Web Apps",
            "description": "Progressive web apps combine the best of the web with the best of native mobile apps. These apps create increasingly more informed experiences, the more the user interacts with the app, without the need to download a native app. Progressive web apps include features like app store free installation, connectivity independent experiences, push notifications, background synching, additional security and performance gains. In this session we’ll dive into the technologies behind these next-gen web features and learn how they’re driving the evolution of the web.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-25",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 4974,
            "eventid": 24,
            "title": "Comics and immersive storytelling in Virtual Reality",
            "description": "Virtual Reality is an undoubtedly ideal storytelling platform, whichever the story.\r\nAfter starting with the very first VR comic in the world, \"Magnetique\", a GearVR exclusive, we'll focus on telling virtual reality stories without resorting to 360° videos.\r\nDrawing techniques, stereoscopic coding, sequential art tips and tricks. And more.\r\nOur times allow for a unique opportunity to tell old stories, anew.",
            "type": "talk",
            "language": "English",
            "topic": "GameDev\/VR",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-24",
            "starttime": "16:10:00",
            "endtime": "16:50:00"
        },
        {
            "id": 4993,
            "eventid": 24,
            "title": "Kubernetes and lastminute.com: our course towards better scalability and processes",
            "description": "Kubernetes adoption is straight forward when starting from scratch or in public clouds, but what the journey looks like when your starting point is a legacy infrastructure with high-traffic? \r\nIn this talk we present our experience that begun almost 1 year ago and challenged everything inside our organisation. Developer teams changed the way they work, product owners benefit from the new speed achieved and the need of new roles emerged in IT department.\r\nWe will explain our lessons learnt and the way to get the best out of this solution.",
            "type": "talk",
            "language": "English",
            "topic": "Containers",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-24",
            "starttime": "17:10:00",
            "endtime": "17:50:00"
        },
        {
            "id": 5006,
            "eventid": 24,
            "title": "Staying Alive: Patterns for Failure Management From the Bottom of the Ocean",
            "description": "This talk uses the framework of technical SCUBA and rebreather diving to talk about patterns for failure management and how they can be applied towards engineering. It examines the ways that complex systems fail and challenges our heroism-based model of success which ignores consistent, uneventful execution. It also looks into different approaches to risk management and why the typical model that we depend on is not safe.  You will walk away with an understanding of how failure cascades occur and how to protect your system and your team from failure.",
            "type": "talk",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-25",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5011,
            "eventid": 24,
            "title": "The road to a Service Oriented Architecture is paved with messages",
            "description": "One of the options on the table when implementing a Service Oriented Architecture (SOA), or the communication style across multiple microservices, is based on messages and a service bus. This talk will drive you through the basic SOA building blocks, introduce message based architectures, and will connect the dots between technology and architectural principles.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-24",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 5019,
            "eventid": 24,
            "title": "App Dev in the Cloud: Not my circus, not my monkeys...",
            "description": "When faced with all the hype around Cloud, most application developers are not really all that excited. Maybe you get that feeling that it isn't your problem, just leave me to my applications. Let me show you why, as an application developer, you can't ignore your Cloud stack anymore. We will examine your Cloud stack anxieties and provide you with a solutions to ease you into your first private PaaS on your own local machine that you can install in just minutes. Finally you will be given a myriad of examples to take home with you to take control of this circus and own the monkeys!",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Bigdata",
            "level": "Beginner",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "16:10:00",
            "endtime": "16:50:00"
        },
        {
            "id": 5026,
            "eventid": 24,
            "title": "Building a theming system with React",
            "description": "In my career I've created several component libraries, and always found it challenging and rewarding at the same time. The engine we developed at WorkWave is the result of such attempts: it offers a great tradeoff between flexibility and ease of use. Styling with inline styles greatly simplifies the developer's work while the use of Aphrodite to output real classes enables the full spectrum of css features. I'll show you the choices we made, what problems have arisen while developing the components and how we solved them, hopefully helping you make better choices for your own libraries.",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-24",
            "starttime": "17:10:00",
            "endtime": "17:50:00"
        },
        {
            "id": 5041,
            "eventid": 24,
            "title": "Unethical JavaScript",
            "description": "As Douglas Crockford said, JavaScript is one of the most misunderstood languages.\r\nAlso if the new standardizations brought to a more cohesive lingo, there are still development habits that create unpredictable effects and unreadable code.\r\nDuring this session, we'll dive in those habits discussing how the most recent versions of ECMA script help to write a cleaner and more sustainable JavaScript.",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "17:10:00",
            "endtime": "17:50:00"
        },
        {
            "id": 5044,
            "eventid": 24,
            "title": "Reactive MVP",
            "description": "The model view presenter ( MVP ) is a robust architecture that allows us to break our application into smaller, modular, testable and composable component. \r\nBut, it does not solve how to manage concurrent or async events in such a way that your app will still work smoothly and your code stay readable. To address the concurrency problem, one possible solution is to use RxJava. \r\nIn this talk, we will explore how you can compose RxJava with MVP to create both a robust architecture and logical concurrency flow.",
            "type": "talk",
            "language": "English",
            "topic": "Reactive Programming",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-25",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5074,
            "eventid": 24,
            "title": "Fullstack <*> guide to the galaxy",
            "description": "In ogni progetto si scambiano molte informazioni tra vari attori: DEVs, PM, clienti... Il più delle volte il grafo delle informazioni che lega queste entità è debole, causando un abbassamento della qualità delle scelte fatte.\r\nCondivisione della documentazione, comunicazione tra microservizi, rapporto con gli stakeholder, ... siamo spesso abituati a ragionare a compartimenti stagni. Vedremo come un \"Approccio Fullstack\" possa rimuovere questi blocchi, facendo vedere come una maggiore condivisione migliori la qualità delle scelte che riguardano tecnologie, comunicazione, aspetti umani e costi.",
            "type": "talk",
            "language": "Italian",
            "topic": "Inspirational",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-24",
            "starttime": "16:10:00",
            "endtime": "16:50:00"
        },
        {
            "id": 5083,
            "eventid": 24,
            "title": "A recommendation engine for your applications",
            "description": "Nowadays a lot of websites try to guess what we could like:\r\n\"Recommendation for you in books\"\r\n\"People you may like\"\r\nSounds familiar, isn't it? Wouldn't be cool if you could do the same in your application? Well, this session is for you! In the first part of this talk recommendation systems will be introduced, focusing on collaborative filtering algorithms (CR). After that we'll dive in Prediction.io, an open source machine learning server for software developers to create predictive features, such as personalization, recommendation and content discovery.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-25",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 5089,
            "eventid": 24,
            "title": "Thinking Functionally",
            "description": "The rise in AI, machine learning & data lakes is driving greater use of Functional Programming, so how well do you know the concepts?\r\n\r\nWe will discuss immutable data, functional composition, polymorphism, higher-order functions, pattern matching & recursion. These concepts helps the developer create performant, complex system with simple building blocks, using parallelism to make applications & services more scalable.\r\n\r\nUsing Clojure as live code examples, you will understand the important functional concepts & patterns that you can apply to your own preferred languages.",
            "type": "talk",
            "language": "English",
            "topic": "Languages",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-25",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5093,
            "eventid": 24,
            "title": "Life of an SRE at Google: ending the conflict between DEV and OPS side.",
            "description": "We've all heard about DEVOPS and companies adopting DEVOPS tactics and strategies.  But how can we limit the inherent tension and resulting conflicts between DEV and OPS side? That is bad for effectiveness, the work environment and attrition.  But we want to have an organization that people love to work at, keeps \"the site\" reliable and moves systems forward at a high pace. In its 13 year history, SRE have learned what happens when you live by ground rules, such as automation, launching fast and often, having well defined SLAs and in case of outages, writing blameless postmortems.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Beginner",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-24",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 5106,
            "eventid": 24,
            "title": "React Native for multi-platform mobile applications",
            "description": "Since its 2013 release, React has brought a new way to design UI components in the world wide web. The same fundamentals have been taken to another important environment in our contemporary world: the mobile applications. We'll see the philosophy behind React Native - learn once, write anywhere - and how this new framework helps developers to build native apps using React.",
            "type": "talk",
            "language": "Italian",
            "topic": "Mobile",
            "level": "Intermediate",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-25",
            "starttime": "16:20:00",
            "endtime": "17:00:00"
        },
        {
            "id": 5107,
            "eventid": 24,
            "title": "Continuous Delivery Database",
            "description": "Molto spesso in tutta la gestione della vita del software si pensa al database come una cosa mistica, scritto nella pietra, con sue regole e tempi. Questo talk vuole portare un pò di chiarezza su come le nuove tecnologie ma soprattutto le nuove metodologie come il DevOps, permettono di gestire il database come se fosse una componente viva dell'applicazione, versionabile e manutendibile.\r\nCon l'aiuto di due prodotti opensource come Liquibase e Flyway a confronto per avere le idee chiare da subito, su come utilizzarlo in casa.",
            "type": "talk",
            "language": "Italian",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-25",
            "starttime": "16:20:00",
            "endtime": "17:00:00"
        },
        {
            "id": 5114,
            "eventid": 24,
            "title": "To The Moon",
            "description": "We all have moments that change the way we think, the way we look at the world, the things we want to do with our lives. On July 20, 1969 millions of people had one of those transforming experiences: Two men landed on the Moon and nothing was ever the same again. Why did we go to the Moon? How did we get there? What was it like to witness it all? And what does any of this have to do with writing software 40 years later? In this talk, Russ Olsen will take you back to a humid Sunday afternoon that changed his life. It might yet change yours.",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-25",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5179,
            "eventid": 24,
            "title": "Fortify your Web App: Write Secure JavaScript Code & Test it!",
            "description": "Do you know what security breaches are skulking in your JavaScript code? What does it take to protect a modern web application from attacks? This talk will give insight into most common security issues in JavaScript code - and into some which are less well known. It will show how they can be exploited, and how to prevent this. You will furthermore find out how to test whether you've been successful in securing your application, showing different open source tools available for this purpose .",
            "type": "talk",
            "language": "English",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5222,
            "eventid": 24,
            "title": "OMG, it's all about SVG!",
            "description": "Have you ever thought that dabbling in SVG and animating it might be a cumbersome part of your work? Probably yes. To be honest, I had thought the same before I actually started playing with it. During my presentation I'll tell you why SVG is so hyped and powerful right now, giving you a couple of creative and fun examples. I'll also show you how to easily animate SVG using simple CSS animations, which advantages SVG has over other formats and finally I'll shed a light on SVG's accessibility.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Beginner",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-24",
            "starttime": "17:10:00",
            "endtime": "17:50:00"
        },
        {
            "id": 5254,
            "eventid": 24,
            "title": "Cyber Security in Multi Cloud Architecture",
            "description": "Nuovi modelli di sicurezza in ambienti multi-cloud. Ridefinizione del concetto di Front-End. Nuovi approcci alle tematiche di sicurezza in scenari magmatici.",
            "type": "talk",
            "language": "Italian",
            "topic": "Security",
            "level": "Advanced",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-25",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5270,
            "eventid": 24,
            "title": "Cyber Wars in the Cyber Space",
            "description": "Cyber: the final frontier, the place where government units and military intelligence are fighting a new kind of war. From total warfare to cyber warfare, from cybercrime to cyberterrorism, talking about intelligence and offensive based approaches, government malwares, big data repositories, 0-day brokering, attacks to nuclear implants, power plants and air carriers,  we'll do a quick tour inside this new world, full of opportunities, contenders, lies and real amazing stories...",
            "type": "talk",
            "language": "Italian",
            "topic": "Security",
            "level": "Beginner",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5284,
            "eventid": 24,
            "title": "The Secret Recipe for Automating Android Malware Analysis",
            "description": "Rapid advent of Android platforms has dawned an era of sophisticated malware that attacks\r\nthese systems. To better understand this slew of threats, in this talk, I will first\r\nintroduce CopperDroid, an automatic VMI-based dynamic analysis system to reconstruct the\r\nbehaviors of Android malware. I will then discuss the efficacy of such behavioral profiles\r\nto differentiate between families of malware. Finally, in a departure from traditional\r\nclassification techniques, I further show how a statistical machine learning evaluation\r\nfacilitates near-perfect accuracy by considering prediction sets",
            "type": "talk",
            "language": "English",
            "topic": "Security",
            "level": "Advanced",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-25",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 5367,
            "eventid": 24,
            "title": "Machine Learning for Developers",
            "description": "Have you always wanted to add predictive capabilities or voice recognition to your application, but haven’t been able to find the time or the right technology to get started? Everybody wants to build smart apps, but only a few are Data Scientists.  This session will help you understand machine learning terminology & challenges, implement a machine learning model, add predictive capabilities to your app, and provide your customer with voice UX.",
            "type": "talk",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-25",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 5435,
            "eventid": 24,
            "title": "Progressive Web Apps: trick or real magic?",
            "description": "Con il passare del tempo i siti e le applicazioni diventano sempre più pesanti e gli utenti consumano i loro contenuti prevalentemente attraverso dispositivi mobile. Due cose che non vanno certo d'accordo.\r\nRendere le applicazioni performanti è un compito difficile soprattutto quando ci sono variabili che non possiamo controllare, come la connessione. I Service Worker e altre tecniche che stanno dietro le Progressive Web Apps possono essere una risposta concreta a questo problema.",
            "type": "talk",
            "language": "Italian",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-24",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 5511,
            "eventid": 24,
            "title": "The history of Containers and VMs",
            "description": "I concetti di virtual machine e di container non sono recenti, ma hanno una lunga storia, e si sono riproposti, intrecciati e susseguiti nel corso degli anni. La presentazione mostra come alcuni concetti risalgano agli albori dell’informatica, e di come siano stati a volte riscoperti e riproposti man mano che la tecnologia evolveva.\r\n\r\nPartendo da Liberator di Honeywell, arriveremo a Docker …",
            "type": "talk",
            "language": "Italian",
            "topic": "Containers",
            "level": "Intermediate",
            "room_order": 2,
            "room": "Room N1",
            "date": "2017-03-25",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 5512,
            "eventid": 24,
            "title": "Insights into Chatbot Development - Implementing Cross-Platform Chatbots",
            "description": "Overview over different chatbot platforms and their features. How to implement a cross-platform chatbot for Facebook Messenger, Skype, Telegram, WeChat, Kik... and all the others.",
            "type": "talk",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Beginner",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-24",
            "starttime": "17:10:00",
            "endtime": "17:50:00"
        },
        {
            "id": 5515,
            "eventid": 24,
            "title": "Container orchestration: the cold war",
            "description": "L’ecosistema degli orchestratori di container è in rapido movimento, una galassia di piattaforme e framework. Come si fa a scegliere quello giusto per le vostre esigenze?\r\n\r\nVediamo tutti gli orchestratori in commercio, con i loro pro e contro: DC\/OS, Kubernetes, Docker e anche quelli meno famosi ma saranno promesse, e anche le dinamiche e le scelte fatte.",
            "type": "talk",
            "language": "Italian",
            "topic": "Containers",
            "level": "Intermediate",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5516,
            "eventid": 24,
            "title": "Chasing Elephants",
            "description": "Developers suffer from dangerous addictions. They draw pleasure in making things work. When this doesn't happen this could lead to dramatic consequences. Developers deprived of the possibility of making things work could start exposing dangerous behaviours like challenging authority and mainstream thinking. In extreme cases, they may even fall into the abyss of asking the forbidden question: \"Why?\"",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-25",
            "starttime": "17:20:00",
            "endtime": "18:00:00"
        },
        {
            "id": 5536,
            "eventid": 24,
            "title": "Il game audio come processo ingegneristico",
            "description": "Mostrare come il game audio è a tutti gli effetti una professionalità che unisce ad aspetti artistico creativi, forti competenze tecnico informatiche. L'audio designer può a tutti gli effetti considerarsi un ingegnere del suono, che applica modelli, regole e metodi rigorosi per ottenere il risultato. Tutto questo all'interno del ciclo di produzione, integrandosi con grafici, designer e programmatori",
            "type": "talk",
            "language": "Italian",
            "topic": "GameDev\/VR",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-24",
            "starttime": "17:10:00",
            "endtime": "17:50:00"
        },
        {
            "id": 5555,
            "eventid": 24,
            "title": "The Secrets of High Performance: Science Edition",
            "description": "Nicole has spent the last four years researching high-performing IT teams, and the impact of IT performance on organizational performance. In this talk, she will present the key factors that enable not just higher throughput but also higher stability and quality, lower cost, and happier teams. Discover how continuous delivery and lean management practices produce higher IT performance (and indeed what IT performance means), along with how to measure culture and its impact on our work. Learn the patterns and practices used by high-performing organizations to outcompete their peers.",
            "type": "keynote",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Beginner",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5611,
            "eventid": 24,
            "title": "Angular Rebooted: Components Everywhere",
            "description": "Attracted by AngularJS power and simplicity, you have chosen it for your next project. Getting started with DataBinding, Scopes and Controllers was relatively quick and easy. But what do you need to effectively bring a complex application to Production? We discuss the new Component API, from ngOnChanges to selecting different ways for components to collaborate, from choosing between Two-Way Binding and One-Way Data Flow, to \"smart\" vs \"dumb\" components, sharing recipes from our real world experience so that you can productively & reliably build a complex application out of reusable Components.",
            "type": "talk",
            "language": "Italian",
            "topic": "Javascript",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-24",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5614,
            "eventid": 24,
            "title": "Xamarin.Forms Performance Tips & Tricks",
            "description": "Xamarin.Forms is a framework for building cross-platform applications that share most of the UI codebase among the UWP, iOS and Android platforms. Due to the higher level of abstraction compared to Xamarin.Native, Xamarin.Forms applications may suffer from memory leaks and slow rendering times at the expense of the final user experience.\r\nIn the session, we will explore the mechanisms used by Xamarin.Forms to translate abstract UI components into native ones, highlight with demos what are the main bottlenecks met by developer, how to solve them and get close to native performances.",
            "type": "talk",
            "language": "Italian",
            "topic": "Mobile",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-24",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5615,
            "eventid": 24,
            "title": "What can we learn from 750 billion GitHub events and 42 TB of code",
            "description": "\"Data gives us insights into how people build software, and the activities of open source communities on GitHub represent one of the richest datasets ever created of people working together at scale.\"  --GitHub Universe 2016\r\n\r\nWe are going to analyze - live on stage - 5 years of GitHub metadata and 42 TB code stored in it to answer questions like:\r\n\r\n- How is this run\r\n- Design decisions based on actual usage of APIs\r\n- The most effective phrasing to request changes\r\n- Effects of social media \r\n- Beyond project stars\r\n- Community health\r\n- Static code analysis\r\n- Tabs or spaces?",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Bigdata",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5616,
            "eventid": 24,
            "title": "SWIMming in the Microservices Ocean",
            "description": "We are in the middle of paradigm shift from services to distributed execution blocks. In this talk, we will see how scaling HTTP based micro-services is hard, and how cooperative RPC functions can facilitate our lives. Designing and deployment are going to be the main focus, with a final focus on how to operate such an architecture at scale. When software and hardware can scale performances at unimaginable boundaries, people and operations are forced to follow and that’s where most of the time all of these becomes complex and unmaintainable…but we have a solution for that.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5623,
            "eventid": 24,
            "title": "Resilient microservices with Kubernetes",
            "description": "Creating a single microservice is a well understood problem. Creating a cluster of load-balanced microservices that are resilient and self-healing is not so easy. Managing that cluster with rollouts and rollbacks, scaling individual services on demand, securely sharing secrets and configuration among services is even harder. Kubernetes, an open-source container management system, can help with this. In this talk, we will learn what makes Kubernetes a great system for automating deployment, operations, and scaling of containerized applications.",
            "type": "talk",
            "language": "English",
            "topic": "Containers",
            "level": "Beginner",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-24",
            "starttime": "16:10:00",
            "endtime": "16:50:00"
        },
        {
            "id": 5634,
            "eventid": 24,
            "title": "Microservices and containers networking: Contiv, an industry leading open source solution from Cisco",
            "description": "Contiv provides a higher level of networking abstraction for microservices: it provides built-in service discovery and service routing for scale out services, working with schedulers like Docker Swarm, Kubernetes, Mesos and Nomad. \r\nWe will see some code examples, basic use cases and an easy tutorial on the web.",
            "type": "talk",
            "language": "English",
            "topic": "Containers",
            "level": "Beginner",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5640,
            "eventid": 24,
            "title": "From a Developer's POV: is Machine Learning Reshaping the World?",
            "description": "There is no denying that machine learning is rapidly reshaping the technological horizon, fueled by increasing availability of data, computing power, and software (e.g., TensorFlow). Classical ML techniques are becoming a common tool for the everyday programmer, at the same time that sophisticated deep learning models are fueling driverless cars, advanced AI players, and more. This talk will survey the ways in which ML is impacting the programming world, as we try to answer the following questions: are we truly witnessing a new AI resurgence? If yes, what should any developer be aware of?",
            "type": "talk",
            "language": "Italian",
            "topic": "AI\/Machine Learning",
            "level": "Beginner",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-24",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 5652,
            "eventid": 24,
            "title": "Meetup Code Garden Roma e Java User Group Roma: metodi asincroni con Spring",
            "description": "Possiamo scrivere metodi asincroni anche in Java e con Spring, anche senza dover usare le ultime versioni della JVM o del framework. Si parlerà di thread bloccati e altri stati del thread. Le interfacce Executor della JDK ci aiutano a gestire le chiamate asincrone; vedremo come vengono implementate in Spring. Ci saranno esempi di configurazioni XML e con annotations. Si parlerà di callback hell e di come evitarlo usando la Completable Future.",
            "type": "talk",
            "language": "Italian",
            "topic": "Meetup",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-24",
            "starttime": "18:30:00",
            "endtime": "19:10:00"
        },
        {
            "id": 5654,
            "eventid": 24,
            "title": "Avoiding Checkmate: Strategies for Design Systems",
            "description": "It sounded so simple. Architect and build a modern CSS framework for a \"Living Design System\" — at enterprise scale. What could go wrong? Before the game begins, strategy seems so simple. But after the first move, it quickly becomes a game of chess. From naming, and taxonomy, to adoption, versioning, and deprecation, every move influences the next. Because unlike chess, with a living Design System, the game never ends.",
            "type": "keynote",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-25",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5666,
            "eventid": 24,
            "title": "Microservices and the Inverse Conway Manoeuvre",
            "description": "Go faster than your competitors. That’s the promise of microservices – deploy faster, scale faster, be more robust. It’s all about outcomes and the way your organisation is structured has a tremendous impact on those outcomes. it’s easy to say “Conway’s Law” and then move swiftly on. “But but but, but how?”\r\nIn this talk James explores what we mean by business capabilities and how architecture and organisational design interact. He may even mention Isomorphism.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5670,
            "eventid": 24,
            "title": "Capturing the human body motion with inertial sensors, the Open Source way.",
            "description": "Motion capture devices have historically been prohibitively expensive, and their use was restricted to military and scientific institutions, and some audiovisual companies.\r\nIn the last years MEMS based inertial sensors have experienced significant development on their precision while decreasing size and cost. In combination with the appearance and spread of some computational inexpensive sensor fusion algorithms and fast microcomputers, motion capture at domestic level is now possible.\r\nIn this talk we’ll review the essential techniques to it by focusing on a system developed by the author.",
            "type": "talk",
            "language": "Italian",
            "topic": "GameDev\/VR",
            "level": "Beginner",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-25",
            "starttime": "16:20:00",
            "endtime": "17:00:00"
        },
        {
            "id": 5672,
            "eventid": 24,
            "title": "Cyber Analysts: who they are, what they do, where they are",
            "description": "Cyber security is one of the most challenging topic in the current era. Cyber attacks are becoming day by day more sophisticated and difficult to be detected by automated systems. People who understand cyber threats and act to block cyber attacks are defined as cyber analysts. But what do they really do ? What dificulties do they meet and what background should they have before starting the \"neverending\" \"cyber security\" learning path ? Why is not enough an automated system ?\r\n\r\nMarco will talk about real experiences on the cyber analyst field.",
            "type": "talk",
            "language": "English",
            "topic": "Security",
            "level": "Beginner",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-24",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 5674,
            "eventid": 24,
            "title": "Pronti per la legge sulla data protection GDPR? No Panic!",
            "description": "L’Application Economy obbliga l’IT a correre alla stessa velocità del business. Nel contempo l’entrata in vigore di nuove stringenti normative in ambito sicurezza impone l’adeguamento del Software Delivery LifeCycle affinché queste possano essere implementate e testate già dalle fasi iniziale dello sviluppo, ottimizzando i tempi di delivery e minimizzando il time to market.",
            "type": "talk",
            "language": "Italian",
            "topic": "Security",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5681,
            "eventid": 24,
            "title": "An introduction to Realistic Ocean Rendering through FFT",
            "description": "A widely used approach to display realistic FFT  (Fast Fourier Transform) ocean water on todays games is presented. A similar approach has been employed in movies like Titanic and Waterworld and in games like Assassin's Creed 3 and Crysis just to name a few.\r\nIn this presentation we will talk about the matematical aspects that are at the heart of this technique up to the shading aspects that will represent the visual appearance of water and also how the LOD of the water mesh is managed.\r\nA demo implemented under Unreal Engine 4 or videos will be presented to better explain such a complex topic.",
            "type": "talk",
            "language": "English",
            "topic": "GameDev\/VR",
            "level": "Advanced",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5682,
            "eventid": 24,
            "title": "You and your containers: strumenti di automazione in Cloud",
            "description": "L'intervento si propone di illustrare l'utilizzo di strumenti di automazione per ambienti basati su Container adatti ad un approccio DevOps, dallo sviluppo alla produzione. Saranno forniti dettagli ed esempi pratici su Container in Cloud per visualizzare, configurare ed orchestrare i propri stack tecnologici su di una infrastruttura Docker erogata come servizio.",
            "type": "talk",
            "language": "Italian",
            "topic": "Containers",
            "level": "Intermediate",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-25",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5684,
            "eventid": 24,
            "title": "Does Your Web App Speak Schadenfreude?",
            "description": "¿Hablas español? Sprechen Sie Deutsch? No? Well even if you don't speak another language, chances are good that your web application will need to. During this session, we'll use some real world examples to explore the many challenges involved in localizing a web application–from properly sizing text and controls to the use of color and images to cultural issues you might not even be aware of. And of course, we'll look at some best practices to ensure your web app can tackle any language thrown at it.",
            "type": "talk",
            "language": "English",
            "topic": "Design\/Front-end",
            "level": "Beginner",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5706,
            "eventid": 24,
            "title": "Exploring Google Assistant",
            "description": "How does Google Assistant work? How to design and add new capabilities? In this talk, we'll see how to interact with the Assistant in Google Home and other devices, how to add custom Actions and how to understand what users are saying and reply to them using API.ai service",
            "type": "talk",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Intermediate",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-25",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 5714,
            "eventid": 24,
            "title": "Moving from Monolithic to Microservice Architecture: an OSS based stack deployed in Production",
            "description": "Realizzare un’unica piattaforma che garantisce Omni-channel, Zero-downtime, Functional-decomposition e Auto-scaling è possibile?\r\nVi raccontiamo un caso reale di come, utilizzando Zuul, Eureka, SpringBoot, Docker abbiamo realizzato  i desideri del cliente e attuato questa trasformazione.",
            "type": "talk",
            "language": "Italian",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-25",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5717,
            "eventid": 24,
            "title": "Building advanced Chats Bots and Voice Interactive Assistants",
            "description": "If it takes minutes to code a simple bot, building professional bots represents quite a challenge. Soon you realize you need serious programming and API architecture experience but also “Bot” specific skills.\r\n\r\nIn this session, we'll first show the code of advanced Chat and Voice interactions, and then explore the challenges faced when building advanced Bots (Context storage, NLP approaches, Bot Metadata, OAuth scopes), and discuss interesting opportunities from latest industry trends (Bot platforms, Serverless, Microservices).\r\n\r\nThis talk is about showing the code and sharing lessons learnt.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5724,
            "eventid": 24,
            "title": "DomusDotNet, DotNetCode & dotNET{podcast} Meetup - Serverless Computing",
            "description": "Il Serverless Computing è l'ultima frontiera della rivoluzione \"cloud\" della programmazione ed enfatizza ulteriormente la produttività caratteristica delle offerte PaaS. Azure Functions è la soluzione di Serverless Computing integrata in Azure, con cui poter raggiungere rapidamente l'obiettivo di organizzare la propria applicazione a microservizi, o di integrarsi in maniera flessibile con applicazioni esterne, senza preoccuparsi dell'infrastruttura sottostante.\r\n\r\nAzure Functions Deep Dive - Giorgio Di Nardo\r\n\r\nASP.NET Core with Azure Functions - Luca Congiu",
            "type": "talk",
            "language": "Italian",
            "topic": "Meetup",
            "level": "Beginner",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-24",
            "starttime": "18:30:00",
            "endtime": "19:10:00"
        },
        {
            "id": 5727,
            "eventid": 24,
            "title": "From bots to machine learning: How the 4th Industrial Revolution will forever change how we live, work, play and learn.",
            "description": "Jose has dedicated the past 10 years to creating platforms and Internet standards that aim to democratize voice, video and text communications. He believes that developers, not governments, are the key to harnessing these profound shifts in technology for the good of society. In this talk, Jose shares his thoughts on the future of collaboration and how, if applied correctly, the Fourth Industrial Revolution will be a unifying force that transcends borders and propels everyone forward.",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "09:40:00",
            "endtime": "10:00:00"
        },
        {
            "id": 5730,
            "eventid": 24,
            "title": "Meetup DjangoGirls - L'approccio femminile alla tecnologia: le nostre esperienze, finora",
            "description": "Il primo evento DjangoGirls in Italia è stato a Roma, ospitato da Codemotion: un anno, 8 workshop, 60 coach e 300 partecipanti dopo, possiamo tracciare un primo bilancio del \"metodo DjangoGirls\", provare a raccontare l'energia che scorre in questi workshop, e qual è l'importanza di coinvolgere tante donne nell'imparare a costruire strumenti tecnologici. Il movimento DjangoGirls sta crescendo sempre di più e i prossimi mesi saranno fitti di eventi per tutta Italia: partecipa se sei interessata (o interessato!) all'idea. Fare il coach è facile, ti possiamo dare una mano e ci aiuterai a crescere.",
            "type": "talk",
            "language": "Italian",
            "topic": "Meetup",
            "level": "Beginner",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-24",
            "starttime": "18:30:00",
            "endtime": "19:10:00"
        },
        {
            "id": 5732,
            "eventid": 24,
            "title": "Invader Studios: sviluppatori da “Incubo”",
            "description": "°Road to Invader - La nostra storia e come siamo diventati una Software House. Dall'incontro in Giappone con Capcom alla           decisione di intraprendere lo sviluppo di una nostra IP.\r\n° Daymare: 1998 - Descrizione del progetto e delle sfide che accompagnano lo sviluppo di un titolo del genere.",
            "type": "talk",
            "language": "Italian",
            "topic": "GameDev\/VR",
            "level": "Beginner",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-25",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5737,
            "eventid": 24,
            "title": "How to embed Video Calls and Messaging in your applications without being a Media, WebRTC, XMPP or SIP expert  ",
            "description": "If Messaging and Video communications are now in our habits (whether WhatsApp, Facebook Messenger, Cisco Spark…), it is still pretty complicated to integrate these capabilities in our Mobile and Web applications.\r\n \r\nAnnounced at both Apple and Cisco WW conferences in July 2016 (https:\/\/developer.cisco.com\/site\/apple\/), Cisco is working on a SDK that allows developers to add video capabilities to any apps with just a few lines of code.  \r\n \r\nJoin this session to get latest information about these SDKs and the underlying Tropo and Spark architectures.",
            "type": "talk",
            "language": "English",
            "topic": "Mobile",
            "level": "Intermediate",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-24",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 5743,
            "eventid": 24,
            "title": "Help us to transform the Italian Public Administration!",
            "description": "The Digital Transformation Team, led by Diego Piacentini, has the ambitious aim of building the \"operating system\" of the Country: a series of fundamental blocks upon which services for citizens, the Public Administration, and enterprises are built with modern digital products. The Team is working on a double path: bringing a pool of selected existing projects to life (i.e. ANPR, SPID, PagoPA, etc.) and innovating with new projects. Developers.italia.it is an strategic project to collect SDKs, documentation, source code and Playgorund of all major public technologies.",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "10:30:00",
            "endtime": "11:10:00"
        },
        {
            "id": 5751,
            "eventid": 24,
            "title": "Salagiochi ed eventi VR, un trend in crescita",
            "description": "La Realtà Virtuale sta plasmando il futuro della comunicazione e del gioco ma: è pronta per il grande pubblico?\r\nQuesto talk presenterà la VR come innovazione e rinnovamento all'interno della sala giochi, volgendo l'attenzione sulle criticità che sono state e dovranno essere affrontate per rendere questa tecnologia alla portata di tutta l'utenza.\r\nSaranno analizzate le difficoltà presenti nell'utilizzo (sicurezza, igiene, etc.), soluzioni disponibili ad oggi, i grandi player già presenti nel mercato (TheVoid, ZeroLatency, etc.) e come gestire le licenze commerciali delle applicazioni steam.",
            "type": "talk",
            "language": "Italian",
            "topic": "GameDev\/VR",
            "level": "Beginner",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-25",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 5756,
            "eventid": 24,
            "title": "Xamarin: Shared Library and Portable Class Library",
            "description": "A key component of the creation of cross-platform applications to be able to share code among several specific projects and platform dependent. Each different platform can only use the class libraries that have been developed for that specific platform. In Xamarin there are two main approaches to the sharing code: Using Shared Asset Projects (Shared Library) and the Portable Class Library (PCL) Projects. In this session we will see how and when to use the shared library, or the PCL library and we will try to answer the question: Shared or PCL?",
            "type": "talk",
            "language": "Italian",
            "topic": "Mobile",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-24",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 5762,
            "eventid": 24,
            "title": "Handle insane devices traffic using Google Cloud Platform",
            "description": "In a world of connected devices it is really important to be prepared receiving and managing a huge amount of messages. In this context what is making the real difference is the backend that has to be able to handle safely every request in real time. In this talk we will show how the broad spectrum of highly scalable services makes Google Cloud Platform the perfect habitat for such as workloads.",
            "type": "talk",
            "language": "Italian",
            "topic": "Cloud\/Bigdata",
            "level": "Intermediate",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5765,
            "eventid": 24,
            "title": "Meetup RomaJS - introduzione interattiva a Node.js",
            "description": "Da ormai qualche anno Node.js sta prendendo sempre più piede sia in ambito startup che in ambito enterprise, cerchiamo di capire insieme di cosa si tratta, quali sono le sue caratteristiche principali e dove questo tool può dare il meglio di sé.\r\n\r\nInizieremo da una introduzione del JavaScript runtime, descrivendo il suo sistema di I\/O non bloccante e le principali funzionalità che mette a disposizione. Passeremo poi  all'enorme ecosistema di librerie (NPM), mostrando le più famose e il loro utilizzo.",
            "type": "talk",
            "language": "Italian",
            "topic": "Meetup",
            "level": "Beginner",
            "room_order": 5,
            "room": "Room N12",
            "date": "2017-03-24",
            "starttime": "18:30:00",
            "endtime": "19:10:00"
        },
        {
            "id": 5781,
            "eventid": 24,
            "title": "Muoversi in VR",
            "description": "Uno studio sul design delle locomozioni disponibili nella realtà virtuale, le pratiche migliori per non far sentire male il giocatore e quelle più uniche e strambe, un modo per studiare meglio il Gameplay  del proprio prodotto in questo mercato emergente.",
            "type": "talk",
            "language": "Italian",
            "topic": "GameDev\/VR",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-25",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 5782,
            "eventid": 24,
            "title": "Kunos Simulazioni and Assetto Corsa, behind the scenes",
            "description": "Basic rules and suggestions about how to create a game, to get hired and more, and things you need to know to port your game on console.",
            "type": "talk",
            "language": "Italian",
            "topic": "GameDev\/VR",
            "level": "Beginner",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-24",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 5784,
            "eventid": 24,
            "title": "Webhooks do's and dont's: what we learned after integrating +100 APIs",
            "description": "Le applicazioni moderne sono sempre più orientate ad essere una composizione di API e ad avere un architettura serverless, per questo motivo chi sviluppa API non può limitarsi ad esporre i più comuni endpoint REST.\r\n\r\nI Webhook non possono mancare in un' API moderna ma non c'è nulla nella letteratura delle API HTTP che si avvicini ad un formato standard per la loro progettazione dando vita alle implementazioni più disparate. \r\n\r\nDopo aver integrato oltre 100 API con Stamplay vi raccontiamo quali sono i pro e i contro delle scelte progettuali che si fanno nello sviluppo di Webhook.",
            "type": "talk",
            "language": "Italian",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 8,
            "room": "Room DS1",
            "date": "2017-03-24",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5789,
            "eventid": 24,
            "title": "Monitoring @ Scale in Salesforce",
            "description": "Have you ever tried to monitor the health of your service? You know, retrieving server stats, application error counts and plotting cool graphs?  Measuring as much as possible is crucial to understand how your software behaves in production. \r\n\r\nBut what if you had to monitor “the cloud” with hundreds of thousands of servers and customers? Alerts can create “noise” and spam your team. Would you be able to answer “how is my user's experience” at any given point in time? \r\n\r\nThis talk will present a case study on how Salesforce approaches monitoring at scale by putting a customer first.",
            "type": "talk",
            "language": "English",
            "topic": "DevOps\/Architecture",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-24",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 5794,
            "eventid": 24,
            "title": "Debug, Analyze and Optimize Games with Intel Tools",
            "description": "Use the full potential of your favorite platform while improving a videogame's frame rate and performance with GPA (Graphic Performance Analyzer), a free tool powered by Intel. Featuring a convenient panel overlay, you can quickly identify problem areas and experiment with improvements without having to recompile the source code. System Analyzing to isolate common bottlenecks that affect your game's performance in real time. Analyze performance on a single frame down to the draw call level. Identify where you can evenly distribute workloads across the CPU and GPU.",
            "type": "talk",
            "language": "English",
            "topic": "GameDev\/VR",
            "level": "Beginner",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-24",
            "starttime": "14:10:00",
            "endtime": "14:50:00"
        },
        {
            "id": 5798,
            "eventid": 24,
            "title": "Meetup DEED - il primo incontro di Design <3 Development",
            "description": "Presentazione e primo incontro di DEED (Design <3 Development), la nuova community in cui Designer e Developer si cercano, si parlano e si confrontano. Un ponte tra silos troppo spesso isolati, per far emergere il vero valore della collaborazione. \r\n\r\nDurante l'incontro un'anteprima dei temi trattati nei futuri meetup con gli interventi di:\r\n\r\nEmanuele Macri (nois3) -- \"Introduzione a CSS Grid\"\r\n \r\nLuca Ferretti (Immobiliare.it) -- \"Partecipanti entusiasti e dove trovarli\"\r\n... ovvero cosa ho imparato facendo guerrilla usability testing in una città dove caffè non è sinonimo di Starbucks",
            "type": "talk",
            "language": "Italian",
            "topic": "Meetup",
            "level": "Beginner",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-24",
            "starttime": "18:30:00",
            "endtime": "19:10:00"
        },
        {
            "id": 5799,
            "eventid": 24,
            "title": "An Introduction to Apache Ignite",
            "description": "Apache Ignite is a high-performance, integrated and distributed in-memory platform for computing and transacting on large-scale data sets in real-time, orders of magnitude faster than possible with traditional disk-based or flash technologies.",
            "type": "talk",
            "language": "English",
            "topic": "Cloud\/Bigdata",
            "level": "Beginner",
            "room_order": 4,
            "room": "Room N5",
            "date": "2017-03-24",
            "starttime": "15:10:00",
            "endtime": "15:50:00"
        },
        {
            "id": 5800,
            "eventid": 24,
            "title": "Data Integration, Data Firewall e Data Security - JBoss Data Virtualization to the rescue",
            "description": "JDV come piattaforma di integrazione di dati, indipendentemente dalla sorgente, protocollo e formato.\r\nTutte le logiche di modellazione del dato e sua integrazione, sono gestite unicamente da JDV.\r\nJDV è in grado di consumare fonti dati eterogenee, rendendole omogenee, accessibili, ottimizzate e performanti (cache).\r\nIl dato è fruibile in vari formati e protocolli standard, tra i quali: JDBC, ODBC, OData, REST, SOAP.\r\nJDV gestisce e abilita la sicurezza di accesso al dato (ACL), non solo in termini di struttura (tabella, colonna, record), ma anche in termini di contenuto (masking e hashing).",
            "type": "talk",
            "language": "Italian",
            "topic": "Cloud\/Bigdata",
            "level": "Intermediate",
            "room_order": 7,
            "room": "Room N14",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "12:10:00"
        },
        {
            "id": 5801,
            "eventid": 24,
            "title": "Commodore 64 Mon Amour(2): sprite multiplexing. Il caso Catalypse e altre storie.",
            "description": "Continuiamo il viaggio iniziato lo scorso anno nel magico mondo della moderna programmazione del Commodore 64. La scena italiana e romana è molto attiva.\r\nDopo una brevissima introduzione sugli sprite in generale, il mitico Andrea Pompili, autore dello sparattutto Catalypse pubblicato da Genias nel 1992, ci spiegherà la tecnica dello sprite multiplexing, utilizzata per superare il noto limite degli 8 sprite contemporanei a schermo, applicata al suo gioco.",
            "type": "talk",
            "language": "Italian",
            "topic": "GameDev\/VR",
            "level": "Intermediate",
            "room_order": 3,
            "room": "Room N3",
            "date": "2017-03-25",
            "starttime": "16:20:00",
            "endtime": "17:00:00"
        },
        {
            "id": 5812,
            "eventid": 24,
            "title": "Elementary, Watson! -Diving into the cognitive world-",
            "description": "Cloud and new technologies are making machine learning and cognitive computing cheap and handy. There are no boundaries to application scenarios, but your creativity. Let's walk through some actual implementations of cognitive computing and let's see what's behind the scenes exploring the building blocks that are the foundations of these applications. Do you like bots and robots? This could be the session for you.",
            "type": "keynote",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Intermediate",
            "room_order": 0,
            "room": "Room N10",
            "date": "2017-03-24",
            "starttime": "10:00:00",
            "endtime": "10:20:00"
        },
        {
            "id": 5813,
            "eventid": 24,
            "title": "Hybrid Programming in Hybrid Cloud: be ready to the success ",
            "description": "In questa sessione mostriamo la programmazione ibrida intesa come disciplina per costruire moderni sistemi software composti da moduli scritti in differenti linguaggi, implementati su tipi differenti di runtimes in cloud ed eventualmente  su differenti piattaforme cloud. Verranno evidenziati e discussi i vantaggi e le implicazioni, anche di business, di tale modello in modo che ciascuna persona o team in grado di implementare in software una buona idea,  potrà cogliere le opportunità che l'era della digital transformation offre, senza dover necessariamente fare degli investimenti significativi",
            "type": "talk",
            "language": "Italian",
            "topic": "DevOps\/Architecture",
            "level": "Beginner",
            "room_order": 6,
            "room": "Room N13",
            "date": "2017-03-24",
            "starttime": "12:30:00",
            "endtime": "13:10:00"
        },
        {
            "id": 240000,
            "eventid": 24,
            "title": "Learn to build Bots and add Video, SMS, Voice to your apps by using Cisco Spark and Tropo and win and Apple Watch!",
            "description": "In this lab you will definitely get in touch with the new Cisco capabilities provided by Spark and Tropo services.\nIf you are working on an app and you wish to boost the communication capabilities, don’t miss these labs!\nMeet Cisco specialists who will help you in discovering all the functionalities of Cisco Spark and Tropo and actually help you to integrate them in your app easily.\nCome and say hello at any time. The entrance is free and you can choose among any of the following sessions, long 20 minutes each:\nChatBots\nChatOps in practice\nVideo and Mobile applications\nSMS\nVoice",
            "type": "lab",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Intermediate",
            "room_order": 9,
            "room": "Room N4",
            "date": "2017-03-24",
            "starttime": "11:30:00",
            "endtime": "18:00:00"
        },
        {
            "id": 240001,
            "eventid": 24,
            "title": "Build your App with Salesforce and win an HTC Vive VR headset!",
            "description": "Trailhead is a new, fun, and free way to learn how to build apps on Salesforce. Through interactive, hands-on challenges, you",
            "type": "lab",
            "language": "English",
            "topic": "Mobile",
            "level": "Beginner",
            "room_order": 9,
            "room": "Room N4",
            "date": "2017-03-25",
            "starttime": "11:30:00",
            "endtime": "17:20:00"
        },
        {
            "id": 240002,
            "eventid": 24,
            "title": "(streaming) From bots to machine learning: How the 4th Industrial Revolution will forever change how we live, work, play and learn.",
            "description": "The Digital Transformation Team, led by Diego Piacentini, has the ambitious aim of building the \"operating system\" of the Country: a series of fundamental blocks upon which services for citizens, the Public Administration, and enterprises are built with modern digital products. The Team is working on a double path: bringing a pool of selected existing projects to life (i.e. ANPR, SPID, PagoPA, etc.) and innovating with new projects. Developers.italia.it is an strategic project to collect SDKs, documentation, source code and Playgorund of all major public technologies.",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Beginner",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-24",
            "starttime": "09:40:00",
            "endtime": "10:00:00"
        },
        {
            "id": 240003,
            "eventid": 24,
            "title": "(streaming) Elementary, Watson! -Diving into the cognitive world",
            "description": "Cloud and new technologies are making machine learning and cognitive computing cheap and handy. There are no boundaries to application scenarios, but your creativity. Let's walk through some actual implementations of cognitive computing and let's see what's behind the scenes exploring the building blocks that are the foundations of these applications. Do you like bots and robots? This could be the session for you.",
            "type": "keynote",
            "language": "English",
            "topic": "AI\/Machine Learning",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-24",
            "starttime": "10:00:00",
            "endtime": "10:20:00"
        },
        {
            "id": 240004,
            "eventid": 24,
            "title": "(streaming) Chasing Elephants",
            "description": "Developers suffer from dangerous addictions. They draw pleasure in making things work. When this doesn't happen this could lead to dramatic consequences. Developers deprived of the possibility of making things work could start exposing dangerous behaviours like challenging authority and mainstream thinking. In extreme cases, they may even fall into the abyss of asking the forbidden question: \"Why?\"",
            "type": "keynote",
            "language": "English",
            "topic": "Inspirational",
            "level": "Intermediate",
            "room_order": 1,
            "room": "Room N11",
            "date": "2017-03-25",
            "starttime": "17:20:00",
            "endtime": "18:00:00"
        }
    ],
    "speakers": [
        {
            "id": 43,
            "name": "Simone",
            "surname": "Scardapane",
            "biography": "Simone Scardapane is a post-doc fellow at Sapienza University (Rome) and an honorary fellow at the University of Stirling (UK). His research is focused on machine learning, with an emphasis on deep learning, distributed environments, and applications in the audio field. Before the PhD, he obtained a B.Sc. in Computer Engineering in 2009, and a M.Sc. in Artificial Intelligence and Robotics in 2011. He is an active member of several organizations, including the IEEE Computational Intelligence Society, the International Neural Networks Society, and the AI*IA.",
            "role": "Post-doc fellow",
            "company": "University of Rome \"La Sapienza\"",
            "community": "Google Developers Group - Lazio Abruzzo",
            "website": "http:\/\/ispac.diet.uniroma1.it\/scardapane\/",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 68,
            "name": "Francesco",
            "surname": "Fullone",
            "biography": "I love to work with web technologies and my new hobby is testing startups business models. You can find me in almost every social networks as fullo and physically, sometimes, in ideato‘s office in Cesena.\r\n\r\nI spend some of his free time traveling, organising conferences (like Kerning, BetterSoftware, phpDay and jsDay) for GrUSP, one of the biggest European community on PHP, and writing books. If you attended any international (or national) conference about web technologies in Italy, you met me as speaker, organiser or attendee.",
            "role": "CEO",
            "company": "ideato",
            "community": "grusp",
            "website": "http:\/\/fullo.net",
            "github": "http:\/\/github.com\/fullo",
            "twitter": "@fullo",
            "facebook": "http:\/\/fb.com\/francesco.fullone"
        },
        {
            "id": 76,
            "name": "Giuliano",
            "surname": "Iacobelli",
            "biography": "Software engineer who loves to create beautiful and valuable web products. Committed 24\/7 on Stamplay\r\nEntrepreneur-oriented since I was 17. I run a web agency while studying at the university. 8 years of experience in project management and software development. PR and Influencer by nature I co-founded one of the largest tech community in Italy Indigeni Digitali, now President of Association Alumni Innovaction Lab, won a Startup Weekend Rome and Facebook Hackathon. Love to share knowledge and I do workshops at Roma Tre University.\r\nPassionate about Hip Hop, NFL, Golf.Proudly made in Italy.",
            "role": "CTO",
            "company": "Stamplay",
            "community": "GRUSP, PUG ROMA",
            "website": "https:\/\/stamplay.com",
            "github": "https:\/\/github.com\/Giuliano84",
            "twitter": "@giuliano84",
            "facebook": "https:\/\/www.facebook.com\/giuliano.iacobelli"
        },
        {
            "id": 93,
            "name": "Michele",
            "surname": "Finelli",
            "biography": "Consulente e socio BioDec. Laureato in Scienze dell’informazione, ha\r\nsvolto attività di consulenza dal 1996, lavorando per aziende di varia\r\nnatura (piccole, medie, multinazionali). Dal 2003 è socio BioDec, la\r\nprima azienda bioinformatica italiana e attualmente segue la parte di\r\ngestione IT e manutenzione. Ha alcuni lavori scientifici su\r\nhttp:\/\/www.researchgate.net\/",
            "role": "socio",
            "company": "BioDec",
            "community": "Erlug, XPUG Bologna, Slow Food, ACM, IEEE",
            "website": "http:\/\/www.biodec.com",
            "github": "https:\/\/github.com\/finelli",
            "twitter": "@gaunilone",
            "facebook": ""
        },
        {
            "id": 138,
            "name": "Pietro",
            "surname": "Libro",
            "biography": "Ho iniziato la mia carriera di DEV nel 2002 utilizzando Visual Basic 6 ed ho iniziato a studiare ed utilizzare le tecnologie del .NET Framework dalla versione 1.1. Negli anni ho consolidato le mie conoscenze in ambito informatico conseguendo la Laurea Specialistica in Informatica ed acquisendo certificazioni Microsoft in ambito .NET. \r\nParticolarmente interessato alle architetture distribuite ed alle tecnologie di accesso ai dati. Socio fondatore della community Romana DomusDotNet.",
            "role": "Software Engineer Test Systems",
            "company": "+GF+ Machining Solutions",
            "community": "DomusDotNet",
            "website": "http:\/\/blogs.ugidotnet.org\/PietroLibroBlog",
            "github": "",
            "twitter": "@pietrolibro",
            "facebook": ""
        },
        {
            "id": 141,
            "name": "Luigi",
            "surname": "Dell' Aquila",
            "biography": "Computer engineer, Open Source enthusiast, technology addicted.\r\nDirector of Consulting and Core Developer at OrientDB.",
            "role": "Director of Consulting and Core Developer",
            "company": "OrientDB LTD",
            "community": "Raspberry Jam Roma",
            "website": "",
            "github": "github.com\/luigidellaquila\/",
            "twitter": "@ldellaquila",
            "facebook": ""
        },
        {
            "id": 159,
            "name": "Michele",
            "surname": "Orselli",
            "biography": "Software engineer, working with PHP since 2005 and now CTO at Ideato.\r\nI have broad interests in several aspects of software development like automation, quality and testing.\r\nI'm co-author of \"PHP Best Practices\", published by FAG in 2012. Serial speaker @phpday, you can find some of my talks on https:\/\/joind.in\/user\/view\/188",
            "role": "CTO",
            "company": "Ideato",
            "community": "PHP, Javascript",
            "website": "",
            "github": "",
            "twitter": "@_orso_",
            "facebook": ""
        },
        {
            "id": 167,
            "name": "Matteo",
            "surname": "Collina",
            "biography": "Matteo is a code pirate and mad scientist. He spends most of his days programming in node.js, but in the past he worked with Ruby, Java and Objective-C. He recently defended his a Ph.D. thesis titled \"Application Platforms for the Internet of Things\". Now he is a Software Architect at nearForm, working on the nscale deployer. Matteo is also the author of the Node.js MQTT Broker, Mosca and of the LevelGraph database. Matteo spoke at several international conferences: Nodeconf.eu, LXJS, Distill by Engine Yard, and JsDay to name a few. In the summer he loves sailing the Sirocco.",
            "role": "Architect",
            "company": "nearForm",
            "community": "Node.js",
            "website": "www.matteocollina.com",
            "github": "https:\/\/github.com\/mcollina",
            "twitter": "@matteocollina",
            "facebook": ""
        },
        {
            "id": 168,
            "name": "Giulio",
            "surname": "De Donato",
            "biography": "Liuggio aka Giulio De Donato is a passionate open source developer, he is the Docker Advocate at XPeppers. Expert in e-commerce platforms and Service Oriented Architecture, he is actively involved in the PHP community and Golang ecosystem. An open source library he created is currently used by wikipedia and the composer badges are used by all the PHP github repositories. He is known as evangelist of good design, code quality and Dev-Ops methodologies.",
            "role": "Docker Advocate",
            "company": "XPeppers",
            "community": "symfony, pug roma, rome js, golang",
            "website": "http:\/\/welcometothebundle.com",
            "github": "http:\/\/github.com\/liuggio",
            "twitter": "@liuggio",
            "facebook": ""
        },
        {
            "id": 181,
            "name": "Mauro",
            "surname": "Servienti",
            "biography": "Mauro is a Solution Architect in Particular Software, the makers of NServiceBus, and longtime Microsoft MVP. He spends his time helping developer building better .NET systems leveraging Service Oriented Architecture (SOA) principles and message based architectures. When he is not busy with distributed systems he loves to go back to one of his first loves: rich client development using XAML based technologies. Mauro usually writes about technology, but not only, on his blog at \/\/milestone.topics.it. He is also passionate about skiing, classical dance and music, in general.",
            "role": "Solution Architect",
            "company": "Particular Software",
            "community": "UgiDotNet, GUISA",
            "website": "http:\/\/milestone.topics.it",
            "github": "",
            "twitter": "@mauroservienti",
            "facebook": ""
        },
        {
            "id": 185,
            "name": "Waehner",
            "surname": "Kai",
            "biography": "Kai Wähner works as Technology Evangelist at TIBCO. His main area of expertise lies within the fields of Application Integration, Big Data, Analytics, SOA, BPM, Cloud Computing, Java EE and Enterprise Architecture Management. Kai is speaker at international IT conferences such as JavaOne, ApacheCon or OOP, writes articles for professional journals, and shares his experiences with new technologies on his blog (www.kai-waehner.de\/blog).\r\nContact: kontakt@kai-waehner.de. Twitter: @KaiWaehner. Find more details and references (presentations, articles, blog posts) on his website www.kai-waehner.de",
            "role": "Technology Evangelist",
            "company": "TIBCO",
            "community": "Java User Group Munich, Hadoop User Group Munich, Microservices Meetup Munich, Big Data Beers Berlin",
            "website": "http:\/\/www.kai-waehner.de",
            "github": "",
            "twitter": "@KaiWaehner",
            "facebook": ""
        },
        {
            "id": 190,
            "name": "Andrea",
            "surname": "Pompili",
            "biography": "Andrea Pompili is an information technology specialist that takes care of security. Quite young, he joined the computer's world with one of the most famous Italian games based on the C64 platform. Once graduated, he started working first in the software development market, and then in computer security, following security threats and solutions on strategic projects. \r\nCurrently Andrea is a strategy advisor in security, and aims to discover and integrate innovative solutions for this connected world. Starting from 2013 he has joined the OWASP ZAP developement core team.",
            "role": "Security Consultant",
            "company": "Independent",
            "community": "OWASP ZAP",
            "website": "http:\/\/letigriditelecom.blogspot.it\/",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 243,
            "name": "Massimiliano",
            "surname": "Dessì",
            "biography": "Massimiliano has more than 16 years of experience in programming.\r\nHe's a proud father of three.\r\nManager of GDG sardegna, Co-Founder of Jug Sardegna, founder of Spring framework IT, member of Scala User Group Italy,\r\nAuthor of Spring 2.5 AOP. \r\nHe builds Platform As A Service with Docker, Kubernetes, Go and Java for Dev Groups",
            "role": "Senior Software Engineer",
            "company": "Red Hat",
            "community": "Jug Sardegna, Google Developers Group Sardegna",
            "website": "http:\/\/desmax74.wordpress.com\/",
            "github": "https:\/\/github.com\/desmax74",
            "twitter": "@desmax74",
            "facebook": ""
        },
        {
            "id": 297,
            "name": "Enrico",
            "surname": "Risa",
            "biography": "Software engineer, Early adopter, open source enthusiast and music lover always looking for new technology.",
            "role": "Senior Developer",
            "company": "OrientDB",
            "community": "raspberryjamroma",
            "website": "",
            "github": "https:\/\/github.com\/maggiolo00",
            "twitter": "@wolf4ood",
            "facebook": ""
        },
        {
            "id": 310,
            "name": "Mario",
            "surname": "Cartia",
            "biography": "I was born in Siracusa 38 years ago. I studied Computer Science at University of Catania and achieved a diploma of specialization in \"Computer security and digital forensic\" at the University of Teramo. I'm a Red Hat Certified Professional too. Actually employed as CTO at Argo Software, leading company in Italy in the software industry for the school of any level. Over 15 years of experience as a trainer in Italian and multinational IT companies. In the last five years I have dedicated myself to training and consultancy in the field of Big Data.",
            "role": "CTO",
            "company": "Argo Software",
            "community": "JUG Sicilia, LUG Siracusa",
            "website": "http:\/\/www.argosoft.it",
            "github": "",
            "twitter": "@mariocartia",
            "facebook": ""
        },
        {
            "id": 324,
            "name": "Alberto",
            "surname": "Brandolini",
            "biography": "Developer, thinker, storyteller, large-scale facilitator, entrepreneur.\r\nContinuously looking for a problem worth solving.\r\nInventor of EventStorming.\r\nFounder at Avanscoperta.",
            "role": "Pragmatic Visionary",
            "company": "Avanscoperta",
            "community": "DDD-IT, Stoos, Stoos Italian Satellite, LimitedWiPSociety, XP-IT, DDD\/CQRS,",
            "website": "http:\/\/ziobrando.blogspot.com",
            "github": "https:\/\/github.com\/ziobrando\/",
            "twitter": "@ziobrando",
            "facebook": ""
        },
        {
            "id": 338,
            "name": "Felipe",
            "surname": "Hoffa",
            "biography": "In 2011 Felipe Hoffa moved from Chile to San Francisco to join Google as a Software Engineer. Since 2013 he's been a Developer Advocate on big data - to inspire developers around the world to leverage the Google Cloud Platform tools to analyze and understand their data in ways they could never before. You can find him in several YouTube videos, blog posts, and conferences around the world.",
            "role": "Developer Advocate",
            "company": "Google",
            "community": "",
            "website": "http:\/\/medium.com\/@hoffa\/",
            "github": "",
            "twitter": "felipehoffa",
            "facebook": ""
        },
        {
            "id": 349,
            "name": "Giorgio",
            "surname": "Di Nardo",
            "biography": "Giorgio Di Nardo è Project Manager e Software Architect presso Proge-Software.\r\nCome developer e architect prima, project manager e scrum master poi, da più di 25 anni si occupa di sviluppo di applicativi gestionali e di ciclo di vita del software su piattaforme Microsoft.\r\nÈ cofondatore della community DomusDotNet e speaker ad eventi tecnici quali DotNetCampus e Community Days sui due temi che più lo appassionano: lo sviluppo di Rich Client Application e l’Application Lifecycle Management.",
            "role": "Software Architect",
            "company": "Proge-Software",
            "community": "DomusDotNet",
            "website": "http:\/\/blogs.ugidotnet.org\/akelitz\/",
            "github": "",
            "twitter": "@akelitz",
            "facebook": ""
        },
        {
            "id": 359,
            "name": "Matteo",
            "surname": "Valoriani",
            "biography": "Matteo Valoriani worked for two years at Microsoft Italy, but in 2012 he decided to follow his passion for technology and innovation and started a PhD in Computer Science focused on new unconventional technologies and paradigms of interaction. Matteo is recognized as Microsoft Most Valuable Professional for Windows Dev\/ Emerging Experiences and he is awarded as Intel Software Innovator for Game Dev and RealSense skills. Since 2014 he founded and lead FifthIngenium, a high-tech company that develops and distributes solution based on Mobile, Cloud and Emerging Experiences.",
            "role": "CEO",
            "company": "FifthIngeniunm",
            "community": "DotNetLombardia, MVP, MSP",
            "website": "http:\/\/www.fifthingenium.com\/",
            "github": "https:\/\/github.com\/mvaloriani",
            "twitter": "@MatteoValoriani",
            "facebook": ""
        },
        {
            "id": 385,
            "name": "Carlo",
            "surname": "Bonamico",
            "biography": "Carlo’s passion for Software began with a C128, then grew with Linux, Java\/JavaScript, web & enterprise apps, and now cloud & security. After a PhD and research experience at the University of Genova and the CNIT National TLC Research Consortium, and an exciting time at startup Eptamedia, he’s now a Solution Architect and Senior Trainer at NIS s.r.l.. His personal communication style as an architect and trainer, both technically precise and able to present in an engaging way complex topics to an heterogeneous audience has been appreciated online and at many events from Devoxx to Codemotion.",
            "role": "Solution Architect",
            "company": "NIS s.r.l.",
            "community": "JUG Genova",
            "website": "http:\/\/www.carlobonamico.com",
            "github": "https:\/\/github.com\/carlobonamico",
            "twitter": "@carlobonamico",
            "facebook": ""
        },
        {
            "id": 388,
            "name": "Diego Mauricio",
            "surname": "Lagos Morales",
            "biography": "Appasionato di Tecnologie, mi sono sempre interessato di informatica e di gestione del software, fino a farlo diventare una mia passione prima che un lavoro.\r\nAvendo la possibilità di vedere a 360° lo sviluppo e la gestione del lavoro, passando da analista, sviluppatore, tester e adesso devops\/Release management.\r\n\r\nPartecipo attivamente con il gruppo Code Garden Roma.",
            "role": "Devops",
            "company": "Proxima Informatica",
            "community": "Code Garden Roma",
            "website": "http:\/\/diegoitaliait.wordpress.com\/",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 391,
            "name": "Alfredo",
            "surname": "Morresi",
            "biography": "79ers, nature and technology lover, supporter of open-source philosophy and footings along the beach. Maieutic and social oriented, passionate about evolutions of mobile world. Best dishes: community, code and Tiramisu’. Desires? A couple of additional hours of sleep every day.",
            "role": "Developer Relations",
            "company": "Google",
            "community": "",
            "website": "http:\/\/www.rainbowbreeze.it",
            "github": "",
            "twitter": "@rainbowbreeze",
            "facebook": "https:\/\/www.facebook.com\/alfredo.morresi"
        },
        {
            "id": 404,
            "name": "Lorenzo",
            "surname": "Barbieri",
            "biography": "Lorenzo Barbieri is a Cloud Solution Architect based in Milan, Italy.\r\nHe specializes in Cloud Application Development, both Azure and Office 365, Windows applications, Visual Studio, ALM and DevOps, and he likes to talk with people and communities about technology, food and funny things.\r\nHe is a speaker, a trainer and a public speaking coach. He helped many MSPs, devs and colleagues, improving their stage presence, to deliver great presentations.\r\nHe works for Microsoft Western Europe, in the PDU Alps division, helping partners, developers, communities and customers with software development",
            "role": "Cloud Solution Architect",
            "company": "Microsoft Western Europe",
            "community": "UgiDotNet, DotNetLombardia, DomusDotNet, DotDotNet, XeDotNet, DotNetMarche, DotNetToscana, DotNetLiguria, DotNetSide, OrangeDotNet, DotNetCampania",
            "website": "http:\/\/www.geniodelmale.info",
            "github": "",
            "twitter": "@_geniodelmale",
            "facebook": ""
        },
        {
            "id": 460,
            "name": "Nicola",
            "surname": "Iarocci",
            "biography": "Nicola is a passionate Python and C# developer based in Ravenna, Italy. He is the co-founder of CIR2K where leads the development of Amica 10, an accounting software solution for small business. He is the creator and maintainer of a few open source projects like the Eve REST API Framework. Nicola is also Microsoft MVP and MongoDB Master, runs his hometown CoderDojo coding club for kids and enjoys speaking at conferences.",
            "role": "Co-Founder and Lead Developer",
            "company": "CIR2000",
            "community": "MongoDB Masters, CoderDojo, Microsoft MVP, EuroPython, PyCon",
            "website": "http:\/\/nicolaiarocci.com",
            "github": "https:\/\/github.com\/nicolaiarocci",
            "twitter": "@nicolaiarocci",
            "facebook": ""
        },
        {
            "id": 525,
            "name": "Giorgio",
            "surname": "Natili",
            "biography": "On paper, Giorgio Natili is an engineering lead at Akamai Technologies where he spearheads the implementation of the new web apps for the security products line of Akamai and leads the development of a mobile SDK.\r\nOn the job, Giorgio is a strong proponent of agile development practices whose passion for usable, maintainable and testable code is only surpassed by his determination to make things work. \r\nHis previous speaking engagements include Adobe Max, 360|Flex, FITC, Mobile Web Dev Conference, Mobile Tea, etc.",
            "role": "Engineering Lead",
            "company": "Akamai Technologies",
            "community": "CodeInvaders",
            "website": "",
            "github": "",
            "twitter": "@giorgionatili",
            "facebook": ""
        },
        {
            "id": 599,
            "name": "Maurizio",
            "surname": "Mangione",
            "biography": "Maurizio, better known as Granze on the internet, has always been fascinated by computers: his first love was a Commodore 64.\r\n\r\nHe's never afraid to try the \"new thing\" and use it as soon as he can, for this reason, he fell in love with the idea of Web Components and has been using Polymer since the very beginning.\r\n\r\nMaurizio is a Google Developers Expert for web technologies with the specialization on Polymer.\r\n\r\nHe founded Milano JS, probably the most influential Javascript community in Italy and JS Girls, an international event to promote girls participation in the programming world.",
            "role": "Manager",
            "company": "Accenture",
            "community": "Milano JS",
            "website": "http:\/\/granze.net",
            "github": "https:\/\/github.com\/Granze",
            "twitter": "@granze",
            "facebook": "http:\/\/facebook.com\/granze"
        },
        {
            "id": 679,
            "name": "Juliette",
            "surname": "Reinders Folmer",
            "biography": "Juliette Reinders Folmer is an all round consultant and web-developer who tries not be a geek.\r\nJuliette is a long-standing member of PHPWomen which helped her immensely to find her feet in the PHP world. She is ZCE, actively contributes to a number of open source projects, has published several articles and speaks at conferences when given the chance.\r\nShe loves it when you give her a chance to refactor spaghetti-code to something elegant and maintainable.\r\n\r\nJuliette is self-employed and based in the Netherlands.",
            "role": "Owner, Business Consultant, IT do-it-all",
            "company": "Advies en zo",
            "community": "PHPWomen, Girls in Tech, various usergroups",
            "website": "http:\/\/diversitymatters.it\/",
            "github": "https:\/\/github.com\/jrfnl",
            "twitter": "@jrf_nl",
            "facebook": ""
        },
        {
            "id": 774,
            "name": "Andrea",
            "surname": "Ferlito",
            "biography": "ICT professional with over 15 years experience in software design and development and project management. His insane passion for videogames brought him to be well known throght the italian and international game developer communities. In the last years he has been trying to create a link between italian game developers and investors, organizing dedicated events as barcamps and the local venues for the most important international game jams like Global Game Jam and Indie Speed Run. He is CTO and Game Developer Area manager of Codemotion and advisor at LUISS Enlabs.",
            "role": "CTO",
            "company": "Codemotion",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@andreaferlito",
            "facebook": ""
        },
        {
            "id": 889,
            "name": "Ferdinando",
            "surname": "Gorga",
            "biography": "Software Engineering Specialist- Technical Sales Representative - Courses teacher for customers and Universities - IBM Mobile First and IBM Bluemix solution architect\r\nEvangelist for IBM Mobile First solutions and IBM Bluemix cloud solutions.\r\nWith culture and eclectic personality, he is interested in high tech, electronics, computer science, mathematics, science and literature.\r\nHe works with energy in team and is able to manage complex situations.\r\nHe is writer and speaker in conferences and seminars in the university context.\r\nHe likes traveling, motorbikes, sailboats, sports and nature in gen",
            "role": "Bluemix Cloud solution Architect",
            "company": "IBM",
            "community": "https:\/\/www.facebook.com\/groups\/ibmbluemixitalia",
            "website": "www.ibm.com\/it",
            "github": "https:\/\/github.com\/l2fprod",
            "twitter": "@fergor",
            "facebook": ""
        },
        {
            "id": 923,
            "name": "Vitalij",
            "surname": "Zadneprovskij",
            "biography": "Always been interested to computer science and programming, focusing both on concrete and abstract problems. Java software developer, mainly on back end side. I love learning new things every day both from colleagues and practical experience, and sharing with others what I learn.",
            "role": "Java developer and teacher",
            "company": "Freelance",
            "community": "Code Garden Roma, JUG Roma, Haskell ITA",
            "website": "",
            "github": "https:\/\/github.com\/vitalijzad",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 967,
            "name": "Luca",
            "surname": "Lanziani",
            "biography": "Software engineer,  developer, linux addict, hacker as http:\/\/bit.ly\/hacker_def , passionate traveler, InnovAction Lab alumnus",
            "role": "Software Engineer",
            "company": "nearForm",
            "community": "",
            "website": "https:\/\/lanziani.com",
            "github": "https:\/\/github.com\/Nss",
            "twitter": "@_Nss_",
            "facebook": ""
        },
        {
            "id": 997,
            "name": "Eugenio",
            "surname": "Petullà",
            "biography": "Eugenio Petullà is a Full Stack Developer and Mozilla Tech Speaker interested in sharing knowledge about open source and emerging technologies. During last year he was invited to speak about WordPress, web technologies and Open source developing at some of the biggest conferences across Europe.",
            "role": "Tech speaker",
            "company": "Mozilla",
            "community": "Mozilla, WordPress",
            "website": "",
            "github": "",
            "twitter": "@i_Genius",
            "facebook": ""
        },
        {
            "id": 1057,
            "name": "Andrew",
            "surname": "Rota",
            "biography": "Senior software engineer and architect specializing in front-end UI architecture for large-scale web applications. Contributor to the open source web UI framework, Tungsten.js, and an occasional speaker at technology conferences and user groups.  Currently a software engineer on the JavaScript Platform Team at Wayfair in Boston, MA.",
            "role": "Software Engineer",
            "company": "Wayfair",
            "community": "",
            "website": "",
            "github": "https:\/\/github.com\/andrewrota",
            "twitter": "@andrewrota",
            "facebook": ""
        },
        {
            "id": 1101,
            "name": "Philipp",
            "surname": "Krenn",
            "biography": "Philipp is part of the infrastructure team and a Developer Advocate at Elastic, spreading the love and knowledge of full-text search, analytics, and real-time data. He is a frequent speaker at conferences and meetups about all things search & analytics, databases, cloud computing, and devops. Philipp lives in Vienna where he enjoys experimenting with software, organizing meetups, and sports.",
            "role": "Infrastructure | Developer Advocate",
            "company": "Elastic",
            "community": "meetup.com",
            "website": "https:\/\/xeraa.net",
            "github": "https:\/\/github.com\/xeraa\/",
            "twitter": "@xeraa",
            "facebook": ""
        },
        {
            "id": 1104,
            "name": "Maurice",
            "surname": "de Beijer",
            "biography": "Maurice de Beijer is an independent software consultant and trainer specializing in HTML5, REST, JavaScript, AngularJS and ASP.NET MVC. For DevelopMentor he currently teaches Essential and Advanced AngularJS, Essential HTML5, Essential jQuery, Modern Web Development and Essential ASP.NET MVC courses. He has been awarded the yearly Microsoft Most Valuable Professional award since 2005. Maurice is also very active in the Dutch dotNed user group where he regularly organizes meetings and the dotNed-Pluralsight study group meetings.",
            "role": "Software Engineer",
            "company": "ABL - The Problem Solver",
            "community": "DotNed, DevelopMentor",
            "website": "http:\/\/theproblemsolver.nl\/",
            "github": "https:\/\/github.com\/mauricedb",
            "twitter": "@MauriceDB",
            "facebook": "https:\/\/www.facebook.com\/mauricedb"
        },
        {
            "id": 1121,
            "name": "Gabriele",
            "surname": "Provinciali",
            "biography": "Gabriele Provinciali is a Digital Architect in Oracle Italia, and currently working as Technology Advisor in Oracle enterprise accounts, with a specialization on Service Oriented Architectures, Mobile Computing, User Interaction technologies (Portals) and Big Data technologies. Provinciali has a long and proficient experience in the Telco Sector (Ericsson, British Telecom, and Marconi Communications) and in the Information Technology area (Sun, EMC, Silverstream, IONA, BEA, CA, Oracle), focused on the architecture, design and implementation of enterprise software solutions.",
            "role": "Digital Architect",
            "company": "Oracle",
            "community": "",
            "website": "www.provinciali.com",
            "github": "",
            "twitter": "@GabbaPro",
            "facebook": ""
        },
        {
            "id": 1148,
            "name": "Sonia",
            "surname": "Pini",
            "biography": "Sonia Pini, (born March 25, 1976)  is owner of Pini Solutions since 2008. In 2003 she took the degree in Computer Science at the University of Genova with a dissertation on 'Ubiquity and automation role in modern hospital'. In 2007 she received a PhD in Computer Science at the University of Genova with a dissertation on 'Blueprint: A High-Level Pattern Based AOP Language'.",
            "role": "Developer",
            "company": "NIS s.r.l.",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@sonietta",
            "facebook": ""
        },
        {
            "id": 1178,
            "name": "Marco",
            "surname": "Giammetti",
            "biography": "Illustrator, cartoonist, web developer and game designer. More than 20 years of experiences as web designer, creator of many Videogame online content from ‘98.\r\n\r\nIn 2004 creates Beavers.it, one of the first webcomic on the videogame industry in Italy. 2007 is the first year of his collaboration with the web agency Neikos, where he soon became the Lead Designer of all the team. He is often invited as speaker to conference and workshop to talk about his experience as comic authors and game developer. Actually working for his own games. Loves VR.",
            "role": "Co-Founder",
            "company": "Hypothermic Games",
            "community": "",
            "website": "www.beavers.it",
            "github": "",
            "twitter": "@thetmo",
            "facebook": "https:\/\/www.facebook.com\/theTMO"
        },
        {
            "id": 1263,
            "name": "John",
            "surname": "Stevenson",
            "biography": "Speaker, author, conference organiser & community obsessed developer - loves Clojure, Emacs, Cats, Cycling & Agile development. @Heroku @SalesforceDevs",
            "role": "Developer Evangelist",
            "company": "Salesforce",
            "community": "London Clojurians, London Java Community, London Salesforce Developers, Graduate Developer Community",
            "website": "http:\/\/jr0cket.co.uk",
            "github": "https:\/\/github.com\/jr0cket",
            "twitter": "@jr0cket",
            "facebook": "https:\/\/www.facebook.com\/JohnStevenson247"
        },
        {
            "id": 1281,
            "name": "Marcos",
            "surname": "Placona",
            "biography": "Marcos Placona is a developer evangelist at Twilio, a company founded to disrupt telecommunications.\r\n\r\nHe spends most of his time working with Java and .Net open source projects while equipping and inspiring developers to build killer applications. He’s also a great API enthusiast and believes they bring peace to the Software Engineering world.",
            "role": "Developer Evangelist",
            "company": "Twilio",
            "community": "All UK .Net & API communities and a few of the Berlin communities about API's.",
            "website": "http:\/\/www.placona.co.uk",
            "github": "https:\/\/github.com\/mplacona",
            "twitter": "@marcos_placona",
            "facebook": ""
        },
        {
            "id": 1330,
            "name": "Erica",
            "surname": "Stanley",
            "biography": "Erica is a software engineer, researcher and tinkerer. She holds a B.S and M.S in Computer Science from Clark Atlanta University where she conducted research in virtual reality and 3D data modeling. She has also conducted post-graduate research at the University of North Carolina at Chapel Hill. There, she specialized in graphics, data visualization and telepresence. Always eager to explore emerging technologies, Erica has worked with various technologies at the heart of telepresence for over 15 years, including mixed reality, computer vision, IoT and mobile development.",
            "role": "Founder, Director",
            "company": "Women Who Code Atlanta",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@ericastanley",
            "facebook": ""
        },
        {
            "id": 1341,
            "name": "Agnieszka",
            "surname": "Naplocha",
            "biography": "Currently I work @ Adobe, where I have an awesome opportunity to combine both Visual Designer & Front-end Developer roles. What fascinates me in the IT world are apparently not computers, but people! ;-) Sharing experiences (even failures) with others brings a lot of energy, motivation and enthusiasm to my work. This is why together with my friend we created The Awwwesomes http:\/\/theawwwesomes.org. We're currently organizing free HTML&CSS workshops for beginners in Warsaw which is super fun!",
            "role": "Visual Designer & Front-end Developer",
            "company": "Adobe",
            "community": "The Awwwesomes (http:\/\/theawwwesomes.org)",
            "website": "http:\/\/aganaplocha.com\/",
            "github": "",
            "twitter": "@aganaplocha",
            "facebook": ""
        },
        {
            "id": 1350,
            "name": "Lorenzo",
            "surname": "Fontana",
            "biography": "Lorenzo is a Software Engineer with experience in system programming and DevOps.",
            "role": "DevOps Expert",
            "company": "Kiratech",
            "community": "pug milano, devops milano, ansible milano",
            "website": "http:\/\/fntlnz.wtf",
            "github": "https:\/\/github.com\/fntlnz",
            "twitter": "@fntlnz",
            "facebook": ""
        },
        {
            "id": 1390,
            "name": "Tugdual",
            "surname": "Grall",
            "biography": "Tugdual Grall is a Technical Evangelist at MapR, an open source advocate and a passionate developer. He currently works with the European developer communities to ease MapR, Hadoop and NoSQL adoption.\r\n\r\nBefore joining MapR, Tug was Technical Evangelist at MongoDB and Couchbase.  Tug has also worked as CTO at eXo Plaform and JavaEE product manager, and software engineer at Oracle.\r\n\r\nTugdual is Co-Founder of the Nantes JUG (Java User Group) that holds since 2008 monthly meeting about Java ecosystem. Tugdual also writes a blog available at http:\/\/tgrall.github.io",
            "role": "Technical Evangelist",
            "company": "MapR Technologies",
            "community": "co-founder of NantesJUG",
            "website": "http:\/\/tgrall.github.io",
            "github": "http:\/\/github.com\/tgrall\/",
            "twitter": "@tgrall",
            "facebook": "https:\/\/www.facebook.com\/tgrall"
        },
        {
            "id": 1405,
            "name": "michele",
            "surname": "franzin",
            "biography": "Software Engineer, folgorato in gioventù da uno ZX-Spectrum vive in bilico tra il presente Ruby e un passato Java Enterprise.\r\nLavora come Lead Developer ed Architetto in SeeSaw una giovane software house italiana. \r\nPassionario della formazione non perde occasione per condividere le sue esperienze.\r\nNel tempo libero, quando non è impegnato ad inclinare la moto in curva, ama rilassarsi facendo foto e arrampicando montagne.\r\n\r\nPer tutto il resto c'è https:\/\/www.linkedin.com\/in\/michelefranzin",
            "role": "Director & CTO",
            "company": "SeeSaw s.r.l.",
            "community": "Programmers in padua, ruby-it, jug padova",
            "website": "www.seesaw.it",
            "github": "https:\/\/github.com\/fuzziness",
            "twitter": "@realfuzzy",
            "facebook": ""
        },
        {
            "id": 1467,
            "name": "Jan Carsten",
            "surname": "Lohmuller",
            "biography": "Jan Carsten is a software developer, coffee enthusiast and bearded man. Since doing his studies at university of Bonn and university of Hamburg he has been actively working in the software industry, utilizing various technologies. He has been involved in both start-ups as well as established global organizations and research. Jan is currently working in the software consultancy business with emphasis on C#, Java, architecture and security, functional programming and software craftsmanship.",
            "role": "Software Developer",
            "company": "Workplace Solutions GmbH",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@nachkonvention",
            "facebook": ""
        },
        {
            "id": 1468,
            "name": "Lea",
            "surname": "Böhm",
            "biography": "Lea has studied economics, politics and sociology and has worked several years in finance and operations until she realized that people are much more interesting than numbers. Consequently she switched to people management in 2012 and became an expert for topics such as leadership, internal communication, motivation, team building and development. She holds a degree in coaching and mediation, and is the CEO & founder of AllesRoger - the new work agency for leadership.",
            "role": "CEO",
            "company": "AllesRoger UG (haftungsbeschränkt)",
            "community": "",
            "website": "www.allesroger.io",
            "github": "",
            "twitter": "@alleslea",
            "facebook": ""
        },
        {
            "id": 1530,
            "name": "Michele",
            "surname": "Orsi",
            "biography": "I am a software engineer that is really passionated about the job and is continuously working and studying to improve skills and knowledge.\r\nI founded a company with 2 friends that was sold this year in February 2015 to lastminute.com group.\r\nBefore I was in Germany at European Space Agency, where I helped brilliant guys to flight satellites.\r\n\r\nAt the moment I am in London as a Software Architect in lastminute.com group.",
            "role": "Software architect",
            "company": "lastminute.com group",
            "community": "XPUG Milano",
            "website": "",
            "github": "https:\/\/github.com\/micheleorsi",
            "twitter": "@micheleorsi",
            "facebook": ""
        },
        {
            "id": 1551,
            "name": "Christiane",
            "surname": "Goebels",
            "biography": "Christiane Goebels has been in web development for more than 12 years. She has started her career at SAP, led her own internet agency from 2005 through 2010 and returned to SAP as Senior Developer for the JavaScript Framework  SAPUI5\/OpenUI5 in 2012, where she has been one of the drivers behind open sourcing the framework. Her book on SAPUI5 was recently published by Rheinwerk Publishing, Inc \/ SAP Press.",
            "role": "Senior Developer GRC Fiori Applications",
            "company": "SAP SE",
            "community": "",
            "website": "",
            "github": "https:\/\/github.com\/christianekurz",
            "twitter": "@learnui5",
            "facebook": ""
        },
        {
            "id": 1611,
            "name": "Domenico",
            "surname": "Maracci",
            "biography": "A background as System Integration Consultant and Solution Architect, covering all the application delivery process, from the development stage to the test and roll-out in production of innovative solutions, in different industries (Telco, Automotive, Resources, H&PS) and technologies (Middleware, Mobile App, Portals).\r\nToday is a Principal Presales Consultant and DevOps evangelist, supporting and promoting the DevOps and Continuous Delivery adoption for customers and partners.",
            "role": "Principal Presales Consultant, DevOps",
            "company": "CA Technologies",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 1614,
            "name": "Stefano",
            "surname": "Sali",
            "biography": "More than 15 years of experience in the information security, working with success at most of the biggest Italian company for Identity and Access Management projects.\r\nMy actual job role, Senior Principal Security Consultant for CA Technologies, includes technical presales activities as trusted advisory for large enterprise customers (across banking, telecom and other sectors) and partners, with main focus on solutions areas: IMAG, SSO, Advanced Authentication, API Management and Privileged Access Management.",
            "role": "Senior Principal Consultant Security",
            "company": "CA Technologies",
            "community": "CISSP, ISACA",
            "website": "",
            "github": "",
            "twitter": "@stefanosali",
            "facebook": ""
        },
        {
            "id": 1654,
            "name": "Rossella",
            "surname": "De Gaetano",
            "biography": "Joined IBM immediately after college as software developer. A few years of experience as designer and developer of product installers using native technologies on Linux, Windows, AIX, Sun Solaris, HP-UX, SGI, z\/OS. Long experience in developing and designing client-server applications and web applications. Great ability in leading geographically distributed team covering the whole software lifecycle development: development, test, customer support .",
            "role": "Senior Technical Staff Member Cloud Platform",
            "company": "IBM",
            "community": "https:\/\/www.facebook.com\/groups\/ibmbluemixitalia",
            "website": "IBM.COM",
            "github": "",
            "twitter": "@DeGaRoss",
            "facebook": ""
        },
        {
            "id": 1673,
            "name": "Florin",
            "surname": "Patan",
            "biography": "I'm a gopher for a few years now and I've used to do various things from simple toy apps to writing a startup based on it. I'm one of the former organizer of GDG Berlin Golang and AWS Berlin User Group, spoken at a few conferences and I contribute various open-source projects.",
            "role": "Cloud Services Engineer",
            "company": "YouView TV Ltd.",
            "community": "GDG Berlin Golang,Go London User Group,AWS User Group UK,CoreOS London,Kubernetes London",
            "website": "https:\/\/florinpatan.ro",
            "github": "https:\/\/github.com\/dlsniper",
            "twitter": "@dlsniper",
            "facebook": ""
        },
        {
            "id": 1700,
            "name": "Roberto",
            "surname": "De Ioris",
            "biography": "Lead developer of the uWSGI, UnrealEnginePython, SpockFS, vpn-ws, Spoolgore, Ulver and many more open source projects. Passionate of C, python, perl, kernel-hacking and...videogames . Co-founder of Unbit and 20Tab, Programming and CG teacher at Accademia Italiana Videogiochi (AIV)",
            "role": "CTO",
            "company": "20Tab",
            "community": "python italia",
            "website": "http:\/\/20tab.com",
            "github": "https:\/\/github.com\/unbit",
            "twitter": "@unbit",
            "facebook": ""
        },
        {
            "id": 1711,
            "name": "Luigi",
            "surname": "Fugaro",
            "biography": "Bit enthusiast.",
            "role": "Senior Middleware Consultant",
            "company": "Red Hat",
            "community": "JBUG Roma, JUG Roma, vJUG",
            "website": "http:\/\/www.foogaro.com",
            "github": "",
            "twitter": "@foogaro",
            "facebook": ""
        },
        {
            "id": 1801,
            "name": "Simone",
            "surname": "Piunno",
            "biography": "15+ years developing innovative digital services in the mobile and web ecosystem.\r\nEarly adopter of many technologies started with coding in the 80s, created Linux and Internet communities in the 90s, pioneered mobile apps, online payments and digital advertising in the 00s.\r\nHis current passions are big data and machine learning.",
            "role": "Technology Director",
            "company": "Digital Transformation Team",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@spiunno",
            "facebook": ""
        },
        {
            "id": 1854,
            "name": "Andrea",
            "surname": "Reginato",
            "biography": "Entrepreneur & Full Stack Developer. Creator of Lelylan, Open Source Internet of Things platform, I explore different technologies and I love to (try to) make complex things simple. My knowledge moves between Microservices, Reusable UI Components, Software Testing, API Design & Documentation and Scrum. During my free time, when not listing a huge list of things I would love to do, I do dance and make theatre.",
            "role": "CEO",
            "company": "Lelylabs",
            "community": "ruby-it",
            "website": "http:\/\/lelylan.com",
            "github": "https:\/\/github.com\/lelylan",
            "twitter": "@andreareginato",
            "facebook": "https:\/\/www.facebook.com\/andrea.reginato"
        },
        {
            "id": 1862,
            "name": "Gabriele",
            "surname": "Santomaggio",
            "biography": "I started programming with the AMIGA 500! ah the good old days! \r\nI have more than 15 year of experience and middleware technologies are my passion.\r\nCurrently I work remotely for Erlang-Solutions ( London ) as RabbitMQ developer and consultant. \r\nI am RabbitMQ contributor on github and stackoverflow supporter. I am also co-author of \"RabbitMQ Cookbook\".",
            "role": "Developer",
            "company": "Erlang-Solutions",
            "community": "Bologna-XPUG",
            "website": "https:\/\/github.com\/Gsantomaggio",
            "github": "https:\/\/github.com\/Gsantomaggio",
            "twitter": "@gsantomaggio",
            "facebook": ""
        },
        {
            "id": 1970,
            "name": "Simone",
            "surname": "Cellini",
            "biography": "Sono laureato in Ingegneria Informatica mi interessa fortemente l'area riguardante le attività  di gestione, analisi, progettazione, sviluppo e manutenzione di progetti software, nella quale ho già  maturato una buona esperienza professionale. Lavoro da 8 anni presso NTTDATA Italia S.P.A. dove nei vari anni ho svolto le funzioni di Software Developer, Software Designer, Software Analyst, Tecnical Leader, Team Leader, Project Manager. Nel background personale è presente anche una esperienza di circa 3 anni presso l'ente I.N.F.N. dove ho svolto la funzione di System Engineer.",
            "role": "Project Leader",
            "company": "NTTDATA Italia S.P.A.",
            "community": "",
            "website": "http:\/\/simonecellini.altervista.org\/",
            "github": "",
            "twitter": "@simcellini",
            "facebook": ""
        },
        {
            "id": 1977,
            "name": "Eric D.",
            "surname": "Schabell",
            "biography": "Eric D. Schabell is the Red Hat Technology Evangelist (Integrated Solutions). He is responsible for various outbound technical aspects of promoting integrated Red Hat product solutions, has traveled the world speaking at conferences and is a published author. Follow at http:\/\/schabell.org.",
            "role": "Red Hat Technology Evangelist (Integrated Solutions)",
            "company": "Red Hat",
            "community": "JBoss jBPM, NLJUG, etc...",
            "website": "http:\/\/schabell.org",
            "github": "https:\/\/github.com\/eschabell",
            "twitter": "@ericschabell",
            "facebook": ""
        },
        {
            "id": 1985,
            "name": "Simone",
            "surname": "Gaddeo",
            "biography": "Mi sono laureato in scienze statistiche ma sono sempre stato un grande appassionato d'informatica.\r\nQuesta passione e' diventata un lavoro, infatti sono 14 anni che lavoro nel settore e da 12 anni sono dipendente NTTData.\r\nIn questi anni mi sono occupato della progettazione e realizzazione di soluzioni IT incentrate sulla connettività, realizzando servicebus, orchestration framework e  realtime application monitoring, passando nel tempo dal ruolo di developer fino al  technical leader.",
            "role": "Developer\/Architect",
            "company": "NTTData",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 1987,
            "name": "Fabio",
            "surname": "Corrirossi",
            "biography": "VR developer, scriptwriter and game developer.",
            "role": "Lead programmer",
            "company": "Oniride",
            "community": "",
            "website": "http:\/\/www.oniride.com",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 2013,
            "name": "Matteo",
            "surname": "Ronchi",
            "biography": "Matteo is passionate to all about web technologies. Developing interactive user interfaces for web and desktop since 2001 before using the Flash Platform and then using Javascript. Matteo loves the whole Javascript ecosystem and is involved in several projects both open source and not, he has mainly worked on Enterprise level projects as developer and software architect and last years has committed itself to teaching web technologies and to help the Italian front-end community to grow. Recently joined Workwave as senior engineer and team leader to work on the development of new products.",
            "role": "Senior Software Engineer",
            "company": "Workwave",
            "community": "angularjs italia (facebook and g+), react italia (facebook and g+), fevr verona",
            "website": "www.workwave.com",
            "github": "https:\/\/github.com\/cef62",
            "twitter": "@cef62",
            "facebook": ""
        },
        {
            "id": 2040,
            "name": "Demi",
            "surname": "Ben-Ari",
            "biography": "Co-Founder and VP R&D @ Panorays,\r\nDemi has over 10 years of experience in building various systems both from the field of near real time applications and Big Data distributed systems. \r\nCo-Founder of the “Big Things” Big Data community and Google Developer Group Cloud.\r\nA software development groupie, Interested in tackling cutting edge technologies.",
            "role": "VP R&D",
            "company": "Panorays",
            "community": "Big Things (Big Data Community),GDG Cloud",
            "website": "http:\/\/progexc.blogspot.co.il\/",
            "github": "https:\/\/github.com\/demibenari",
            "twitter": "@demibenari",
            "facebook": "https:\/\/www.facebook.com\/demi.benari"
        },
        {
            "id": 2062,
            "name": "Glynn",
            "surname": "Bird",
            "biography": "Glynn Bird worked in the steel industry researching and developing control and instrumentation systems before becoming  a web developer, creating CRM systems, search technology, automated-telephony and mobile apps for an internet business directory. Glynn is currently a Developer Advocate for IBM's Cloud Data Services team, with expertise in databases, microservices and cloud technology.",
            "role": "Developer Advocate",
            "company": "IBM",
            "community": "",
            "website": "www.ibm.com",
            "github": "",
            "twitter": "@glynn_bird",
            "facebook": ""
        },
        {
            "id": 2103,
            "name": "Daniël",
            "surname": "van Gils",
            "biography": "Daniël van Gils is a polyglot developer advocate at Cloud 66. He helps other polyglot developers craft ruby (on rails) web applications and container based microservice architectures with ♥. An accomplished creative technologist, Daniel has vast and varied experience in application development, agile workflows and building container technologies at scale, gained working in the web development, creative technologies and gaming industries. In his spare time he experiments with strawberries in his backyard, likes to surf and practices improvisation theater.",
            "role": "Developer Advocate",
            "company": "Cloud 66",
            "community": "ruby and docker communities in holland",
            "website": "http:\/\/www.cloud66.com",
            "github": "http:\/\/github.com\/cloud66",
            "twitter": "@foldingbeauty",
            "facebook": ""
        },
        {
            "id": 2120,
            "name": "PJ",
            "surname": "Hagerty",
            "biography": "Developer, writer, speaker, musician, and  and Developer Advocate at Logz.io, PJ is known to travel the world speaking about programming and the way people think and interact.  He is also known for wearing hats.",
            "role": "Developer Advocate",
            "company": "Logz.io",
            "community": "Ruby Community, PHP Community, Mental Health in Tech Community",
            "website": "http:\/\/iampj.xyz",
            "github": "https:\/\/github.com\/aspleenic",
            "twitter": "@aspleenic",
            "facebook": ""
        },
        {
            "id": 2123,
            "name": "Pier Paolo",
            "surname": "Orioli",
            "biography": "Working on the web since 2001, spent 10 years as a full stack web consultant spanning from network design to application development, currently I'm a Senior Design Technologist at frog specialised in web projects, form the architecture to the implementation.",
            "role": "Senior Design Technologist",
            "company": "frog",
            "community": "",
            "website": "",
            "github": "https:\/\/github.com\/porioli",
            "twitter": "@pier_dev",
            "facebook": ""
        },
        {
            "id": 2159,
            "name": "Luciano",
            "surname": "Mammino",
            "biography": "I am a Software Engineer born in 1987, the same year that the Nintendo released “Super Mario Bros” in Europe, which, by chance is my favourite game! My primary passion is code and I am extremely fascinated by the web, smart apps and everything that's creative like music, art and design. I started coding at the age of 12 using my father's old i386 provided only with DOS and the qBasic interpreter. I am a Senior Software Developer at Planet9  in Dublin Energy. I am the co-author of \"Node.js design patterns\" 2nd edition (Packt, http:\/\/amzn.to\/1ZF279B).",
            "role": "Senior Software Developer",
            "company": "Planet9 Energy",
            "community": "PHP Dublin, Node.js Dublin",
            "website": "http:\/\/loige.co",
            "github": "https:\/\/github.com\/lmammino",
            "twitter": "@loige",
            "facebook": ""
        },
        {
            "id": 2202,
            "name": "Vincenzo",
            "surname": "Chianese",
            "biography": "Vincenzo Chianese is an Italian full-stack developer with a particular love for front-end development. Currently, he works in Apiary as a bugs introducer, making sure that his coworkers have always something to fix.",
            "role": "Software developer",
            "company": "Apiary.io",
            "community": "",
            "website": "http:\/\/vncz.js.org",
            "github": "http:\/\/github.com\/XVincentX",
            "twitter": "@d3dvincent",
            "facebook": ""
        },
        {
            "id": 2373,
            "name": "Anna",
            "surname": "Migas",
            "biography": "Anna works as a Front-end Developer and Designer at Lunar Logic, the no management company based in Kraków, Poland. She is always trying to find ways to make people fall in love with coding (especially women, since they are a minority in the programming world). Anna has a long history of organizing coding workshops for WebMuses and Rails Girls and sometimes teaches advanced front-end techniques at other courses. In her spare time she practices Pilates, plays Hearthstone and reads scifi and fantasy books.",
            "role": "Front-end Developer\/Designer",
            "company": "Lunar Logic",
            "community": "WebMuses, Rails Girls",
            "website": "",
            "github": "https:\/\/github.com\/szynszyliszys",
            "twitter": "szynszyliszys",
            "facebook": ""
        },
        {
            "id": 2488,
            "name": "Mete",
            "surname": "Atamel",
            "biography": "I'm a Developer Advocate at Google, currently focused on helping developers with Google Cloud Platform. As a long-time Java and a recent C# developer, I like to compare the two ecosystems. Prior to Google, I worked at Microsoft, Skype, Adobe, EMC, and Nokia building apps and services on various web, mobile and cloud platforms. Originally from Cyprus, I currently live in Greenwich, not too far away from the prime meridian.",
            "role": "Developer Advocate",
            "company": "Google",
            "community": "",
            "website": "meteatamel.wordpress.com",
            "github": "https:\/\/github.com\/meteatamel",
            "twitter": "@meteatamel",
            "facebook": ""
        },
        {
            "id": 2491,
            "name": "Alessio",
            "surname": "Fattorini",
            "biography": "Linux Sysadmin and Support Specialist for 10 years at Nethesis, until about two years ago when I became the NethServer Community Manager ( Linux Server Distribution that makes sysadmin's life easier) thus I started to study everything related to communities and I have been deeply involved in community managers communities around the world. Community Leadership Summit and CLSxItaly co-organizer, I’m also a Certified Community Strategist mainly focused on product-based communities, working closely with developers and users.",
            "role": "Community Manager",
            "company": "NethServer",
            "community": "NethServer,Community Leadership Summit,CMXHub,Feverbee,Discourse",
            "website": "www.nethserver.org",
            "github": "",
            "twitter": "@ale_fattorini",
            "facebook": ""
        },
        {
            "id": 2503,
            "name": "JC",
            "surname": "van Winkel",
            "biography": "JC van Winkel has been with Google SRE for 5 years involving himself with production monitoring and education within SRE. Before joining Google, he has worked 6 years as a Software Engineer with KPMG and 21 years as an educator with a small spin-off of the University of Nijmegen (Netherlands), concentrating on courses around system administration and software engineering.",
            "role": "Site Reliability Engineer",
            "company": "Google",
            "community": "",
            "website": "www.google.com",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 2519,
            "name": "Antonio",
            "surname": "De Pasquale",
            "biography": "Antonio De Pasquale is a Senior Interaction Designer and information architect in Frog specializing in digital user experience. He believes that designing the interaction is the most important part in communication and is fascinated by how you can communicate through movement and gestures. He has worked on numerous digital projects ranging from the field of web-tv, e-commerce, healthcare, online newspapers, corporate website to mobile and tablet applications and he participated in teaching activities at SUPSI, IED and Politecnico di Milano.",
            "role": "Senior Interaction Designer",
            "company": "Frog Design",
            "community": "",
            "website": "www.frogdesign.com",
            "github": "",
            "twitter": "@myinteraction",
            "facebook": ""
        },
        {
            "id": 2522,
            "name": "Dave",
            "surname": "Lewis",
            "biography": "Dave Lewis has almost two decades of industry experience. He has extensive experience in IT operations and management. Currently, Lewis is a Global Security Advocate for Akamai Technologies. He is the founder of the security site Liquidmatrix Security Digest and cohost of the Liquidmatrix podcast. Lewis writes a column for CSO Online and Forbes.",
            "role": "Global Security Advocate",
            "company": "Akamai Technologies",
            "community": "",
            "website": "https:\/\/www.liquidmatrix.org\/blog\/",
            "github": "",
            "twitter": "@gattaca",
            "facebook": ""
        },
        {
            "id": 2538,
            "name": "Fabrizio",
            "surname": "Marini",
            "biography": ">20 years industry (K-Tech, Bea Systems, Oracle), 7 years senior management as entrepeneur in K-Tech (www.k-tech.it), 13 years experience selling\/building on-premise and cloud solutions.\r\n\r\nTrusted customer advisor with >20 years of experience in collaborating with clients, including engineering staff, line of business, and senior executives. \r\n\r\nJEE & Cloud Expert, Architect, Team Leader, Mentor, Teacher, Problem Solver, Developer, Blogger",
            "role": "Master Principal Sales Consultant",
            "company": "Oracle",
            "community": "MeetUP DevOps",
            "website": "http:\/\/www.fabriziomarini.com\/",
            "github": "",
            "twitter": "@MaleficoMarini",
            "facebook": "https:\/\/www.facebook.com\/biziomarini"
        },
        {
            "id": 2540,
            "name": "Daniele",
            "surname": "Esposti",
            "biography": "I'm a software developer working with Python, Javascript and Rust on Big Data projects and algorithms at Badoo. My background includes DevOps, backend and desktop applications (when desktop was cool :-) ) and I worked as a freelance, for medium companies, startups and big company like Badoo now. I believe that the real value of a developer is in his\/her capability of adapt, learn and evolve and not in which framework or library he\/she is a master.",
            "role": "Senior Software Developer",
            "company": "Badoo",
            "community": "",
            "website": "http:\/\/www.expobrain.net",
            "github": "https:\/\/github.com\/expobrain\/",
            "twitter": "@expobrain",
            "facebook": ""
        },
        {
            "id": 2557,
            "name": "Francis",
            "surname": "Bourre",
            "biography": "Bourre is software architect at Docler holding. He was CTO at periscope-creations.com whose clients include Ubisoft, EA Games, Michelin, Sony, Nintendo, Apple. He worked as senior developer for Candy Crush licence at king.com, made research and development for building persistent world platform at prizee.com, and contributed to many projects as a freelancer for big names industry. In parallel, he speaked to many conferences , worked on various projects such as game engines and open-source frameworks for application development. He's also known for his eclectism and his esthetic code approach.",
            "role": "Software Architect",
            "company": "Docler Holding",
            "community": "",
            "website": "",
            "github": "https:\/\/github.com\/DoclerLabs",
            "twitter": "@francisbourre",
            "facebook": ""
        },
        {
            "id": 2574,
            "name": "Tanay",
            "surname": "Pant",
            "biography": "Tanay Pant is an Indian author, hacker, developer and tech enthusiast. He is best known for his work on \"Building a Virtual Assistant for Raspberry Pi\" published by Apress and \"Learning Firefox OS Application Development\" published by Packt. He is also an official representative of Mozilla. He has been listed in the about:credits of the Firefox web browser for his contributions to the different open source projects of the Mozilla Foundation. He also writes for a number of websites like SitePoint and Tuts+ where he shares tips and tricks about web development.",
            "role": "Tech Speaker, Contributor",
            "company": "Mozilla Foundation",
            "community": "Mozilla India",
            "website": "http:\/\/tanaypant.com",
            "github": "https:\/\/github.com\/tanay1337",
            "twitter": "@tanay1337",
            "facebook": ""
        },
        {
            "id": 2585,
            "name": "Luca",
            "surname": "Relandini",
            "biography": "I’m a Solution Architect at Cisco, in a European team focused on Data Center, Automation and Cloud Computing. I work at IT and cloud projects using both Cisco's software\/hardware products, open source (Openstack, Docker) and 3rd party products.\r\n\r\nAfter a career as Enterprise Architect in the IT industry at large enterprises, system integrators and software vendors I learned that the human factor (i.e. organization and governance, as well as alignment between Business and IT Strategies, and a sound architectural design that never hurts) is more important than technology as a success factor",
            "role": "Solution Architect",
            "company": "Cisco Systems",
            "community": "Openstack User Group Italy, Cisco DevNet",
            "website": "http:\/\/lucarelandini.blogspot.com\/",
            "github": "",
            "twitter": "@lucarelandini",
            "facebook": ""
        },
        {
            "id": 2588,
            "name": "Stève",
            "surname": "Sfartz",
            "biography": "DevNet is Cisco's Developer Program.\r\nPart of my evangelism activity is to help Developers and ITPros differentiate and accelerate their business by leveraging CISCO APIs.\r\nYou're a startup, an enterprise or an ISV ? Feel free to ping me to discuss innovation and how to integrate CISCO APIs into your software. As a strong supporter of Web APIs, I have committed myself to teach dev communities WW how to consume and build APIs with various languages.\r\nREST APIs, Collaboration (Tropo, Cisco Spark), Cloud Services, golang\r\nFrance mostly and all around Europe.",
            "role": "API Evangelist",
            "company": "CISCO",
            "community": "devnet, REST, opensource, golang, javascript, nodejs",
            "website": "https:\/\/developer.cisco.com\/",
            "github": "",
            "twitter": "@SteveSfartz",
            "facebook": ""
        },
        {
            "id": 2610,
            "name": "Marco",
            "surname": "Ramilli",
            "biography": "Marco Ramilli, CTO and co-founder of Yoroi, is a computer scientist researcher with an intensive hacking background. With a PhD in Computer Science Security from the University of Bologna, Marco has been working with US Government (National Institute of Standards and Technology, Security Division) and University of California, Davis on new security paradigms, penetration testing methodologies and electronic voting systems' security and Malware. Marco decided to co-founding Yoroi believing in a human centric cyber defence approach which took him to build Yoroi Cyber Security Defence Center.",
            "role": "Founder",
            "company": "Yoroi",
            "community": "IEEE, ACM",
            "website": "http:\/\/www.marcoramilli.com",
            "github": "https:\/\/github.com\/marcoramilli",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 2664,
            "name": "Russ",
            "surname": "Olsen",
            "biography": "Russ started his career doing that other kind of engineering, the sort that involves motors, gears and getting dirty. Pretty rapidly the wonder of computer programming lured him away, which probably explains why most of his fingers are still intact. Since turning to coding, Russ has worked on everything from 3D design and image processing software to database query engines and workflow systems. Russ is the author of two programming books and a frequent conference speaker.",
            "role": "Vice President",
            "company": "Cognitect",
            "community": "",
            "website": "http:\/\/russolsen.com",
            "github": "https:\/\/github.com\/russolsen",
            "twitter": "@russolsen",
            "facebook": ""
        },
        {
            "id": 2709,
            "name": "Luca",
            "surname": "Congiu",
            "biography": "Senior Solution Developer Microsoft .Net, ASP.NET espert and DotNetCode community leader",
            "role": "Senior Solution Developer Microsoft .NET",
            "company": "Servizi Auto OnLine",
            "community": "DotNetCode",
            "website": "",
            "github": "",
            "twitter": "@congiuluc",
            "facebook": ""
        },
        {
            "id": 2710,
            "name": "Ronnie",
            "surname": "Chen",
            "biography": "Ronnie Chen builds and scales the core data pipelines at Slack. She is a recovering physicist and was a Sous Chef at a Michelin-starred restaurant in a previous life. She is an avid deep sea technical diver and rock climber who enjoys writing Scala at her day job.",
            "role": "Data Engineer",
            "company": "Slack",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "rondoftw",
            "facebook": ""
        },
        {
            "id": 2715,
            "name": "Matteo",
            "surname": "Manchi",
            "biography": "24 anni, laureato alla triennale in ingegneria informatica, fullstack developer, amante delle tecnologie open source. Community leader del gruppo RomaJS e direttore di una piccola società di consulenza, specializzata nell'ambito della comunicazione.",
            "role": "CEO",
            "company": "Impronta Advance",
            "community": "RomaJS, PUG Roma",
            "website": "",
            "github": "https:\/\/github.com\/takeno",
            "twitter": "@matteomanchi",
            "facebook": "https:\/\/www.facebook.com\/matteo.manchi"
        },
        {
            "id": 2735,
            "name": "Lorenzo",
            "surname": "Cavallaro",
            "biography": "Lorenzo \"Gigi Sullivan\" Cavallaro was raised in a fantastic epoch where knowledge was just\r\nfor those curious enough. He grew up on pizza, Phrack, and W. Richard Stevens'\r\nmasterpieces. He is now an Associate Professor in the Information Security Group at Royal\r\nHolloway, University of London, focusing on systems security research. PI in a number of\r\nprojects, he sits in TPC of and has published in well-established information security\r\nvenues. Lorenzo's Coursera MOOC counts 100,000+ students since 2013, which makes him\r\nshamelessly bragging on his pizza and Phrack heritage furthermore.",
            "role": "Associate Professor",
            "company": "Royal Holloway, University of London",
            "community": "",
            "website": "http:\/\/s2lab.isg.rhul.ac.uk",
            "github": "https:\/\/bitbucket.org\/lcavallaro\/",
            "twitter": "@lcavallaro",
            "facebook": ""
        },
        {
            "id": 2759,
            "name": "Luca",
            "surname": "Di Bari",
            "biography": "Ha lavorato come Security Consultant presso differenti realtà di tipo enterprise sia in veste di system integrator che come security analyst. Negli ultimi anni ha svolto un ruolo di consulente strategico presso alcune Pubbliche Amministrazioni Centrali, in particolare la Corte dei conti, supportandole su tematiche di ICT Security e Cyber Security sia sul fronte tecnologico che come coordinatore dei gruppi operativi di sicurezza e incident response.”",
            "role": "Security Manager",
            "company": "Sogei SpA",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 2847,
            "name": "Danilo",
            "surname": "Poccia",
            "biography": "Danilo is author of AWS Lambda in Action from Manning. As Technical Evangelist at Amazon Web Services, he works with startups and companies of any size to bring their ideas to life, focusing on technical and business impact of mobile and data analytics. He is passioned about IoT and machine learning: they are going to change the way we live in the next (few?) years.",
            "role": "Technical Evangelist",
            "company": "Amazon Web Services",
            "community": "AWS User Groups, Serverless Meetups",
            "website": "https:\/\/eventdrivenapps.com",
            "github": "https:\/\/github.com\/danilop",
            "twitter": "@danilop",
            "facebook": ""
        },
        {
            "id": 2898,
            "name": "Barbara",
            "surname": "Ondrisek",
            "biography": "Dr. Barbara Ondrisek, aka \"Bot Mother\", is an enthusiastic software developer with 15+ years of experience. She worked mostly as a freelancer at web projects (lately George \/ Erste Bank) or on building apps. With Mica, the Hipster Cat Bot, a chatbot that helps you discover hip places, she created one of the first chatbots on the Facebook Messenger platform worldwide - Mica was the very first bot on Messenger and Skype in Austria, which led to a listing as testimonial in the official Skype FAQs. Together with other experts on their field she found the Chatbots Agency.",
            "role": "Founder & CEO",
            "company": "Chatbots Agency",
            "community": "Lemmings.io",
            "website": "https:\/\/chatbotsagency.com",
            "github": "https:\/\/github.com\/electrobabe",
            "twitter": "@electrobabe",
            "facebook": "https:\/\/facebook.com\/electrobabe"
        },
        {
            "id": 2904,
            "name": "Nicole",
            "surname": "Forsgren",
            "biography": "Dr. Nicole Forsgren is an IT impacts expert who is best known as the lead investigator on the State of DevOps Reports. She is a consultant, expert, and researcher in knowledge management, IT adoption and impacts, and DevOps. Nicole is the CEO & Chief Scientist at DevOps Research and Assessment (DORA). In a previous life, she was a professor, sysadmin, and hardware performance analyst. Her work has been featured in various media outlets and several peer-reviewed journals and conferences. She holds a PhD in MIS and a Masters in Accounting.",
            "role": "CEO and Chief Scientist",
            "company": "DORA",
            "community": "Seattle",
            "website": "nicolefv.com",
            "github": "",
            "twitter": "@nicolefv",
            "facebook": ""
        },
        {
            "id": 3013,
            "name": "Davide",
            "surname": "Pensato",
            "biography": "In 1999 Davide Pensato starts his career as in-house Audio DirectorSound Designer at Ubisoft Studios Milano. In a couple of years he is responsible of audio team. Both a creative and technical figure, he can create audio for a game as well as integrating it using software and hardware tools.\r\nIn January 2007 creates his own company (dpstudios) offering consulting and services for game audio. He develops web and multimedia projects too, as a new activity branch.",
            "role": "Audio Director",
            "company": "dpstudios",
            "community": "",
            "website": "www.dpstudios.it",
            "github": "",
            "twitter": "@dpstudios_milan",
            "facebook": "https:\/\/www.facebook.com\/dpstudios.milan\/"
        },
        {
            "id": 3050,
            "name": "Francesco",
            "surname": "Bonacci",
            "biography": "Francesco Bonacci is a graduate in Computer Engineering and a Junior Software Engineer specialized in Mobile Application Development. He is a Microsoft Student Partner at Polytechnic University of Turin and keeps events and sessions about Microsoft technologies and services. He is also a Xamarin Student Partner helping spread cross-platform mobile development and supporting developers in building their applications.",
            "role": "Microsoft Student Partner",
            "company": "Microsoft",
            "community": "",
            "website": "",
            "github": "https:\/\/github.com\/francedot",
            "twitter": "@francedot",
            "facebook": "https:\/\/www.facebook.com\/francibon"
        },
        {
            "id": 3064,
            "name": "Jose",
            "surname": "de Castro",
            "biography": "Jose de Castro is the CTO for APIs and Integrations within Cisco’s Collaboration Technology Group, leading the effort to open Cisco's Spark Collaboration Platform to any developer seeking to embed voice, video and text-based collaboration into their applications. He set the technical and strategic product direction, leading Tropo to a successful exit in 2015. A serial entrepreneur, Jose co-founded Tropo in 2009, a leading communications-as-a-service provider.  With a passion for education and healthcare, he hopes to drive real change in both industries.",
            "role": "CTO, APIs and Integrations",
            "company": "Cisco",
            "community": "",
            "website": "http:\/\/developer.ciscospark.com",
            "github": "",
            "twitter": "@loopingrage",
            "facebook": ""
        },
        {
            "id": 3098,
            "name": "Stephanie",
            "surname": "Rewis",
            "biography": "Stephanie is the principal developer, design systems at Salesforce, where she leads the team responsible for the CSS framework. Stephanie has been a frontend developer, passionate about web standards and accessibility, for over 17 years. She's worked with a wide spectrum of clients including Under Armour, Newsweek, MLB, NY Magazine, Adobe, Quiznos, Disney’s “TRON”, and a lively bunch of startups. She’s spoken at conferences including HOW Design Conference, UI16, An Event Apart, SxSW and Adobe MAX, among others. She’s also a published author and has written for numerous publications.",
            "role": "Principal Developer",
            "company": "Salesforce",
            "community": "",
            "website": "http:\/\/getslds.com",
            "github": "",
            "twitter": "@stefsull",
            "facebook": ""
        },
        {
            "id": 3105,
            "name": "James",
            "surname": "Lewis",
            "biography": "James works for ThoughtWorks where he spends his time as a coding architect. He rather likes the fact that he got to describe his take on things jointly with Martin Fowler in an article that is influencing how people see the future of software architecture. In short, he’s a bit of a loudmouth on architecture, programming, organisational design, lean product development and basically anything else that’ll improve the way he, and others, work. He also quite likes Lego, Warhammer 40K and working for ThoughtWorks.",
            "role": "Principal Consultant",
            "company": "ThoughtWorks",
            "community": "",
            "website": "http:\/\/bovon.org",
            "github": "",
            "twitter": "@boicy",
            "facebook": ""
        },
        {
            "id": 3107,
            "name": "Bruno",
            "surname": "Laurencich",
            "biography": "He’s an artist who found on programming and hardware development a way of expanding his expressive and technical capacities. He started out as a traditional animator and then made his way into computing through 3D animation and interactive art. \r\nHe worked on several audiovisual agencies, and now as a technology teacher for young people at Codemotion Kids and freelancer. Two years ago, he decided he needed a motion capture system for a performance, and seeing there was none available at a decent cost, decided to build one himself.",
            "role": "Multimedia Producer",
            "company": "elbajoatico",
            "community": "",
            "website": "http:\/\/elbajoatico.com",
            "github": "https:\/\/github.com\/daylanKifky",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3123,
            "name": "Fabio",
            "surname": "Suriano",
            "biography": "Fabio is mainly involved in the development of Graphics\/Engine programming techniques and solutions for games on PS4\/XOne\/PC. He’s also responsible for profile and tests the performance of a game through code profiling and optimisation. He provides solutions for the art team through development of well specific tools that will help the technical art team to express their full potential. He has worked on many AAA titles using proprietary 3D Engines and also on licensed Engines like Unreal Engine 4.",
            "role": "Senior Graphics\/Engine Programmer",
            "company": "Storm in a teacup",
            "community": "",
            "website": "www.stcware.com",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3125,
            "name": "Greg",
            "surname": "Rewis",
            "biography": "Greg has been passionate about the web since putting his first “home page” online in 1994. His career has taken him around the world – from the early days of desktop publishing, to a start-up in Hamburg, Germany, the glory days of the web at Macromedia and Adobe, Redhat and Apogee, and now as Lead Developer Evangelist at Salesforce",
            "role": "Developer Evangelist",
            "company": "Salesforce",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@garazi",
            "facebook": ""
        },
        {
            "id": 3131,
            "name": "Tiziano",
            "surname": "Bucci",
            "biography": "He studied CG Animation at the European Institute of Design (IED) placed in Rome and then he majored in 3D real-time graphics at the Gnomon School of Visual Effects of Los Angeles. He took his first steps with the project of Skywind in the European modding community by the time he started his career as a freelancer. He has taken the position of President and Lead 3D Artist at Invader Studios since July 2016.",
            "role": "President & Lead 3D Artist",
            "company": "Invader Studios S.r.l.",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3140,
            "name": "Daniele",
            "surname": "Mannarino",
            "biography": "Sono laureato in Ingegneria Informatica e mi occupo di progettazione, sviluppo di sistemi software, nella quale ho già  maturato una buona esperienza professionale. Lavoro da quasi 12 anni nel campo prima presso Etnoteam S.P.A. poi Valueteam S.P.A.  per approdare infine in NTTDATA Italia S.P.A. dove nei vari anni ho svolto le funzioni di Software Developer, Software Designer, Software Analyst, Tecnical Leader, Team Leader.",
            "role": "Senior Developer",
            "company": "NTT Data",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3146,
            "name": "Josh",
            "surname": "Reola",
            "biography": "Josh Reola is a Cisco Spark and Tropo API evangelist based in Austin, Texas.  He started in the telecommunications field working on R&D projects at Texas A&M University and Internet2 while having the opportunity to do research work with one of the founders of SIP, Henning Schulzrinne.  He was also the technical editor for the CCIE Version 3.0 Quick Reference Guide written by Mark Lewis.  When not reading SRND’s, Joshua enjoys traveling, salsa-merengue, two-stepping, volunteering and football.",
            "role": "Business Development Manager",
            "company": "Cisco",
            "community": "",
            "website": "ciscospark.com",
            "github": "",
            "twitter": "gqpinoy",
            "facebook": ""
        },
        {
            "id": 3151,
            "name": "Emanuela",
            "surname": "Dal Mas",
            "biography": "After a ten year experience as a business management consultant, I am now involved in business developement and strategy at Nephila. I am co-founder of Fuzzy Brains, no-profit Italian association which contributes actively to digital literacy with a particular focus on the Django platform and the Python programming language. I work actively for the inclusion of women in technology and business, especially through the Italian DjangoGirls chapter.",
            "role": "Organizer",
            "company": "DjangoGirls Italia",
            "community": "Django, DjangoGirls",
            "website": "http:\/\/nephila.it",
            "github": "",
            "twitter": "@EmanuelaDM",
            "facebook": ""
        },
        {
            "id": 3152,
            "name": "Iacopo",
            "surname": "Spalletti",
            "biography": "Founder\/CTO @NephilaIT - django CMS core developer - Passionate Django developer. When not coding, you can find me on the stool of the local pub.",
            "role": "Organizer",
            "company": "DjangoGirls Italia",
            "community": "Python, Django, DjangoGirls",
            "website": "https:\/\/www.nephila.it",
            "github": "https:\/\/github.com\/yakky",
            "twitter": "@yakkys",
            "facebook": ""
        },
        {
            "id": 3176,
            "name": "Aristide",
            "surname": "Di Francesco",
            "biography": "I am qualified in Electrotechnical, but my passion has always been IT and all that comes with it. Programming expert in .Net, Java, C \/ C ++ and other more or less known languages. I am also passionate about microcontrollers and IoT in general. I'm a senior developer with strong knowledge in mobile, as Android, Windows Phone and iOS. My App on Google Play have over 100k download. I am interested in all that is technology, science and astronomy in addition at the vast world of IT.",
            "role": "Developer",
            "company": "INDRA",
            "community": "Domusdotnet",
            "website": "",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3180,
            "name": "Matteo",
            "surname": "Favarelli",
            "biography": "Co-Founder and COO at AnotheReality, Matteo Favarelli is a serial enterpreneur with a passion for videogames and VR.\r\nGrown up spending more time in arcades than school, he began his journey on the arcade game industries when he was only 14 years old. Starting as a consultant for choosing which games import from Asia and analyze the game market in Italy he then became Italian champion of multiple arcade games (PIU, DDR, WCCF) and went in Korea and Japan for the world finals.\r\nNow he organize VR events, trade shows and fairs while exploring the new VR technology landscape.",
            "role": "Co-Founder & COO",
            "company": "AnotheReality",
            "community": "",
            "website": "https:\/\/www.anotherealityvr.com\/",
            "github": "",
            "twitter": "",
            "facebook": "https:\/\/www.facebook.com\/Teofava"
        },
        {
            "id": 3184,
            "name": "Andrea",
            "surname": "Ulisse",
            "biography": "7 years of experience in multinational and startup environments developing performant, scalable and available back-ends in cloud environments. Currently Solutions Engineer at Google with main focus on Cloud solutions for the enterprise world. Very passionate about technology and innovation. APIs lover.",
            "role": "Solutions Engineer",
            "company": "Google",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@ulisseandrea",
            "facebook": ""
        },
        {
            "id": 3188,
            "name": "Kamil",
            "surname": "Smuga",
            "biography": "I’m passionate about running software in production - monitoring, scaling, HA, performance, incident management, and all that jazz.  \r\nStarted in software quality, worked as an SRE, moved to software development and currently running a team of programmers in Salesforce.",
            "role": "Software Development Manager",
            "company": "Salesforce",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@kamilsmuga",
            "facebook": ""
        },
        {
            "id": 3199,
            "name": "Alessandro",
            "surname": "Piva",
            "biography": "With a deep interest in technology and videogames since I was a child, I partecipated as a contestant in the International Olympiad of Informatics 2004 in Athens, Greece, winning a bronze medal. After getting my Bachelor's Degree in Computer Science at University of Rome \"La Sapienza\" in 2008, I started my career in videogame development as a Systems Programmer at Rockstar North, Edinburgh, where I worked on massive hit Grand Theft Auto V. Since 2014 I've been working at Kunos Simulazioni as a Senior Programmer, taking care of the console port of Assetto Corsa and general engine programming.",
            "role": "Senior Programmer",
            "company": "Kunos Simulazioni s.r.l.",
            "community": "",
            "website": "http:\/\/www.kunos-simulazioni.com",
            "github": "",
            "twitter": "@a_piva",
            "facebook": "https:\/\/www.facebook.com\/alessandro.piva.313"
        },
        {
            "id": 3200,
            "name": "Mihai",
            "surname": "Bojin",
            "biography": "I am a lead software developer in the Customer Centric Engineering team in Salesforce which solves the toughest of production problems fast and helps prevent recurrences.",
            "role": "Lead Software Developer",
            "company": "Salesforce",
            "community": "",
            "website": "",
            "github": "https:\/\/github.com\/mihaibojin",
            "twitter": "@mihaibojin",
            "facebook": ""
        },
        {
            "id": 3204,
            "name": "Emanuele",
            "surname": "Macri",
            "biography": "Creo esperienze multimediali, che siano esse un sito web, un'applicazione mobile o una Web App. Comincio dallo studio della UX, per poi passare a sporcarmi le mani con i wireframe e andando avanti a creare l'interfaccia grafica. Infine mi occupo di impacchettare il tutto dentro mockup statici, in HTML5, CSS3 e JavaScript.",
            "role": "Designer and Front End Developer",
            "company": "nois3",
            "community": "DEED",
            "website": "https:\/\/nois3.it",
            "github": "",
            "twitter": "@emanuelemacri",
            "facebook": "https:\/\/www.facebook.com\/ehm.en.ems"
        },
        {
            "id": 3205,
            "name": "Luca",
            "surname": "Ferretti",
            "biography": "\"I break stuff, I build relationships\"\r\n\r\nQuality Assurance Engineer with a diverse range of IT skills, involved in UX\/Interaction, automated testing and open source.",
            "role": "Lead Quality Assurance Engineer",
            "company": "Immobiliare.it",
            "community": "DEED, GNOME, Ubuntu",
            "website": "http:\/\/elleuca.me",
            "github": "",
            "twitter": "@elleuca",
            "facebook": "https:\/\/www.facebook.com\/elle.uca"
        },
        {
            "id": 3207,
            "name": "Mandhir",
            "surname": "Gidda",
            "biography": "Mandhir Gidda is the solutions architect for GridGain EMEA. Having worked as a software engineer and architect both in consulting services and advertising\/marketing technology and has specialised in high-performance in-memory computing. He has subsequently had hands-on experience with a broad range of technologies and use cases across a number of industry verticals. He has a passion and motivation for solving complex problems and finding new innovative ways to use technology. He is a subject matter expert in in-memory computing and Big Data with an MSc in Interactive Computer Systems",
            "role": "EMEA Solutions Architect",
            "company": "Gridgain Systems",
            "community": "",
            "website": "www.gridgain.com",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3208,
            "name": "Fabrizio",
            "surname": "Brugnaro",
            "biography": "I played videogames since I was a child. Now I'm 25 and I managed to get to the other side. After I graduated from Roma Tre in Computer Engineering, I got to work for Kunos Simulazioni and I have been part of the development team of Assetto Corsa for three years. There I worked on porting the game from PC to PlayStation 4 and XboxOne.",
            "role": "Programmer",
            "company": "Kunos Simulazioni",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3217,
            "name": "Elisabetta",
            "surname": "Rinaldi",
            "biography": "I'm a manager at IBM Italy since 2007. I joined this company in 1999 and I covered several technical roles. I realized at that time that IBM is a huge company, helping me to understand that I was strong not only on technical challenges, but also able to effectively deal with multiple people covering several different roles. An extraordinary team player. I was recognized at that time as leader, and this brought me into a management position with people responsibility. People are my main motivation today, nothing is achievable without them.",
            "role": "IBM Bluemix Security and Compliance Manager",
            "company": "IBM",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "",
            "facebook": ""
        },
        {
            "id": 3219,
            "name": "Giovanni",
            "surname": "Bajo",
            "biography": "Passionate programmer and software architect. I'm in deep love with good, non over-engineered, simple software design, and with elegant code. I started programming as a child, on a trusty Commodore 64 that Dad bought me when I was young. After a brief start in the videogame industry, I met Linux and the free software world, and I decided to dedicate myself to it, completely and passionately, building my career first as a consultant and then as an entrepreneur. I’m among the pioneers of Python in Italy.",
            "role": "Developer Relations",
            "company": "Digital Transformation Team",
            "community": "",
            "website": "",
            "github": "",
            "twitter": "@giovannibajo",
            "facebook": ""
        }
    ],
    "speakerstotalks": [
        {
            "speakerid": 43,
            "talkid": 5640,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 68,
            "talkid": 4957,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 76,
            "talkid": 5784,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 93,
            "talkid": 5511,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 138,
            "talkid": 4877,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 141,
            "talkid": 4626,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 159,
            "talkid": 5083,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 167,
            "talkid": 5616,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 168,
            "talkid": 5515,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 181,
            "talkid": 5011,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 185,
            "talkid": 4097,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 190,
            "talkid": 5270,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 190,
            "talkid": 5801,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 243,
            "talkid": 4935,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 297,
            "talkid": 4963,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 310,
            "talkid": 4867,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 324,
            "talkid": 5516,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 338,
            "talkid": 5615,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 349,
            "talkid": 5724,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 359,
            "talkid": 5794,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 385,
            "talkid": 5611,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 388,
            "talkid": 5107,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 391,
            "talkid": 5706,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 404,
            "talkid": 4593,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 460,
            "talkid": 4921,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 525,
            "talkid": 5041,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 525,
            "talkid": 5044,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 599,
            "talkid": 5435,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 679,
            "talkid": 4048,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 774,
            "talkid": 5801,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 889,
            "talkid": 5813,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 923,
            "talkid": 5652,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 967,
            "talkid": 5765,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 997,
            "talkid": 4728,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1057,
            "talkid": 4715,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1101,
            "talkid": 4512,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1104,
            "talkid": 3965,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1104,
            "talkid": 3969,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1121,
            "talkid": 5682,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1148,
            "talkid": 5611,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 1178,
            "talkid": 5781,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1263,
            "talkid": 5089,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1263,
            "talkid": 240001,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1281,
            "talkid": 4652,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1330,
            "talkid": 4969,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1341,
            "talkid": 5222,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1350,
            "talkid": 4482,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1390,
            "talkid": 4431,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1405,
            "talkid": 5074,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1467,
            "talkid": 4697,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1468,
            "talkid": 4547,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1530,
            "talkid": 4993,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1551,
            "talkid": 5179,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1611,
            "talkid": 5674,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1614,
            "talkid": 5674,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 1654,
            "talkid": 5812,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 1673,
            "talkid": 4015,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1700,
            "talkid": 4548,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1711,
            "talkid": 5800,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1801,
            "talkid": 5743,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1854,
            "talkid": 5074,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 1862,
            "talkid": 4625,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1970,
            "talkid": 5714,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1977,
            "talkid": 5019,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 1985,
            "talkid": 5714,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 1987,
            "talkid": 4974,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2013,
            "talkid": 5026,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2040,
            "talkid": 4354,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2040,
            "talkid": 4357,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2062,
            "talkid": 4950,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2103,
            "talkid": 4561,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2120,
            "talkid": 4894,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2123,
            "talkid": 4636,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 2159,
            "talkid": 4752,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2202,
            "talkid": 4700,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2373,
            "talkid": 4507,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2488,
            "talkid": 4634,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2488,
            "talkid": 5623,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2491,
            "talkid": 4731,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2503,
            "talkid": 5093,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2519,
            "talkid": 4636,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2522,
            "talkid": 4529,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2538,
            "talkid": 5682,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 2540,
            "talkid": 4503,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2557,
            "talkid": 4716,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2574,
            "talkid": 4904,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2585,
            "talkid": 5634,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2588,
            "talkid": 5717,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2588,
            "talkid": 240000,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2610,
            "talkid": 5672,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2664,
            "talkid": 5114,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2709,
            "talkid": 5724,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 2710,
            "talkid": 5006,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2715,
            "talkid": 5106,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2735,
            "talkid": 5284,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2759,
            "talkid": 5254,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2847,
            "talkid": 5367,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2898,
            "talkid": 5512,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 2904,
            "talkid": 5555,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3013,
            "talkid": 5536,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3050,
            "talkid": 5614,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3064,
            "talkid": 5727,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3098,
            "talkid": 5654,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3105,
            "talkid": 5666,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3107,
            "talkid": 5670,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3123,
            "talkid": 5681,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3125,
            "talkid": 5684,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3131,
            "talkid": 5732,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3140,
            "talkid": 5714,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 3146,
            "talkid": 5737,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3146,
            "talkid": 240000,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 3151,
            "talkid": 5730,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3152,
            "talkid": 5730,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 3176,
            "talkid": 5756,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3180,
            "talkid": 5751,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3184,
            "talkid": 5762,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3188,
            "talkid": 5789,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3199,
            "talkid": 5782,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3200,
            "talkid": 5789,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 3204,
            "talkid": 5798,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 3205,
            "talkid": 5798,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3207,
            "talkid": 5799,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3208,
            "talkid": 5782,
            "eventid": 24,
            "role": "cospeaker"
        },
        {
            "speakerid": 3217,
            "talkid": 5812,
            "eventid": 24,
            "role": "speaker"
        },
        {
            "speakerid": 3219,
            "talkid": 5743,
            "eventid": 24,
            "role": "cospeaker"
        }
    ],
    "updated_at": "2017-03-20 09:07:56"
}